namespace liaqati_master.Data
{
    public static class Database
    {
        public static string AdminPolicy => "AdminPolicy";
        public static string ExpertPolicy => "ExpertPolicy";
        public static string UserPolicy => "UserPolicy";
        public static string Admin => "Admin";
        public static string Expert => "Expert";
        public static string User => "User";
        public static string PerventDisabledPolicy => "PerventDisabledPolicy";
        public static string LoggedInPolicy => "LoggedInPolicy";
        public static List<Notification> GetListOfNotifications()
        {

            return new List<Notification>()
            {

                new Notification(){Id="1",Title=" اشعار 1",Text="في قاموس المعاني الفوري مجال البحث مصطلحاتى",DATE=DateTime.Today,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="2",Title="اشعار 2",Text="في قاموس المعاني الفوري مجال البحث مصطلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على سسسسس",DATE=DateTime.Today,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="3",Title=" اشعار 3",Text="في قاموس المعاني الفوري مجال البحث مصطلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممممم",DATE=DateTime.Today,Time=new DateTime() , UserId="1"   },

                new Notification(){Id="4",Title="اشعار4",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=DateTime.Today.AddDays(-1) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="5",Title="اشعار5",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=DateTime.Today.AddDays(-1) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="6",Title="اشعار6",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=DateTime.Today.AddDays(-1) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="7",Title="اشعار7",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=DateTime.Today.AddDays(-1) ,Time=new DateTime() , UserId="1"   },

                new Notification(){Id="8",Title="اشعار6",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=new DateTime(2023,5,27) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="9",Title="اشعار7",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=new DateTime(2023,6,1) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="10",Title="اشعار7",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=new DateTime(2022, 9, 11) ,Time=new DateTime() , UserId="1"   },
                new Notification(){Id="11",Title="اشعار7",Text="طلحات الكل ضمن قاموس عربي عربي. معجم شامل يحوي على ممم",DATE=new DateTime(2021, 5, 17) ,Time=new DateTime() , UserId="1"   },

            };



        }


        public static List<Consultation> GetListOfConsultation()
        {
            return new List<Consultation>() {
        new Consultation() {
            Id = "1", Title = "عند وضع ثقل على القدم ورفعه أشعر بألم في الركبة، فهل السبب قلة الحركة؟", UserId = "5", CategoryId = "13", PostDate = new DateTime(year: 2023, month: 5, 1), Description = "عمري 32 سنة، عاطل أعزب، توقفت عن لعب كرة القدم لمدة شهر، والحمد لله أشعر بتحسن كبير في الركبة، واختفاء الألم، ولكن لاحظت أنني حينما أمارس تمرين تقوية الفخذ (بوضع ثقل على القدم ورفع القدم لمنتصف الساق المنثنية وإخراجها)، أشعر بألم خفيف من حين لآخر لمدة يوم أو يومين، وعندما أتوقف عن التمارين لأيام يختفي الألم بصورة كبيرة جداً.\r\n\r\nفهل لقلة الحركة وكثرة الجلوس دور في الإصابات المختلفة، مثل إصابة القدم والركبة والكتف والكعب والتي أتعرض لها؟ فأنا كثير الاستلقاء على السرير، وقليل الحركة جداً. وفي الفترة الأخيرة أصبحت أمشي من نصف ساعة لساعة ونصف في اليوم، وهل لطريقة المشي من فرد الجسم ورفع الرأس وسرعة المشي دور في الاستفادة من المشي؟",
          },
          new Consultation() {
            Id = "2", Title = "رياضة المشي والجري..المدة والمسافة والحذاء المناسب!", UserId = "5", CategoryId = "13", PostDate = new DateTime(year: 2023, month: 4, 18),
              Description = "<p>أسأل عن الرياضة، حيث إني قرأت وسمعت عن فوائدها، ولكني لا أجد المكان الملائم لممارسة الرياضة، وهي (الجري) إلا في البيت، حيث إني أجري حول الحديقة، وهي على شكل مستطيل، وبطول خمس وأربعين خطوة، أي طول المسافة التي حول المستطيل أي مجموع الأربعة أضلاع، يساوي خمساً وأربعين خطوة.<br><br>هل يمكن الجري في هذه المسافة؟ علماً بأن نصف المسافة أرض صلبة من الإسمنت، فهل الجري على الإسمنت يسبب لي أضراراً؟ خاصة في مفاصل الركبة.<br><br>إذا كان يسبب أضراراً فهل المشي على الإسمنت يسبب أضراراً كذلك؟ وما هي السرعة والمدة الزمنية التي يجب أن أستغرقها في المشي للحصول على الفوائد الصحية؟<br><br>أيهما أفضل المشي أم الجري؟ وما مدة وسرعة كل منهما؟ وهل إذا مارست الجري في الصباح وفي يوم من الأيام لم أتمكن من الجري، هل يمكن أن أجري في المساء لأعوض أم يجب أن أستمر على وقت معين؟<br><br>ما هي مواصفات حذاء الجري؟ هل الحذاء الواطي أم العالي أفضل؟ حيث إني لم أجد حذاء ذا مرونة جيدة.</p>",
          },
          new Consultation() {
            Id = "3", Title = "إمكانية أكل الحلويات والوجبات السريعة بكميات قليلة لمن يعالجون بالحمية الغذائية", UserId = "5", CategoryId = "14", PostDate = new DateTime(year: 2023, month: 3, 18),
              Description = "عمري 29 سنةً، وطولي 155 سم، وزني 66 كجم، أجريت حميةً غذائيةً، ونزل وزني من 75 إلى 66 كجم، وأحاول الآن أن أصل إلى وزني الطبيعي 54 كجم، لكن أحياناً أشتهي تناول الحلوى، فما هو مقدار الحلوى الذي أستطيع أن أتناوله كل مرة أو أسبوعياً؟ وهل أستطيع أن آكل القشطة مع ملعقة عسل طبيعي في الصباح الباكر، أم أن هذا يزيد الوزن؟ وهل يمكن أن آكل في أوقات متباعدة قطعة بيتزا أو همبرجر؟",
          },
          new Consultation() {
            Id = "4", Title = "ما هو الطعام الصحي للعمال الذين يعملون أعمالاً شاقة بشكل مستمر؟", UserId = "4", CategoryId = "14", PostDate = new DateTime(year: 2023, month: 2, 18),
              Description = "ما هو الطعام الصحي للعمال الذين يعملون أعمالاً شاقة بشكل مستمر؟",
          },
          new Consultation() {
            Id = "5", Title = "أريد أسماء حبوب ومكملات غذائية تزيد من وزني", UserId = "6", CategoryId = "13",
              Description = "أنا نحيفة جداً، حيث أن طولي 152 ووزني 43 وأنا بعمر 25 سنة، أخجل من نحافتي، تناولت حبوب ميساغور لمدة سنة، وتناولت الخميرة، ولم أستفد منها.\r\n\r\nأنا الآن أتناول حبوب زيت كبد الحوت، وكذلك الدبس، تعبت من نحافتي، فقد كنت سابقاً نحيفة لكن جسمي مقبول، ويمدحني الكثير، لكن الآن زادت نحافتي، أرجوكم أريد أسماء حبوب تزيد من وزني، وأسماء مكملات تمد جسمي بالطاقة والنشاط، ودعواتكم لي.",
          },
          new Consultation() {
            Id = "6", Title = "قامتي طويلة وكل صديقاتي أقصر مني، فهل يمكن تقليل طولي؟\r\n", UserId = "6", CategoryId = "13",
              Description = "أنا فتاة أبلغ من العمر 15 سنةً تقريباً، وطولي 1.73 ، ووزني 65 كغم، وأقوم بعمل حمية غذائية لأصل إلى 58 كغم، مشكلتي هي أنني أريد حلاً لطولي -أريد أن أقصر-؛ فكل الفتيات اللواتي بعمري أقصر مني، وأنا بصراحة لا أحب طولي، وهل سأطول أكثر أم لا؟\r\n\r\nوجزاكم الله خيراً.",
          },
          new Consultation() {
            Id = "7", Title = "ما هي الأطعمة التي تساعد على عودة جسم المرضع كما كان؟\r\n", UserId = "5", CategoryId = "14",
              Description = "<p>السلام عليكم ورحمة الله وبركاته.<br />\r\nرزقني الله طفلاً منذ أسبوعين، ولكن زوجتي تشتكي أن وزنها زاد جداً؛ لأنها في فترة الحمل كانت تأكل كثيراً حتى زاد وزنها، وتريد أن يعود جسمها كما كان، فقلت لها اشربي شاياً أخضر في الصباح، ولكنها تعتقد أن ما أصابها بسبب الرضاعة، فبماذا تنصحون؟<br />\r\nوما هي الأطعمة التي يفضل تناولها حتى يعود جسمها كما كان؟ وما هي الأطعمة التي تزيد من إفراز اللبن للطفل؟<br />\r\n&nbsp;</p>",
          },
          new Consultation() {
            Id = "8", Title = "النصائح النافعة للتخلص من الوزن الزائد", UserId = "5", CategoryId = "14",
              Description = "لقد تعبت من أطباء التغذية ومن نصائحهم المتناقضة، فكل طبيب ينقض كلام الذي سبقه، فأريد منكم نصائح يسيرة لتخفيف الوزن، والكرش، والصدر المترهل، علماً بأن وزني 68 كيلو، وطولي 160 سنتميتر.",
          },
          new Consultation() {
            Id = "9", Title = "عدد السعرات الحرارية لإعطاء التوازن للجسم", UserId = "3", CategoryId = "14",
              Description = "<p>عمري 27 سنة، ووزني 86 كجم، وطولي 175سم.<br />\r\nأمارس رياضة المشي يومياً بمعدل ساعة ونصف يومياً موزعة بين بعد الفجر وبعد العصر، بالإضافة إلى ممارستي لكرة القدم بالأسبوع بمعدل 10 ساعات.<br />\r\nعلى ضوء هذه البيانات كم سعرة حرارية لازمة لجسمي بحيث لا يحدث زيادة في الوزن؟ حيث إنني سريع التغير في الجسم إن لم أحافظ على الرياضة المتواصلة؟ وما هي المشروبات المفيدة لإزالة الدهون من الجسم؟<br />",
          },
          new Consultation() {
            Id = "10", Title = "هل دواء سبروفيتا ناجع لزيادة الوزن؟", UserId = "6", CategoryId = "14",
              Description = "أنا فتاة عمري 24 عاما, أعاني من نقص الوزن, وأريد أن يزيد وزني، جربت بعض الأدوية ولكن لم أر أي فائدة, مع العلم أنني لا أشكو من أي مرض والحمد لله.\r\n\r\nوزني 41 كيلو, وطولي 150 سم, سمعت عن حبوب اسمها سبروفيتا (cypro-vita)\r\nما رأيكم فيها؟ وهل لها أضرار؟\r\n",
          },
          //  new Consultation() {Id="",Title="", UserId="", CategoryId ="", Description="",},
      };
        }
        public static List<Replyconsultation> GetListOfReplyconsultation()
        {
            return new List<Replyconsultation>() {
        new Replyconsultation() {
            Id = "1", consId = "1", UserId = "2",
              Reply = "<p>بسم الله الرحمن الرحيم<br>السلام عليكم ورحمة الله وبركاته، وبعد:<br><br>كونك تمشي في الآونة الأخيرة من نصف ساعة إلى ساعة ونصف دون الشعور بالألم، فهذا أمر جيد، عليك المداومة عليه، والألم الذي تشعر به عند وضع ثقل على قدمك ورفعه أمر مرتبط بضعف اللياقة البدنية، وليس بإصابة في الركبة أو القدم، وأي شخص في النادي الرياضي إذا وضع ثقلًا على قدمه سوف يشعر بنوع من الألم قل أو كثر.<br><br>والمشي في اليوم 10000 خطوة يكفي جدًا لزيادة اللياقة البدنية، ولتحريك المفاصل والشفاء من الإصابات، ولا بأس بتحريك الذراعين، والنظر إلى الأمام أثناء المشي، والالتزام بالصلوات والنوافل، فهي رياضة في حد ذاتها، ونؤكد دائماً على ضبط مستوى فيتامين D، وفحص صورة الدم CBC، والتغذية الجيدة، والاستحمام بالماء البارد، إذا استطعت ذلك لكي تنشط الدورة الدموية.<br><br>وفقك الله لما فيه الخير.</p>",
          },
          new Replyconsultation() {
            Id = "2", consId = "2", UserId = "2",
              Reply = "<p>بسم الله الرحمن الرحيم<br>السلام عليكم ورحمة الله وبركاته، وبعد:<br><br>فإن المشي من الرياضات المتوسطة الإجهاد التي تساعد الناس على المحافظة على لياقتهم ورشاقتهم بحرق الطاقة الزائدة، ويقوي الجهاز الدوري، ويحسن من استخدام الأكسجين والطاقة في الجسم.<br><br>لذلك يقلل من المخاطر المرتبطة بالسمنة، والسكري، وارتفاع الضغط، وأمراض القلب، ويقوي العضلات في الأرجل والبطن والظهر، ويقوي العظام، ويقلل من إصابتها بالهشاشة.<br><br>من ناحية أخرى: فإن المشي يفيد في التخلص من الضغوط النفسية، والقلق والإجهاد اليومي، ويحسن من الوضع النفسي، ومن تجاوب الجهاز العصبي، ويساعد المشي على التخلص من الوزن الزائد، وهذا بالطبع يعتمد على مدة المشي وسرعته.<br><br>إذا مشيت بمعدل 4 كم/ ساعة فإن جسمك يحرق ما بين 200 &ndash; 250 سعراً حرارياً في الساعة (22 &ndash; 28 جرام من الدهون).<br><br>يمكنك مزاولة المشي في أي مكان وزمان بدون تجهيزات أو ملابس خاصة، ويمكن أن يكون جزءاً من الحياة اليومية، ويمكن أن يكون في أي وقت من النهار، ومن الأفضل تحديد وقت معين خلال اليوم للمشي، بحيث يكون جزءاً من جدولك في اليوم، وذلك للمحافظة على موعد المشي.<br><br>إذا كان غرض المشي مجرد اللياقة البدنية فيكفي المشي مدة 30 دقيقة على الأقل يومياً، أو ثلاث مرات أسبوعياً.<br><br>أما إذا كان الغرض تخفيف الوزن واللياقة البدنية فيلزمك المشي 30 دقيقة على الأقل يومياً، أو خمس مرات في الأسبوع.<br><br>يمكنك زيادة مدة المشي إلى ساعة يومياً لكسب مزيد من اللياقة، وتخفيف الوزن.<br><br>المشي من أقل التمارين الرياضية ضرراً على المفاصل، والأقل في احتمالات الإصابة خلال التمارين.<br><br>عندما تمشي ابق رأسك مرفوعاً، وانظر على بعد بضع خطوات أمامك، وحافظ على الفك السفلي في مكانه دون شد بل اجعل عضلاته منبسطة وابق الكتفين إلى الخلف دون شد، ولا تجعلهما منحنيين إلى الأمام، وحافظ على الصدر مرتفعاً والظهر مستقيماً وقائماً، ويجب أن تكون عضلات البطن مشدودة قليلاً إلى الداخل، وعضلات الورك والعجيزة (المؤخرة) مشدودة قليلاً إلى الداخل أيضاً.<br><br>لا بد أن يكون مفصل الركبة مرناً للحركة فلا تجعله مشدوداً بحيث يتحرك الساق والفخذ معاً.<br><br>اثن أصابع اليد للداخل بدون تكوين قبضة كاملة وبدون ضغط عليها، ولا تجعل يديك تتدلى والكف مفتوحة، اجعل الذراع بشكل زاوية قائمة من عند المرفق، وحرك يديك إلى الأمام والخلف بحيث ترتفع قبضة الكف إلى أعلى في حركة اليد إلى الأمام وتصل إلى محاذاة الورك في حركتها إلى الخلف، ولا تجعلها تتأرجح أمام جسمك، ومع حركة المشي ارجع ذراعيك إلى الخلف نحو الورك ولا تجعلهما يرتفعان في الهواء، وحركة الأذرع تأتي من الكتف وليس من المرفق.<br><br>إذا أردت المشي بسرعة فلا تجعل خطوتك واسعة، بل قم بزيادة عدد الخطوات (زيادة السرعة)، ولا تقصر من الخطوات بل الأفضل السير بالخطوات الطبيعية المريحة لك.<br><br>يختلف حذاء المشي عن الأحذية الأخرى التي تستخدم عادة، كما أنه يختلف عن بقية الأحذية الرياضية الخاصة بالجري أو التنس أو كرة القدم مثلاً؛ وذلك لأن آلية حركة القدم خلال المشي تختلف عنها في الرياضات الأخرى.<br><br>يجب أن يكون حذاء المشي ذا كعب عريض، ونعل مرن في الوسط، وأن يكون حاضناً للكعب دون أن يكون ضيقاً عليه، وأن تكون حركة أصابع الرجل في الطرف الأمامي للحذاء ممكنة.<br><br>كما يجب تغيير الحذاء إذا تآكل جزء من نعله، وعند شرائه يجب التأكد من أنه مريح من أول تجربة لبس له، وصفاته مطابقة لما تم ذكره.<br><br>هناك جوارب خاصة بالمشي وتمتاز أنها تسمح بتهوية القدمين وبالتخلص من العرق، ويجب أن يكون حجم الجوارب مناسباً لمقاس القدم بحيث لا تنطوي أو تكوّن زوائد تؤدي إلى رفع درجة حرارة القدم، وإلى الإصابة بالنفطات.<br><br>يجب أن تقوم بعملية التسخين قبل رياضة المشي، ويجرى التسخين بأداء بعض الحركات لليدين، والقفز والجري في المكان، أو المشي البطيء مدة 5 &ndash; 10 دقائق قبل المشي السريع.</p>",
          },
          new Replyconsultation() {
            Id = "3", consId = "3", UserId = "3",
              Reply = "<p>إن أردت أن تحافظي على وزنك فعليك أن تحافظي على أن يكون مقدار ما تأخذينه من طاقة من الطعام مساوياً للطاقة التي تحتاجينها يومياً، وتقدر بالنسبة لسنك بـ2200 كالوري بالمتوسط، وإن أردت أن تكوني دقيقةً أكثر فيمكنك مراجعة أخصائي تغذية، فيحسب لك بالتمام مقدار السعرات الحرارية اللازمة لك، والمناسبة لطولك، ووزنك، وعملك، والطاقة اللازمة لك، ويحتاج الجسم الطبيعي هذه المصادر لإنتاج الطاقة بنسب مختلفة:<br /><br />- الكربوهيدرات ( النشويات ) 50%.<br />- الدهون 35%.<br />- البروتينات 15%.<br /><br />الإنسان يحتاج لكمية مُحددة من السعرات الحرارية يومياً، وتزداد حسب نشاط الشخص وحجم جسده (الطول والوزن) وكذلك العمر، فالأطفال والشبان في طور النمو يحتاجون لكميات أكبر من السعرات الحرارية، ويجب أن يكون هناك توازن ما بين السعرات الحرارية التي نأخذها من الطعام والسعرات الحرارية التي نحرقها، حتى لا يزداد وزننا، حيث إن الجسم يُخزن السعرات الحرارية الزائدة عن حاجته على هيئة شحوم، ليستخدمها فيما بعد إذا اُضطر لذلك (في حال نقص السعرات الحرارية المأخوذة عن طريق الأكل)، وإذا أفرطنا في الأكل تزداد كمية الشحوم، وإذا قللنا الأكل فإن الجسم يستخدم الشحوم لإنتاج الطاقة ويحرقها، وبالتالي تقل الشحوم لدينا.<br />ولا يوجد ما يمنع أن تتناولي البيتزا أو الحلويات مرةً كل عدة أيام، بشرط أن تأخذي بعين الاعتبار كمية السعرات الحرارية التي تحويها هذه الأطعمة، وتحسب من ضمن السعرات الحرارية المسموح بها ذلك اليوم؛ لأن كل زيادة في الداخل من الطاقة إذا لم يقابلها حرق لهذه الطاقة، فإن ما يزيد يتحول إلى دهون وشحوم يجمعها الجسم في أماكن تخزين الدهون وهو البطن والأرداف، وأماكن أخرى من الجسم، ومتى قلت كمية الطعام الداخلة عن احتياج الجسم، فإن الجسم يبدأ باستهلاك الدهون في الجسم.</p>",
          },
          new Replyconsultation() {
            Id = "4", consId = "4", UserId = "3",
              Reply = "<p>بسم الله الرحمن الرحيم<br />السلام عليكم ورحمة الله وبركاته، وبعد:<br /><br />فإن السعرات الحرارية التي نحتاجها يومياً تقدر : 5000-5600 سعرة حرارية.<br />والطعام الصحي هو الطعام المتوازن المعتدل في الكمية والمختلف في النوع، وتختلف الأطعمة حسب كمية ونوعية المواد الغذائية التي تحتوي عليها، لذلك فمن المهم عند تنظيم التغذية اختيار أطعمة من كافة الأصناف ما أمكن ذلك.<br /><br />وأصناف الطعام الرئيسية هي:<br /><br />الحبوب/ الخضار والفواكه /اللحوم والأسماك /مشتقات الحليب/الدسم والزيوت/<br /><br /><br />ولذلك عليك حساب كمية السعرات الحرارية التي تلزمك، ثم تقسيمها على المواد الغذائية من الأطعمة المختلفة والمتنوعة.</p>",
          },
          new Replyconsultation() {
            Id = "5", consId = "1", UserId = "2",
              Reply = "<p>مع ضعف اللياقة البدنية وقلة الحركة فإن الجلوس مع ثني الركبة لفترات طويلة يؤدي إلى شد على الأربطة المحيطة بالمفصل، ويؤدي إلى الشعور بالألم، والأمر يحتاج إلى ممارسة رياضة المشي، وجعل هدف المشي 10000 خطوة على الجوال هدفاً يومياً، يجب العمل على تحقيقه قدر المستطاع.<br />\r\n<br />\r\nومن المعروف عموماً أن نقص فيتامين D يؤدي إلى ضعف في الأربطة والمفاصل والعظام، ولذلك يجب ضبط مستوى فيتامين D من خلال أخذ حقنة فيتامين D3 جرعة 300000 وحدة دولية، أو جرعة 200000 وحدة دولية حسب المتوفر، ثم تناول كبسولات فيتامين D3 الأسبوعية جرعة 50000 وحدة دولية، كبسولة واحدة أسبوعياً لمدة 12 أسبوعاً، مع الحرص على تناول المكملات الغذائية مثل: حبوب المغنسيوم جليسينات 500 مج، وفيتامين C واحد جرام بشكل يومي لمدة شهرين أو أكثر، وهي موجودة في الصيدليات، وفي محلات المكملات الغذائية.<br />\r\n<br />\r\nمع أهمية فحص صورة الدم CBC، وفحص فيتامين B12، ووظائف الغدة الدرقية TSH &amp; FT4، وتناول العلاج حسب نتيجة التحاليل، ولا مانع من تناول قرصين مسكن من باراسيتامول عند الضرورة، ولا قلق -إن شاء الله-.</p>",
          },
          new Replyconsultation() {
            Id = "6", consId = "5", UserId = "7",
              Reply = "<p>بسم الله الرحمن الرحيم</p>\r\n\r\n<p>السلام عليكم ورحمة الله وبركاته، وبعد:<br />\r\n<br />\r\nمؤشر كتلة الوزن الطبيعية &nbsp;لديك :43<br />\r\nمؤشر كتلة الوزن عندك= 18.6</p>\r\n\r\n<p>هذا يعني من الناحية الطبية أن وزنك يعتبر طبيعياً، وهو يعتبر الحدود الدنيا للوزن الطبيعي، وعلى كل حال فإن كنت تعتقدين أن وزنك أقل من المطلوب، فكما تعلمين فإن الوراثة تلعب دوراً كبيراً في تحديد شكل ووزن الإنسان، وكذلك فإن بعض الأشخاص يكون لديهم زيادة في نسبة الاستقلاب، وبالتالي فإنهم يتناولون كميات كبيرة من الطعام، ومع ذلك لا يزيد الوزن لديهم، وعلى كل حال فإنه يجب التأكد من الخلو من بعض الأمراض، مثل زيادة نشاط الغدة الدرقية ونقص الامتصاص والأمراض المزمنة، ولذا يجب التأكد من عدم وجود أحد هذه الأمراض.<br />\r\n<br />\r\nأما عن المكملات الغذائية إن أردت تناولها فمنها:<br />\r\n- Ensure وكل زجاجة تمنحك 250 سعرة حرارية.<br />\r\n- Ensure plus والعلبة الواحدة تعطيك 350 سعرة حرارية.<br />\r\n- Ensure high protein وكل زجاجة تمنحك 230 سعرة حرارية، وهو بشكل سائل في علب.<br />\r\n<br />\r\nوالله الموفق.</p>\r\n",
          },
          new Replyconsultation() {
            Id = "7", consId = "6", UserId = "7",
              Reply = "<p>بسم الله الرحمن الرحيم<br />\r\nالسلام عليكم ورحمة الله وبركاته، وبعد:<br />\r\n<br />\r\nكثير من الفتيات يحلمن أن يكون طولهن مثل طولك، فالقصيرات يتمنين أن يكن طوالاً، والطوال يتمنين أن يكن قصاراً، وأود أن أطمئنك حتى لا تشغلي بالك بأن طولك ممتاز، ولا يوجد أي شيء لتقصير الطول، لا دواء ولا جراحة، وعادة ما يتوقف نمو الفتيات في سن الـ 15-16 لذا قد يزداد طولك قليلاً بين 1-2 سم.<br />\r\n<br />\r\nالشيء الآخر هو وزنك، فوزنك طبيعي بالنسبة لطولك، ومؤشر كتلة الوزن عندك هي 21.2 وهذا يعتبر وزناً مثالياً، ولا تفكري كثيراً في إنقاصه، وإلا أصبح ذلك هاجساً عندك، فكثير من الفتيات يؤدي كثرة التفكير في أوزانهن وخوفهن من السمنة إلى أن يتوقفوا عن تناول الطعام، وقد يؤدي ذلك إلى مرض القمة العصبي، أو ما يسمى (Anorexia nervosa) فليس هناك أي شيء تستطيعين فعله لوزنك الذي يحلم به الكثير من الفتيات، فوزنك مناسب جداً لطولك، واحمدي الله تعالى على ما اختاره لك من طول.<br />\r\n<br />\r\nوالله الموفق.</p>\r\n",
          },
          new Replyconsultation() {
            Id = "8", consId = "7", UserId = "9",
              Reply = "<p>بسم الله الرحمن الرحيم<br />\r\nالسلام عليكم ورحمة الله وبركاته، وبعد:<br />\r\n<br />\r\nفنبارك لك المولود الجديد، ونسأل الله عز وجل أن يجعله قرة عين لك ولزوجتك، وأن يكون من أهل السعادة في الدارين.<br />\r\n<br />\r\nوبالنسبة لسؤالك عن زيادة الوزن التي حدثت عند زوجتك بعد الحمل والولادة؛ أقول لك: إن هناك ما بين 2 - 4 كج زيادة في الوزن تلاحظها أغلب السيدات في أوزانهن بعد الولادة، وهي زيادة طبيعية تحدث في الحمل لكل سيدة كنوع من الحماية للحمل، فإن كان وزن زوجتك الآن قد ازداد عن ما قبل الحمل من 2 - 4 كج فهذا أمر متوقع، وستخسره بالتدريج إن عادت إلى عاداتها الغذائية السابقة للحمل.<br />\r\n<br />\r\nلكن إن كان قد ازداد وزنها أكثر من ذلك؛ فهنا يكون السبب كثرة تناول الطعام، أو قلة ممارسة الرياضة، وهنا ننصحها بما يلي:<br />\r\n<br />\r\nأولا: يجب أن تعرف ما يلزمها من السعرات الحرارية التي يحتاجها جسمها، وتحسبها كالتالي: تأخذ حاصل ضرب وزنها بالكج في الرقم 30 فيكون الناتج هو ما يحتاجه جسمها من السعرات.<br />\r\n<br />\r\nأي إن كان وزنها 60 كلغ مثلاً: فيكون 60x30 = 1800 وحدة حرارية، وبما أنها مرضع نضيف عليها 300-400 وحدة فتكون حاجتها الحالية هي بحدود 2200-2100 وحدة يومياً، فإن أرادت أن تخفض وزنها، فيجب أن تتناول أقل من 2200 وحدة باليوم وهي مرضع، وأقل من 1800 وحدة بعد أن تفطم الطفل (إن كان وزنها 60 كج مثلاً).<br />\r\n<br />\r\nوعليها أن تأخذ نصف حاجتها من السعرات هذه من السكريات المركبة مثل: الخبز الكامل، والرز وماشابههما، وربع الكمية من البروتينات والحبوب والحليب ومشتقاته، والباقي من الفاكهة والخضروات، وهذا يعني تقليل الدهون إلى أقصى درجة.<br />\r\n<br />\r\nوسأعطيك أمثلةً عن محتوى بعض المواد من السعرات الحرارية، لتأخذ فكرة كيف تحسب زوجتك ما تأكل.<br />\r\n<br />\r\nمثلاً: البيضة المتوسطة الحجم تحتوي على ما يقارب 70 وحدة حرارية، وشريحة خبز التوست تحتوي على 60 وحدة، وكوب الحليب تقريباً 180 وحدة، وحبة موز أو تفاح أو برتقال 100 وحدة، وهكذا.<br />\r\n<br />\r\nوبالنسبة للشاي الأخضر: فهو مفيد جداً للصحة، ويساعد على تخفيض الوزن؛ لأنه ينشط الاستقلاب، ولا يضر المولود، ولا يؤثر على الإرضاع؛ لذلك يمكن لزوجتك تناوله يومياً بمعدل كوب في الصباح، وكوب عند العصر.<br />\r\n<br />\r\nوالأطعمة المفيدة لإدرار الحليب كثيرة، وأهمها: الحليب نفسه، والعصائر الطازجة، وحبة البركة، والتمر.<br />",
          },
          new Replyconsultation() {
            Id = "9", consId = "8", UserId = "9",
              Reply = "<p>&nbsp;</p>\r\n\r\n<p>سم الله الرحمن الرحيم<br />\r\nالسلام عليكم ورحمة الله وبركاته، وبعد:<br />\r\n<br />\r\nأنت ما زلت في سن 15 سنة، وكما ترى فإن هناك زيادة في وزنك، مع كرش وترهل، وأهم نصيحة لك هو المشي، والمشي، ثم المشي، فعلى ما يبدو أن عندك استعداداً لزيادة الوزن، والمشي يساعد على تنقيص الوزن، والتخلص من الدهون في منطقة الكرش والردفين، ويعطيك الشعور بالحيوية، وتشعر أنك تصنع شيئاً لنفسك، بالإضافة إلى فوائدها الكثيرة على القلب والعضلات والرئتين، والدورة الدموية، والعظام.<br />\r\n<br />\r\nأما الطعام فكل مما يأكل الأهل في البيت، ولكن قلل من كمية الطعام التي عودت نفسك أن تأكلها ولو بنسبة 10% وبالتدرج، أيضاً استمر بتنقيص هذه الكمية، حتى تتعود المعدة على كمية طعام قليلة لملئها.<br />\r\n<br />\r\nمن ناحية أخرى يفضل تناول عدة وجبات في اليوم، أي 4 - 5 وجبات صغيرة بدلاً من وجبتين ثقيلتين، والفكرة من هذا أن الوجبات الصغيرة تقلل عندك الشعور بالجوع، وأكثر من الفواكه والخضار كلما شعرت بالجوع، وقلل من الشوكولاتا والطعام الدسم، وكل الخبز الأسمر.<br />\r\n<br />\r\nعليك بتمارين البطن والورك والصدر، وهذه يمكن أن تجريها في الأول تحت إشراف أحد المدربين، ثم تجريها بنفسك.</p>\r\n",
          },
          new Replyconsultation() {
            Id = "10", consId = "9", UserId = "9",
              Reply = "<p>بسم الله الرحمن الرحيم<br />\r\nلسلام عليكم ورحمة الله وبركاته، وبعد:<br />\r\nفواضح من طولك ووزنك أن هناك زيادة في وزنك بالنسبة لطولك، فأعلى نسبة طبيعية لوزنك بالنسبة لطولك هي 77 كيلو، وحتى لو تجازونا ذلك لـ80 فإن هناك ما زالت عدة كيلوات للفقدان، وأنت تقول إنك تريد كم سعرة حرارية بحيث لا يزيد وزنك.<br />\r\n<br />\r\nجسم الإنسان يحتاج إلى &quot;1&quot; من السعرات الحرارية لكل كيلو جرام من وزنه في كل ساعة زمنية ليعمل للاحتراق الداخلي، أي أن الجسم يحتاج إلى هذه السعرات لكي تعمل جميع أعضائه وأجهزته، مثل جهاز التنفس وضخ الدم والتفكير.<br />\r\n<br />\r\nفالإنسان الذي يزن: 86 كيلو جراماً يحتاج إلى 86&times;1&times;24=2024 سعرةً حراريةً خلال أربع وعشرين ساعة.<br />\r\n<br />\r\nهذا الرقم هو ما يحتاج إليه الجسم ليعمل دون أي مجهودات إضافية، ولحساب السعرات التي يحتاج إليها الإنسان ليعمل هناك ثلاثة معدلات تختلف باختلاف الجهد الذي يبذله الإنسان:<br />\r\n<br />\r\nفإذا كان هذا الإنسان قليل الحركة ( كأن يعمل في مكتب) يكون معدل احتياجه هو 1.3 سعرة حرارية لكل كيلوجرام من وزنه، ويكون حساب احتياجه كالتالي:<br />\r\n86&times;24&times;1.3=2683 سعرةً حراريةً.<br />\r\n<br />\r\nوإذا كان يبذل مجهوداً متوسطاً، فإن معدل احتياجه يزيد ليصبح 1.4 لكل كيلو جرام من وزنه، ويكون حساب احتياجه كالتالي: 86X1.4X24=2890 سعراً حرارياً.<br />\r\n<br />\r\nوإما إذا كان يعمل عملاً مجهداً جسدياً فإنه يحتاج إلى 1.5 سعرًا حراريًا لكل كيلو جرام من وزنه .. ويكون حساب احتياجه كالتالي: 86X1.5X24=3096 سعراً حراريا.<br />\r\nالمشي للساعة الواحدة 13- 300 سعرة حرارية.<br />\r\nالـسـباحة 200 - 700 سعرة حرارية.<br />\r\nركوب الدراجة 180- 300 سعرة حرارية.<br />\r\nأما كرة القدم فتصرف 10 سعرات لكل دقيقة.<br />\r\n<br />\r\nأما عن المشروبات المفيدة؛ ومنها: الزنجبيل، فهو مفيدٌ جداً للجسم، ويمكن أخذ كوبٍ من مشروب الزنجبيل مساءً.<br />\r\n<br />\r\nومن المشروبات المفيدة أيضاً الشاي الأخضر، وهو يساعد على تسريع عملية استقلاب الغذاء؛ لأن تأثيره المضاد للأكسدة يساعد الكبد على أداء وظيفته بشكلٍ أكثر فعالية، كما أن شرب الشاي الأخضر ثلاث مرات يومياً يحرق 200 سعرة حرارية إضافية يومياً، ولقد وجد الأشخاص الذين يتناولون الشاي الأخضر أن الطاقة لديهم تعزَّزَت بشكلٍ كبير.<br />\r\n<br />\r\nوعلاوةً على ذلك؛ فإن الشاي الأخضر يخفِّض مستوى السكر في الدم، والذي يعتبر مسئولاً عن خزن الجلوكوز على شكل شحوم، ولذا فإن تخفيض مستوى السكر يُخفض أيضاً مستوى الشحوم المخزونة في الجسم.<br />",
          },
          new Replyconsultation() {
            Id = "11", consId = "10", UserId = "9",
              Reply = "<p>بسم الله الرحمن الرحيم<br />\r\nالسلام عليكم ورحمة الله وبركاته وبعد،،،<br />\r\nهذا الدواء يحتوي على ما يلي:</p>\r\n\r\n<ul>\r\n\t<li>&nbsp;سيبروهيبتادين هيدروكلورايد.</li>\r\n\t<li>فيتامين (أ).</li>\r\n\t<li>فيتامين (د3).</li>\r\n\t<li>&nbsp;ثيامين مونوترات(فيتامين ب1).</li>\r\n\t<li>&nbsp;ريبو فلافين(فيتامين ب2).</li>\r\n\t<li>&nbsp;بيريدوكسين هيدروكلورايد(فيتامين ب6).</li>\r\n\t<li>&nbsp;سيانو كوبالامين (فيتامين ب 12).</li>\r\n\t<li>&nbsp;نياسيناميد.</li>\r\n\t<li>-حمض الأسكوربيك (الفيتامين سي).</li>\r\n</ul>\r\n\r\n<p>فكما ترين فهو مجموعة من الفيتامينات مع دواء سيبروهبتادين Cyproheptadine, وهذا الدواء هو يستعمل السيبروهيبتادين لعلاج بعض الحالات المرضية, ومنها على سبيل المثال لا الحصر:<br />\r\nردة فعل الحساسية مثل حساسية الأنف, الكوابيس, فرط التعرق.<br />\r\nيسبب استخدام السيبروهيبتادين الأعراض الجانبية التالية:<br />\r\nالدوار, غشاوة الرؤية, الإمساك, جفاف الفم والحلق, أو الأنف, سرعة الهيجان, الغثيان, العصبية والقلق, التململ.<br />\r\nومن أعراضه الجانبية هو فتح الشهية, فهذا هو سبب استخدامه في النحافة, أي لأنه يفتح الشهية, والفيتامينات الأخرى موجودة في كثير من المركبات التي تحتوي على الفيتايمنات, فهو ليس دواء جديدا في الحقيقة, وإنما وضعوا في هذا المركب السيبروهيباتادين الذي يستخدم من سنوات طويلة, وموجود في الأسواق, ووضعوا معه فيتامينات.<br />\r\nفيمكن استخدامه, تبدئين بحبة واحدة لعدة أيام؛ لأنه قد يسبب الأعراض الجانبية التي ذكرناها, ومن ثم يمكن أن تزيدي الجرعة بعد ذلك إلى حبتين, فإن تحسنت الشهية يمكن أن تستمري على حبيتين, ويمكن أن تزيدي إلى ثلاث حبات إن لزم الأمر</p>",
          },
          //  new Replyconsultation(){Id="", consId ="",UserId ="", Reply="",},
      };
        }
        public static List<SportsProgram> GetListOfSportsProgram()
        {
            return new List<SportsProgram>() {
        new SportsProgram {
          Id = "100",
            Length = 4,
            Duration = 34,
            BodyFocus = "الجسم السفلي ",
            Difficulty = 3,
            Equipment = "خطوة التمرين ، الدمبل ، حزام التمرين",
            TrainingType = "تدريب القوة",
            Image = "/Images/Program/10.jpg",

            Video = "https://www.youtube.com/embed/q-hSDZspXVQ",
            BurnEstimate = "50-250",

        },

        new SportsProgram {
          Id = "101",
            Length = 1,
            Duration = 37,
            BodyFocus = "كل الجسم ",
            Difficulty = 3,
            Equipment = "الدمبل ، حزام التمرين ، الكتيل بيل ، حصيرة ، بدون معدات",
            TrainingType = "القلب والأوعية الدموية ، تأثير منخفض ، تدريب القوة ، التنغيم ، اليوجا ، الحركة",
            Image = "/Images/Program/11.jpg",

            Video = "https://www.youtube.com/embed/q-hSDZspXVQ",
            BurnEstimate = "50-100",

        },

        new SportsProgram {
          Id = "102",
            Length = 2,
            Duration = 44,
            BodyFocus = " كل الجسم ",
            Difficulty = 2,
            Equipment = "الدمبل، حصيرة",
            TrainingType = "تدريب القوة",
            Image = "/Images/Program/12.jpg",

            Video = "https://www.youtube.com/embed/q-hSDZspXVQ",
            BurnEstimate = "50-200",

        },

        new SportsProgram {
          Id = "103",
            Length = 8,
            Duration = 35,
            BodyFocus = "كل الجسم ",
            Difficulty = 1,
            Equipment = "الدمبل ",
            BurnEstimate = "50-350",

            TrainingType = "تدريب متقطع عالي الكثافة ، تأثير منخفض ، بيلاتيس ، تدريب القوة ، التمدد / المرونة ، القدرة على الحركة",
            Image = "/Images/Program/13.jpg",
            Video = "https://www.youtube.com/embed/q-hSDZspXVQ",

        },

      };
        }
        //public static List<SportsProgram> GetListOfSportsProgram()
        //{
        //    return new List<SportsProgram>()
        //    {

        //        new SportsProgram
        //         {
        //             Id = "100",
        //             Length = 4,
        //             Duration =34,
        //             BodyFocus = "الجسم السفلي ",
        //             Difficulty = 3,
        //             Equipment = "خطوة التمرين ، الدمبل ، حزام التمرين",
        //             TrainingType = "تدريب القوة",
        //             Image="Images/Program/10.jpg"
        //         },

        //          new SportsProgram
        //         {
        //             Id = "101",
        //             Length = 1,
        //             Duration =37,
        //             BodyFocus = "كل الجسم ",
        //             Difficulty = 3,
        //             Equipment = "الدمبل ، حزام التمرين ، الكتيل بيل ، حصيرة ، بدون معدات",
        //             TrainingType = "القلب والأوعية الدموية ، تأثير منخفض ، تدريب القوة ، التنغيم ، اليوجا ، الحركة",

        //                Image="Images/Program/11.jpg"

        //          },

        //            new SportsProgram
        //         {
        //             Id = "102",
        //             Length = 2,
        //             Duration =44,
        //             BodyFocus = " كل الجسم ",
        //             Difficulty = 2,
        //             Equipment = "الدمبل، حصيرة",
        //             TrainingType = "تدريب القوة",
        //                Image="Images/Program/12.jpg"
        //            },

        //              new SportsProgram
        //         {
        //             Id = "103",
        //             Length = 8,
        //             Duration =35,
        //             BodyFocus = "كل الجسم ",
        //             Difficulty = 1,
        //             Equipment = "الدمبل ",
        //             TrainingType = "تدريب متقطع عالي الكثافة ، تأثير منخفض ، بيلاتيس ، تدريب القوة ، التمدد / المرونة ، القدرة على الحركة",
        //                Image="Images/Program/13.jpg"
        //              },

        //    };
        //}
        public static List<Category> GetListOfCategories() => new() {
      /*
عامة
الصيام المتقطع
وصفات صحية
رياضة
رجيم الشتاء
الكرش
أنظمة غذائية
مرض السكري
شرب المياة
خرافات شائعة
رحلتى مع الدايت
وصفات رمضانية
نصائح رمضانية*/
      new Category {
        Id = "1", Name = "طبق رئيسي", Target = GetListOfTargets()[nameof(HealthyRecipe)]
      },
      new Category {
        Id = "2", Name = "أكل صحي", Target = GetListOfTargets()[nameof(HealthyRecipe)]
      },
      new Category {
        Id = "3", Name = "المكملات الغذائية", Target = GetListOfTargets()[nameof(Product)]
      },
      new Category {
        Id = "4", Name = "الاجهزة الرياضية", Target = GetListOfTargets()[nameof(Product)]
      },
      new Category {
        Id = "5", Name = "حلوى", Target = GetListOfTargets()[nameof(HealthyRecipe)]
      },
      new Category {
        Id = "6", Name = "الأنظمة الحديثة", Target = GetListOfTargets()[nameof(MealPlans)]
      }, new Category {
        Id = "8", Name = "عامة", Target = GetListOfTargets()[nameof(Product)]
      }, new Category {
        Id = "9", Name = "الصيام المتقطع", Target = GetListOfTargets()[nameof(Article)]
      }, new Category {
        Id = "10", Name = "رياضة", Target = GetListOfTargets()[nameof(Product)]
      }, new Category {
        Id = "11", Name = "مرض السكري", Target = GetListOfTargets()[nameof(Product)]
      }, new Category {
        Id = "12", Name = "شرب المياة", Target = GetListOfTargets()[nameof(Product)]
      },
    };
        public static Dictionary<string, string> GetListOfTargets() => new() {
      {
        nameof(Product), "المنتجات"
      }, {
        nameof(SportsProgram),
        "البرامج الرياضية"
      }, {
        nameof(HealthyRecipe),
        "الوصفات الصحية"
      }, {
        nameof(MealPlans),
        "الأنظمة الرياضية"
      }, {
        nameof(Exercise),
        "التمارين"
      }, {
        nameof(Article),
        "المقالات"
      },
    };
        public static List<SelectListItem> GetListOfProgramLength() => new() {

      new SelectListItem() {
          Text = "1", Value = "1"
        },
        new SelectListItem() {
          Text = "2", Value = "2"
        },
        new SelectListItem() {
          Text = "8", Value = "8"
        },
        new SelectListItem() {
          Text = "4", Value = "4"
        },

    };
        public static List<SelectListItem> GetListOfMealPlanLength() => new() {

      new SelectListItem() {
          Text = "1", Value = "1"
        },
        new SelectListItem() {
          Text = "2", Value = "2"
        },
        new SelectListItem() {
          Text = "8", Value = "8"
        },
        new SelectListItem() {
          Text = "4", Value = "4"
        },

    };
        public static List<SelectListItem> GetListOfMealType() => new() {
      new SelectListItem {
        Value = "وجبة الإفطار", Text = "وجبة الإفطار"
      },
      new SelectListItem {
        Value = "وجبة غداء", Text = "وجبة غداء"
      },
      new SelectListItem {
        Value = "وجبة عشاء", Text = "وجبة عشاء"
      },
      new SelectListItem {
        Value = "وجبة خفيفة", Text = "وجبة خفيفة"
      },
      new SelectListItem {
        Value = "حلوى", Text = "حلوى"
      },
      new SelectListItem {
        Value = "طبق جانبي", Text = "طبق جانبي"
      },
    };
        public static List<SelectListItem> GetListOfDietaryType() => new() {
      new SelectListItem {
        Value = "نباتي", Text = "نباتي"
      },
      new SelectListItem {
        Value = "حيواني", Text = "حيواني"
      },
    };
        public static List<SelectListItem> GetListOfBodyFocus() => new() {

      new SelectListItem() {
          Text = "الجسم السفلي من الجسم", Value = " الجسم السفلي من الجسم"
        },
        new SelectListItem() {
          Text = "الجزء العلوي من الجسم", Value = "الجزء العلوي من الجسم"
        },
        new SelectListItem() {
          Text = "جوهر", Value = "جوهر"
        },
        new SelectListItem() {
          Text = "الجسم بالكامل", Value = "الجسم بالكامل"
        }

    };
        public static List<SelectListItem> GetListOfTrainingType() => new() {
      new SelectListItem() {
          Text = "HIIT", Value = "HIIT"
        },
        new SelectListItem() {
          Text = "بيلاتيس", Value = "بيلاتيس"
        },
        new SelectListItem() {
          Text = "كيتل بيل", Value = "كيتل بيل"
        },
        new SelectListItem() {
          Text = "الكيك بوكسينغ", Value = "الكيك بوكسينغ"
        },
        new SelectListItem() {
          Text = "التنغيم", Value = "التنغيم"
        },
        new SelectListItem() {
          Text = "التوازن / الرشاقة", Value = "التوازن / الرشاقة"
        },
        new SelectListItem() {
          Text = "بليومترك", Value = "بليومترك"
        },
        new SelectListItem() {
          Text = "باري", Value = "باري"
        },
        new SelectListItem() {
          Text = "اليوغا", Value = "اليوغا"
        },
        new SelectListItem() {
          Text = "الاحماء / التبريد", Value = "الاحماء / التبريد"
        },
        new SelectListItem() {
          Text = "تأثير ضعيف", Value = "تأثير ضعيف"
        },
        new SelectListItem() {
          Text = "التمدد / المرونة", Value = "التمدد / المرونة"
        },
        new SelectListItem() {
          Text = "القلب والأوعية الدموية", Value = "القلب والأوعية الدموية"
        },
        new SelectListItem() {
          Text = "تدريب القوة", Value = "تدريب القوة"
        }

    };
        public static List<SelectListItem> GetListOfEquipment() => new() {

      new SelectListItem() {
          Text = "لا معدات", Value = "لا معدات"
        },
        new SelectListItem() {
          Text = "الدمبل", Value = "الدمبل"
        },
        new SelectListItem() {
          Text = "حصيرة", Value = "حصيرة"
        },
        new SelectListItem() {
          Text = "مقعد", Value = "مقعد"
        },
        new SelectListItem() {
          Text = "حزام التمارين الرياضية", Value = "حزام التمارين الرياضية"
        },
        new SelectListItem() {
          Text = "حبل قفز", Value = "حبل قفز"
        },
        new SelectListItem() {
          Text = "كيتل بيل", Value = "كيتل بيل"
        },
        new SelectListItem() {
          Text = "كرة طبية", Value = "كرة طبية"
        },
        new SelectListItem() {
          Text = "فيزيو بول", Value = "فيزيو بول"
        },
        new SelectListItem() {
          Text = "كيس الرمل", Value = "كيس الرمل"
        },
        new SelectListItem() {
          Text = "اسطوانة رغوة", Value = "اسطوانة رغوة"
        },
        new SelectListItem() {
          Text = "خطوة التمرين", Value = "خطوة التمرين"
        },
        new SelectListItem() {
          Text = "آخر", Value = "آخر"
        }

    };
        public static List<SelectListItem> GetListOfDifficulty() => new() {

      new SelectListItem() {
          Text = "1", Value = "1"
        },
        new SelectListItem() {
          Text = "2", Value = "2"
        },
        new SelectListItem() {
          Text = "3", Value = "3"
        },
        new SelectListItem() {
          Text = "4", Value = "4"
        },
        new SelectListItem() {
          Text = "5", Value = "5"
        },

    };
        public static List<User> GetListOfUsers()
        {
            return new List<User>() {
        new User() {
          Id = "1",
            Active = false,
            Wieght = 120,
            Height = 120,
            Gender = Gender.Male,
            Photo = "ssssssssssssssss",
            Cover_photo = "sssssssssssssssa",
            Fname = "sssssssssssssss",
            Lname = "sssssssssssssss",
            Exp_Years = 10
        }
      };
        }
        public static List<Comment_Servies> GetListOfComments_service()
        {
            return new List<Comment_Servies>()
            {
                new Comment_Servies(){
                    Id = "100",
                    Comment="أفضل موقع رياضى أستخدمته رائع و يستحق اكثر من خمس نجوم بل الكثير شكرأ على اي حال",
                    commentFor="برنامج رياضي",
                    Date=new DateTime(year: 2022, month: 3, 3),
                    repliedFor="mdd",
                    ServicesId="100",
                 RatePercentage=10,
                 Image="",
                 Name="ALAA",




                }
        };
        }
        public static List<Order> GetListOfOrders()
        {
            return new List<Order>() {
        new Order() {
          Id = "1",
            OrderDate = new DateTime(year: 2021, month: 5, 1),
            DiscountCode = "#15ar12",
            OrderStatus = 0,
            UserId = "1",
            TotalPrice = GetListOfOrdersDetails().Where(Order => Order.OrderId == "1").Sum(Order => Order.Price * Order.Quantity),
        }, new Order() {
          Id = "2",
            OrderDate = new DateTime(year: 2021, month: 5, 1),
            DiscountCode = "#13da32",
            OrderStatus = 1,
            UserId = "1",
            TotalPrice = GetListOfOrdersDetails().Where(Order => Order.OrderId == "2").Sum(Order => Order.Price * Order.Quantity),

        }, new Order() {
          Id = "3",
            OrderDate = new DateTime(year: 2021, month: 5, 1),
            DiscountCode = "#47as32",
            OrderStatus = 2,
            UserId = "1",
            TotalPrice = GetListOfOrdersDetails().Where(Order => Order.OrderId == "3").Sum(Order => Order.Price * Order.Quantity),

        }
      };
        }
        public static List<Order_Details> GetListOfOrdersDetails()
        {
            return new List<Order_Details>() {
        new Order_Details() {
            Id = "1", OrderId = "1", Price = 100, RateId = 1, Quantity = 2, ServiceId = "21"
          },
          new Order_Details() {
            Id = "2", OrderId = "1", Price = 100, RateId = 1, Quantity = 2, ServiceId = "21"
          },
          new Order_Details() {
            Id = "3", OrderId = "1", Price = 100, RateId = 1, Quantity = 2, ServiceId = "21"
          },
          new Order_Details() {
            Id = "4", OrderId = "2", Price = 100, RateId = 1, Quantity = 7, ServiceId = "31"
          },
          new Order_Details() {
            Id = "5", OrderId = "2", Price = 100, RateId = 1, Quantity = 5, ServiceId = "31"
          },
          new Order_Details() {
            Id = "6", OrderId = "2", Price = 100, RateId = 1, Quantity = 3, ServiceId = "24"
          },
          new Order_Details() {
            Id = "7", OrderId = "3", Price = 100, RateId = 1, Quantity = 2, ServiceId = "23"
          },
          new Order_Details() {
            Id = "8", OrderId = "3", Price = 100, RateId = 1, Quantity = 4, ServiceId = "23"
          },
          new Order_Details() {
            Id = "9", OrderId = "3", Price = 100, RateId = 1, Quantity = 10, ServiceId = "23"
          },
          new Order_Details() {
            Id = "10", OrderId = "1", Price = 100, RateId = 1, Quantity = 2, ServiceId = "23"
          },
          new Order_Details() {
            Id = "11", OrderId = "1", Price = 100, RateId = 1, Quantity = 2, ServiceId = "23"
          },
          new Order_Details() {
            Id = "12", OrderId = "1", Price = 100, RateId = 1, Quantity = 3, ServiceId = "23"
          },
          new Order_Details() {
            Id = "13", OrderId = "2", Price = 100, RateId = 1, Quantity = 7, ServiceId = "24"
          },
          new Order_Details() {
            Id = "14", OrderId = "2", Price = 100, RateId = 1, Quantity = 5, ServiceId = "24"
          },
          new Order_Details() {
            Id = "15", OrderId = "2", Price = 100, RateId = 1, Quantity = 3, ServiceId = "24"
          },
          new Order_Details() {
            Id = "16", OrderId = "3", Price = 100, RateId = 1, Quantity = 4, ServiceId = "24"
          },
          new Order_Details() {
            Id = "17", OrderId = "3", Price = 100, RateId = 1, Quantity = 4, ServiceId = "24"
          },
          new Order_Details() {
            Id = "18", OrderId = "3", Price = 100, RateId = 1, Quantity = 10, ServiceId = "24"
          },
          new Order_Details() {
            Id = "19", OrderId = "1", Price = 100, RateId = 1, Quantity = 5, ServiceId = "31"
          },
          new Order_Details() {
            Id = "20", OrderId = "1", Price = 100, RateId = 1, Quantity = 6, ServiceId = "31"
          },
          new Order_Details() {
            Id = "21", OrderId = "1", Price = 100, RateId = 1, Quantity = 10, ServiceId = "31"
          },
          new Order_Details() {
            Id = "22", OrderId = "2", Price = 100, RateId = 1, Quantity = 7, ServiceId = "31"
          },
          new Order_Details() {
            Id = "23", OrderId = "2", Price = 100, RateId = 1, Quantity = 5, ServiceId = "32"
          },
          new Order_Details() {
            Id = "24", OrderId = "2", Price = 100, RateId = 1, Quantity = 3, ServiceId = "32"
          },
          new Order_Details() {
            Id = "25", OrderId = "3", Price = 100, RateId = 1, Quantity = 11, ServiceId = "32"
          },
          new Order_Details() {
            Id = "26", OrderId = "3", Price = 100, RateId = 1, Quantity = 4, ServiceId = "32"
          },
          new Order_Details() {
            Id = "27", OrderId = "3", Price = 100, RateId = 1, Quantity = 10, ServiceId = "32"
          },
      };
        }
        public static List<Achievement> GetListOfAchievements()
        {
            return new() {
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "برامج تدريب لتحسين اللياقة - التخسيس - الضخامة العضلية",
            FromDate = new DateTime(1997, 7, 5),
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "التغذية الرياضية لجميع الرياضيين",
            FromDate = new DateTime(1998, 3, 19)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "دورة السمنة و علاجها و الطرق الصحيحة لانقاص الوزن",
            FromDate = new DateTime(2000, 11, 6)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = " اللياقة البدنية للأطفال",
            FromDate = new DateTime(2001, 8, 16)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "أساسيات التغذية السليمة",
            FromDate = new DateTime(200, 6, 8)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "رحلة إنقاص الوزن",
            FromDate = new DateTime(2003, 1, 8),
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "دبلومة التغذية العلاجية",
            FromDate = new DateTime(2004, 11, 6)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "النظام الغذائي المتقدم وتخطيط الوجبات",
            FromDate = new DateTime(2005, 5, 13)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "التغذية من الالتهاب - النظام الغذائي المضاد للالتهابات",
            FromDate = new DateTime(2006, 7, 13)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "تدريب مدرب الصحة",
            FromDate = new DateTime(2007, 1, 230)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "ممارسة اليوجا قبل الولادة",
            FromDate = new DateTime(2009, 7, 15)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "تصميم الأنظمة الغذائية والوجبات الصحية",
            FromDate = new DateTime(2011, 1, 15)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "دبلوم معتمد دوليا في تخطيط النظام الغذائي",
            FromDate = new DateTime(2013, 4, 16)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "شهادة دبلوم معتمد دوليا في اللياقة البدنية",
            FromDate = new DateTime(2017, 9, 18)
        },
        new Achievement {
          Id = Guid.NewGuid().ToString(),
            Title = "diploma in fitness",
            FromDate = new DateTime(2019, 5, 27)
        },
      };
        }
        public static List<Service> GetListOfOServies()
        {
            return new List<Service>() {
        new Service {
          Id = "100",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا.", Price = 350,
            Title = "4" +
            "أسابيع من المرح وتدريب مكثف للجزء السفلي من الجسم وبناء القوة في العضلات و أوتار الركبة",
            CategoryId = "1",

        },
        new Service {
          Id = "101",
            Title = "تحدي للياقة البدنية لمدة 5 أيام مجانًا",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا.", Price = 100,
            CategoryId = "5",

        },
        new Service {
          Id = "102",
            Title = "3 تمارين في الأسبوع لمدة أسبوعين",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا.", Price = 200,
            CategoryId = "5",

        },

        new Service {
          Id = "103",
            Price = 450,
            CategoryId = "5",
            RatePercentage = 30,
            Title =
            "برنامج لمدة 8 أسابيع لبدء روتين لياقتك البدنية" +
            "تدريبات صديقة للمبتدئين لبناء القوة والثقة والاتساق",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا."

        },
        new Service {
          Id = "1",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا.",
            Price = 19.99,
            CategoryId = "1", RatePercentage = 20,
            Title =
            "أسبوع من المرح وتدريب مكثف للجزء السفلي من الجسم وبناء القوة في العضلات و أوتار الركبة",
        },
        new Service {
          Id = "2",
            Price = 20.99,
            RatePercentage = 20,
            Title =
            "أسبوع من المرح وتدريب مكثف للجزء السفلي من الجسم وبناء القوة في العضلات و أوتار الركبة",
            CategoryId = "1", Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا."

        },
        new Service {
          Id = "3",
            Price = 19.99,
            RatePercentage = 20,
            Title = "أسبوع من المرح وتدريب مكثف للجزء السفلي من الجسم وبناء القوة في العضلات و أوتار الركبة",
            CategoryId = "1",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا."

        },
        new Service {
          Id = "4",
            Price = 19.99,
            CategoryId = "1", RatePercentage = 20,
            Title =
            "أسبوع من المرح وتدريب مكثف للجزء السفلي من الجسم وبناء القوة في العضلات و أوتار الركبة",
            Description = "أضف تحدي الـ 5 أيام هذا إلى تقويم التمرين حيث يمكنك إعادة الجدولة" +
            " ووضع علامة مكتمل ، تمامًا مثل" +
            " أحد برامجنا. إذا كنت تستمتع بهذا التحدي ، تحقق من FB Strong الجديد" +
            "لمدة 4 أسابيع والذي تم إطلاقه" +
            "للتو. يستخدم نفس موضوع التحدي (قوي) ويستخدم تمرينًا إضافيًا فريدًا" +
            "كل يوم (بدون تكرار" +
            "التدريبات!)." +
            "نحن على وشك الوصول إلى مرحلة ممتعة ؛ هذا الأسبوع ، سيصل Fitness" +
            "Blender رسميًا إلى إجمالي 1000" +
            "مقطع فيديو تمرين ! وهذا الرقم لا يزال يرتفع بسرعة. إذا كنت تستمتع" +
            "بمقاطع الفيديو الخاصة بالتمرين" +
            " وتحدي الـ 5 أيام هذا ، فيرجى التفكير في مساعدتنا على الاستمرار في" +
            " القيام بما نقوم به من خلال" +
            "مشاركة عملنا مع الأصدقاء والعائلة. نحن لا نقوم بالإعلان على الإطلاق" +
            "، من أجل المساعدة في الحفاظ" +
            "على أسعارنا منخفضة ، لذا فإن الحديث الشفهي مهم بالنسبة لنا. بغض" +
            " النظر عن طريقة استخدامك لعملنا ،" +
            "فنحن ممتنون للأشخاص حول العالم الذين يستخدمون Fitness Blender" +
            "ويسعدنا حقًا وجودك هنا."

        },
        new Service {
          Id = "5",
            Description = "يعتمد على تناول البقوليات و المكسرات و الأوراق الخضراء ,مفيد لمرضى السكر و القلب ",
            Price = 19.99,
            Title = " اختبار ",
            CategoryId = "1",
        },
        new Service {
          Id = "11",
            Description = "يعتمد على تناول البقوليات و المكسرات و الأوراق الخضراء ,مفيد لمرضى السكر و القلب ",
            Price = 19.99,
            Title = " اختبار ",
            CategoryId = "1",
        },
        new Service() {
            Id = "21",
              Title = "طقم اوزان دمبل 30 كغم",
              Price = 20,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "22",
              Title = "حلقات لايف اب الاولمبية للجمباز",
              Price = 30,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "23",
              Title = "مشاية كهربائية منحنية بدون محرك",
              Price = 1490,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "24", Title = "دراجة سبينر", Price = 320, CategoryId = "4", Description = ""
          },
          new Service() {
            Id = "25",
              Title = "Livepro أيروبيك ستيبر ومقعد",
              Price = 150,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "26",
              Title = "سجادة Liveup للتمارين الرياضية",
              Price = 15,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "27",
              Title = "مقعد بووفليكس متعدد الوظائف",
              Price = 175,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "28",
              Title = "حبل معركة بروبانتل",
              Price = 69,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "29",
              Title = "مقعد قابل للطي قابل للتعديل للتمارين الرياضية",
              Price = 125,
              CategoryId = "4",
              Description = ""
          },
          new Service() {
            Id = "30", Title = "مجدّف", Price = 25, CategoryId = "4", Description = ""
          },
          new Service() {
            Id = "31",
              Title = "زيت السمك أوميغا 3",
              Price = 111,
              CategoryId = "3",
              Description = ""
          },
          new Service() {
            Id = "32",
              Title = "Muscletech, بلاتينيوم ملتي فيتامين",
              Price = 78,
              CategoryId = "3",
              Description = ""
          },
          new Service() {
            Id = "33",
              Title = "Ultima Replenisher",
              Price = 169,
              CategoryId = "3",
              Description = ""
          },
          new Service() {
            Id = "34", Title = "زيت الكريل", Price = 169, CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "35", Title = "أنافيت", Price = 170, CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "36",
              Title = "Trace Minerals Research",
              Price = 79,
              CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "37",
              Title = "BodyBio, E-Lyte",
              Price = 109,
              CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "38", Title = "فيجا ، سبورت", Price = 163, CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "39",
              Title = "مضاعف الترطيب",
              Price = 111,
              CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "40", Title = "NutriBiotic", Price = 54, CategoryId = "3", Description = ""
          },
          new Service() {
            Id = "41", Title = "زيت الكريل", Price = 169, CategoryId = "3", Description = ""
          }
        // new Service()
        //{
        //     Id = "42",
        //     LinkName = "ماذا تأكل أثناء تدريب القوة؟",
        //     Price = 11,
        //     CategoryId = "3",
        //     ShortDescription="وصفات للتزود بالوقود والتعافي بعد تمارين القوة",
        //     Description="تم تصميم خطة الوجبات هذه من قبل اختصاصي تغذية مسجل، وتحديداً لدعم التغذية بعد التمرين واستعادة برنامج تدريب القوة. هذا زوج رائع مع 4 أسابيع FB Strong: Round 3. إذا كنت ترغب في معرفة المزيد حول كيفية التعافي جيدًا من برنامج تمرين مكثف، فأنت في المكان المناسب!\r\n\r\nإلى جانب خطة للوجبات والوجبات الخفيفة، نشارك كل يوم الأشياء الأساسية لمعرفة ما بعد التمرين والتطبيقات العملية لما يمكن أن يبدو عليه هذا. سنشرح أيضًا محتوى خطة الوجبة هذه وكيف يمكنك استخدامها لبناء العضلات وتزويد جسمك بالوقود للتدريب وبناء القوة.\r\n\r\nخطة وجباتنا 1-Week لتدريب القوة سهلة الاستخدام وغنية بالمغذيات ولذيذة. تم تطويره خصيصًا من قبل أخصائيي التغذية المسجلين ومطوري الوصفات ومراجعته من قبل أخصائيي الصحة العقلية على مستوى الدكتوراه."
        //},
      };
        }

        public static List<Product> GetListOfProducts()
        {
            return new List<Product>() {
        new Product() {
            Id = "21", ImgUrl = "/Images/Product/Dumbbell3.jfif", Discount = 20,
          },
          new Product() {
            Id = "22", ImgUrl = "/Images/Product/LiveupOlympic.jpg",
          },
          new Product() {
            Id = "23", ImgUrl = "/Images/Product/Curved.jpg",
          },
          new Product() {
            Id = "24", ImgUrl = "/Images/Product/Spinner.jpg"
          },
          new Product() {
            Id = "25", ImgUrl = "/Images/Product/Liveup.jpg",
          },
          new Product() {
            Id = "26", ImgUrl = "/Images/Product/LiveupOlympic.jpg",
          },
          new Product() {
            Id = "27", ImgUrl = "/Images/Product/Bowflex.jpg",
          },
          new Product() {
            Id = "28", ImgUrl = "/Images/Product/Brobantle.jfif",
          },
          new Product() {
            Id = "29", ImgUrl = "/Images/Product/Adjustable.jpg",
          },
          new Product() {
            Id = "30", ImgUrl = "/Images/Product/rower.jpg",
          },
          new Product() {
            Id = "31", ImgUrl = "/Images/Product/omega.jpg",
          },
          new Product() {
            Id = "32", ImgUrl = "/Images/Product/Muscletech.jpg",
          },
          new Product() {
            Id = "33", ImgUrl = "/Images/Product/Ultima.jpg",
          },
          new Product() {
            Id = "34", ImgUrl = "/Images/Product/krilloil.jpg",
          },
          new Product() {
            Id = "35", ImgUrl = "/Images/Product/anavite.jpg",
          },
          new Product() {
            Id = "36", ImgUrl = "/Images/Product/Trace.jpg",
          },
          new Product() {
            Id = "37", ImgUrl = "/Images/Product/BodyBio.jpg",
          },
          new Product() {
            Id = "38", ImgUrl = "/Images/Product/Vega.jpg",
          },
          new Product() {
            Id = "39", ImgUrl = "/Images/Product/HydrationMultiplier.jpg",
          },
          new Product() {
            Id = "40", ImgUrl = "/Images/Product/NutriBiotic.jpg",
          },
          new Product() {
            Id = "41", ImgUrl = "/Images/Product/krilloil.jpg"
          }
      };
        }
        public static List<Exercise> GetListOfExercise2()
        {
            return new List<Exercise>() {
        new Exercise() {
            Id = "1", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "اليوجا الصباحية للجسم بالكامل", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "هذا التدفق هو واحد من المفضلة. عندما أستيقظ في الصباح ، أحب أن أبدأ يومي بتمديدات روتينية من شأنها أن تجعل دمي يتدفق ، وطاقي ، وتضبط نغمة اليوم. هذه الممارسة ستجعلك تتعرق وتساعد " + "جسمك على تخفيف الضغط في نفس الوقت. تخلق أنماط الحركة ذاكرة حسية يمكننا البناء عليها. بدءًا من نمط التنفس ، تهدف كل حركة إلى مطابقة كل شهيق أو زفير لتشجيع التنفس العميق الذي يعزز الشعور بالتوتر ، ويزيد من مستوى الطاقة والاسترخاء ، ويثبت ضغط الدم. إذا ركزت على أنفاسك ، فسوف يهدأ عقلك. فيما يلي بعض إشارات المحاذاة التي يجب وضعها في الاعتبار للسلامة في Low Lunge:\r\n\r\nابدأ في اندفاع العداء ، والساق اليمنى للأمام مع الركبة فوق الكاحل والركبة اليسرى على الأرض مع وضع الجزء العلوي من قدمك على السجادة" +
              ". ارفع الجذع ببطء وضع يديك برفق على الفخذ الأيمن. تميل الوركين إلى الأمام قليلاً ،" +
              " مع إبقاء الركبة اليمنى خلف أصابع القدم ، والشعور بالتمدد في ثني الورك الأيسر." +
              "" +
              " امسك هنا ، أو لتمتد أعمق ، ارفع الذراعين فوق الرأس ، والعضلة ذات الرأسين من الأذنين. " +
              "استمر لمدة 30 ثانية على الأقل ، ثم كرر على الجانب الآخر. تتضمن عضلات الجسم المنخفضة المستهدفة في هذا" +
              " التسلسل أوتار الركبة ، وثني الورك ، والرباعية ، والألوية. في كل مرة نتنقل فيها عبر نمط الحركة" +
              " ، سيكون هناك موقف أو وضعان مضافان إلى التسلسل. التكرار مع كل الجسم للانفتاح على كل شكل تدريجيًا.",
              Difficulty = 3, Duration = 27, Image = "Images/Exercise/31.jpg", Video = "https://www.youtube.com/watch?v=w5y3Zl1F5Vs", Equipments = "حصيرة ، معدات اليوجا"
          },

          new Exercise() {
            Id = "2", TraningType = "القلب والأوعية الدموية ، تأثير منخفض ، تدريب القوة ، التنغيم ، اليوجا ، الحركة", BurnEstimate = "50-250", Title = "تمارين تقوية الجسم بالكامل وتمارين القلب", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "إذا كنت تريد ممارسة تمرينات رياضية فعالة في أقل من 25 دقيقة ، فلا داعي لمزيد من البحث. هذا مزيج قصير ولطيف بين نمطي تدريب مهمين: تدريب القوة وتمارين القلب والأوعية الدموية. يتم تقديم تعديلات عالية ومنخفضة التأثير حتى تتمكن من مقابلة جسمك تمامًا في مكانه.                        عندما يتعلق الأمر بالحصول على أقصى درجات \"الضجة\" لوقتك ، يمكن أن تكون قوة الاقتران وتمارين القلب فعالة للغاية. يسمح لنا تدريب القوة ببناء العضلات الخالية من الدهون بينما تحافظ تمارين القلب والأوعية الدموية على ارتفاع معدل ضربات القلب. يعملان معًا على تعزيز عملية التمثيل الغذائي وإطلاق الطاقة لتغذية يومك!\r\n\r\nكنت مؤخرًا أحضر فصلًا لركوب الدراجات حيث قال المدرب ، \"ما هي أفضل طريقة للاحتفال بجسدك من الشعور بإطلاق الطاقة والقوة التي يحملها جسمك؟\" لا يمكن اقبل المزيد. هذا التمرين هو النوع الذي يبدو وكأنه احتفال بما يمكن أن يفعله جسمك. دون أن تكون شديدة أو معتدلة للغاية ، فإنها تهبط في المنتصف تمامًا \"للاحتفال\" التمكيني والحيوي ، إذا رغبت في ذلك.",
              Difficulty = 3, Duration = 23, Image = "Images/Exercise/32.jpg", Video = "https://www.youtube.com/watch?v=R58oVgVgRlc", Equipments = "حصيرة ، دمبل"
          },
          new Exercise() {
            Id = "3", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "مجموعات القوة المركبة للجزء العلوي من الجسم", Price = 0, BodyFocus = "الجزء العلوي من الجسم", Detail = "أولاً ، سنركز على الصدر ، بدءًا من مكابس الأرضية ثم الانتقال بسرعة إلى ذبابة الصدر والانتهاء بضغطة سحق. بعد مجموعتين من تمارين الصدر ، سننتقل إلى الخلف ، بدءًا من الصفوف المنحنية ، والانتقال إلى الذباب العكسي ، والانتهاء من صف yates. مجموعتنا التالية سوف تستهدف الذراعين ، في المقام الأول العضلة ثلاثية الرؤوس والعضلة ذات الرأسين. بالنسبة لمجموعات الترايسبس لدينا ، نحتاج فقط إلى دمبل واحد. سنبدأ المجموعات بضغطة دمبل مفردة بقبضة قريبة ، وننتقل إلى كسارة جمجمة دمبل واحدة ، ثم ننتقل إلى تمديدات ثلاثية الرؤوس العلوية. (سوف تحترق عضلاتك ثلاثية الرؤوس ، لول). مجموعتنا التالية هي إحدى الطرق المفضلة لتدريب العضلة ذات الرأسين. سنستخدم المقاييس المتساوية لدفع العضلة ذات الرأسين هنا. تمريننا الأول هو ما أحب أن أسميه تجعيد الشعر أحادي الذراع ؛ سنقوم بعمل كل ذراع على حدة مع تلك قبل الانتهاء من تمارين العضلة ذات الرأسين القياسية. هذا المزيج يعمل دائمًا مع العضلة ذات الرأسين! في مجموعتنا النهائية ، سنركز على أكتافنا. سنبدأ العمل بضغط الكتف القياسي ، والانتقال إلى صفوفنا المستقيمة ، وإنهاء المجموعة مع صف دلتا الخلفي الذي يستهدف عضلات الدالية الصغيرة - مما يجعل هذه الطريقة المثالية لإنهاء تمرين الجزء العلوي من الجسم.",
              Difficulty = 4, Duration = 37, Image = "Images/Exercise/34.jpg", Video = "https://www.youtube.com/watch?v=fPlN4amOMY8", Equipments = "دمبل"
          },
          new Exercise() {
            Id = "4", TraningType = "القلب والأوعية الدموية ، تأثير منخفض ، تدريب القوة ، التنغيم ، اليوجا ، الحركة", BurnEstimate = "50-250", Title = "مجموعة القلب والقوة", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "أولاً ، سنركز على الصدر ، بدءًا من مكابس الأرضية ثم الانتقال بسرعة إلى ذبابة الصدر والانتهاء بضغطة سحق. بعد مجموعتين من تمارين الصدر ، سننتقل إلى الخلف ، بدءًا من الصفوف المنحنية ، والانتقال إلى الذباب العكسي ، والانتهاء من صف yates. مجموعتنا التالية سوف تستهدف الذراعين ، في المقام الأول العضلة ثلاثية الرؤوس والعضلة ذات الرأسين. بالنسبة لمجموعات الترايسبس لدينا ، نحتاج فقط إلى دمبل واحد. سنبدأ المجموعات بضغطة دمبل مفردة بقبضة قريبة ، وننتقل إلى كسارة جمجمة دمبل واحدة ، ثم ننتقل إلى تمديدات ثلاثية الرؤوس العلوية. (سوف تحترق عضلاتك ثلاثية الرؤوس ، لول). مجموعتنا التالية هي إحدى الطرق المفضلة لتدريب العضلة ذات الرأسين. سنستخدم المقاييس المتساوية لدفع العضلة ذات الرأسين هنا. تمريننا الأول هو ما أحب أن أسميه تجعيد الشعر أحادي الذراع ؛ سنقوم بعمل كل ذراع على حدة مع تلك قبل الانتهاء من تمارين العضلة ذات الرأسين القياسية. هذا المزيج يعمل دائمًا مع العضلة ذات الرأسين! في مجموعتنا النهائية ، سنركز على أكتافنا. سنبدأ العمل بضغط الكتف القياسي ، والانتقال إلى صفوفنا المستقيمة ، وإنهاء المجموعة مع صف دلتا الخلفي الذي يستهدف عضلات الدالية الصغيرة - مما يجعل هذه الطريقة المثالية لإنهاء تمرين الجزء العلوي من الجسم. ",
              Difficulty = 4, Duration = 23, Image = "Images/Exercise/35.jpg", Video = "https://www.youtube.com/watch?v=d8QcqQA0zIQ", Equipments = "حصيرة ، دمبل"
          },
          new Exercise() {
            Id = "5", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "دوائر القوة الأساسية السريعة و الجوهر", Price = 0, BodyFocus = "جوهر", Detail = "يعد هذا التمرين القصير الذي يركز على النواة إضافة رائعة لروتين الجسم السفلي أو العلوي أو الكلي - ولكنه أيضًا خيار رائع كتمرين مستقل لحركتك الأساسية في اليوم. استخدم الإحماء أحادي الدورة لتهيئة عضلاتك الأساسية جسديًا للدوائر الصعبة ولكن القابلة للتكيف التي تليها ، ولكن ركز أيضًا على التدفق ببطء خلال كل تمرين لتنشيط اتصال العقل والعضلات لتوظيف العضلات بكفاءة.\r\n\r\n\r\n\r\n\r\nتحتوي كل دائرة على تمارين تجمع بين الإمساك المتساوي القياس وأنماط الحركة الديناميكية ولكن المتحكم فيها والتركيز على الاستقرار الأساسي. هذه التمارين لن تقوي فقط عضلات البطن (التي تشمل عضلات البطن ، الألوية ، عضلات الفخذ ، وعضلات الظهر السفلية) مع حركات الانثناء / الطحن التقليدية ، بل ستعمل أيضًا على تحسين مشاركة عضلات الجسم الكلية وتكامل الحركة (التدفق).\r\n\r\nلاحظ أنه لا يوجد سوى عدد قليل من التمارين المتعلقة بلوح في هذا التمرين ؛ لذلك ، إذا كانت لديك مخاوف من ألم الرسغ أثناء تمارين اللوح / وضعية الانبطاح ، فقد يكون هذا الروتين خيارًا رائعًا للاحتفاظ به في مجموعتك من أجل إجراءات الانتقال الأساسية المستقبلية. من الاعتبارات المهمة للجميع الحفاظ على ثنية طفيفة في الحوض أثناء تمارين وضعية الاستلقاء (الوجه لأعلى) والمنبطحة (الوجه لأسفل / اللوح الخشبي). على سبيل المثال ، أثناء الجزء الميت من تسلسل التنشيط بالإضافة إلى تمرين لوح الساعد في الدائرة رقم 1 ، تخيل أنك تقوم بإدخال عظام الفخذ إلى ضلوعك - قم بإمالة الجزء العلوي من عظام الحوض قليلاً إلى الأعلى والعودة باتجاه الجزء السفلي من القفص الصدري الخاص بك.\r\n\r\nفيما يلي بعض النصائح الإضافية لجعل هذا الروتين تجربة مُرضية لك:\r\n\r\nتشمل التعديلات لجميع التمارين تقليل نطاق الحركة و / أو ثني ركبتيك (تقصير الرافعة) لأي حركات تتضمن اختلافات في تمديد الساق.\r\nلاحظ التمارين الأكثر صعوبة بالنسبة لك وحدد الاختلافات في نطاقات الحركة والقوة وعدد التكرارات للتمارين ذات التركيز الأحادي (مثل v-ups المائلة). سيساعدك الانتباه إلى أكثر الاختلافات دقة في توجيه تركيزك أثناء المحاولات المستقبلية في هذا التمرين.\r\nلا تتردد في تكرار دائرة التبريد القصيرة لتمديد ممتد أو إضافة الامتدادات الخاصة بك لمساعدتك على العودة إلى حالة الاسترخاء والحيوية. يجب أن تشعر كما لو أن عضلاتك \"تعمل\" خلال هذا الروتين ولكن لا تزال تنتهي بعقلية \"جاهزة للتعامل مع أي شيء قادم\".\r\nيتمتع!",
              Difficulty = 3, Duration = 19, Image = "Images/Exercise/36.jpg", Video = "https://www.youtube.com/watch?v=B5ZZqBslKU0", Equipments = "حصيرة"
          },
          new Exercise() {
            Id = "6", TraningType = "القلب والأوعية الدموية ، تأثير منخفض ، تدريب القوة ، التنغيم ، اليوجا ، الحركة", BurnEstimate = "50-250", Title = "دارات تقوية الجسم الكلي مع عمل التوازن", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "\r\nتساعد التدريبات أحادية الجانب على تعزيز المشاركة الأساسية ، وبالتالي تحسين الأساس الذي تبدأ منه كل الحركات.\r\nتعمل عضلاتك معًا بشكل تآزري لتقوية السلسلة الحركية بأكملها ، مما يقلل من فرص السقوط أو العثرات الضارة المحتملة أثناء الأنشطة المعتادة للحياة اليومية.\r\nيمكن أن يساعدك العمل المتوازن في تحديد مناطق الضعف والكتل المحتملة نحو تحسين الأداء الرياضي وكذلك تحسين التنسيق لأنماط الحركة المتقدمة والتمارين التي تحركها القوة.\r\nالتدريبات مع تحديات التوازن تعمل على تحسين الاتصال بين العقل والجسم. يؤدي هذا الاتصال المعزز إلى زيادة القدرة على التحمل الذهني والفعالية الذاتية اللازمة لإكمال التدريبات الصعبة.\r\nتوفر مثل هذه التدريبات استراحة من البلى من التدريب على التأثير وتتحدى الدماغ لطرق بديلة لمعالجة وعي العقل والجسم من أجل نهج شامل للياقة البدنية.\r\nكل حركة في هذا التمرين لها درجات متفاوتة من التوازن في العمل. أثناء دورات القوة ، ستكمل كل تمرين لمدة 45 ثانية ، وهي فترة زمنية كافية لتتعرف تمامًا على كل حركة. تؤدي إضافة درجة صغيرة من التوازن أثناء هذه الحركات التي تركز على القوة إلى زيادة وقت العضلات تحت التوتر للمساعدة في بناء القوة. بمجرد الانتقال إلى موازنة قطاعات العمل ، استفد من تنشيط العضلات الذي حدث أثناء دوائر القوة لتحقيق أقصى استفادة من الفواصل الزمنية التي تبلغ دقيقة واحدة والتركيز على الاستقرار.\r\n\r\nسأعترف ، لقد استمتعت تمامًا بالحركة بسرعة أبطأ من التدريبات المعتادة مع هذه الجلسة التي تركز على التوازن. لبضعة أيام بعد ذلك ، لاحظت أن العديد من العضلات شعرت بـ \"الاستيقاظ\" مع نوع صحي جيد من القرحة التي سمحت لي بمعرفة أنني كنت أهمل مجموعات عضلية معينة وطرق التدريب. خذ وقتك مع كل حركة واستمع إلى الملاحظات التي يقدمها لك جسمك. استمتع!",
              Difficulty = 3, Duration = 45, Image = "Images/Exercise/37.jpg", Video = "https://www.youtube.com/watch?v=UzAFN61CiVQ", Equipments = "حصيرة"
          },
          new Exercise() {
            Id = "7", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "مجموعة سريعة من تمارين القلب والقوة و الجوهر  لكامل الجسم", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "في منتصف عام 2022 ، قمت بتصوير تمرين بدا أن عددًا كبيرًا منكم يحبه حقًا. كان قسم التعليقات مليئًا بطلبات لتصوير المزيد مثله ، وعلى الرغم من أنني كنت أمتلك مجموعة من التدريبات الأخرى المطلوبة للحصول عليها أولاً ، إلا أنني لم أنس هذا التمرين (بفضل Kelli لتذكيري) وقمت ببناء علامة تجارية جديدة نسخة منه مع جميع التدريبات الجديدة. بالنسبة لأولئك منكم الذين لم يجربوا النسخة الأصلية ، يمكنك إلقاء نظرة هنا أو - بل أفضل - جرب كلاهما وأخبرني ما إذا كان هذا الإصدار الجديد يتوافق مع نفس المعيار.\r\n\r\n\r\n\r\n\r\nسواء كنت قد جربت الإصدار الأصلي أم لا ، لا يهم ، حيث إن كلاهما تمرين مستقل مصمم لروتين كامل للجسم متوازن. يحتوي هذا التمرين الذي يستغرق 26 دقيقة على كل شيء: الإحماء ، والتهدئة ، وفترات HIIT للقلب ، ومجموعات القوة ، والتمارين الأساسية ، كل ذلك في فاصل زمني سريع بأسلوب Tabata للحفاظ على هذا التمرين سريعًا.\r\n\r\nتم بناء كل مجموعة من المجموعات الأربع في هذا الروتين بنفس الطريقة تمامًا ولكن مع تمارين فريدة في كل مرة. تتكون المجموعات من تمرين HIIT من أجل انفجار القلب ، يليه تمرين قوة متعدد السلاسل لزيادة إجهاد العضلات ومكاسب القوة ، ثم ننهيها بتمرين أساسي للمتعة فقط. على الرغم من أن هذا التمرين قصير ، إلا أنه يحزم لك بالتأكيد ، خاصة إذا كنت تتحدى نفسك في مجموعات القوة.\r\n\r\nأيضًا ، إذا كنت تريد تحديًا إضافيًا لكامل الجسم ، فحاول القيام بكل من هذين التمرينين معًا أو كل منهما مرتين خلال تمرين كامل للجسم لمدة ساعة تقريبًا.",
              Difficulty = 4, Duration = 26, Image = "Images/Exercise/38.jpg", Video = "https://www.youtube.com/watch?v=3xR8ZKVALwo", Equipments = "حصيرة ، دمبل  ، بدون معدات "
          },
          new Exercise() {
            Id = "8", TraningType = "تدريب متقطع عالي الكثافة ، تأثير منخفض ، بيلاتيس ، تدريب القوة ، التمدد / المرونة ، القدرة على الحركة", BurnEstimate = "50-250", Title = "تمرين الجسم الكلي السريع - 10 أو 15 دقيقة تختارها", Price = 0, BodyFocus = "الجسم بالكامل ", Detail = "في تمرين اليوم نركز على السرعة. تم تصميم هذا التمرين القصير ولكن الفعال ليوفر لك تمرينًا جيدًا في أقصر وقت ممكن لتلك الأيام التي ربما لم تكن قد مارستها فيها على الإطلاق. لقد صممت هذا التمرين بعد نوبة أخيرة من العمل المكثف ومتطلبات الحياة التي ضربت في نفس الوقت ، مما يجعل التمرين لمدة 20 دقيقة يبدو كثيرًا.\r\n\r\nلقد صممت هذا الروتين عن قصد لاستخدامه بسهولة في تخصيصين مختلفين للوقت: إصدار سريع يأخذك خلال مقطع فيديو التمرين الكامل هذا ويبلغ أقصى حد له 15 دقيقة ، وإصدار فائق السرعة يأخذك خلال جزء \"التمرين\" لـ نصف الوقت مع قطع الطول الإجمالي إلى حوالي 10 دقائق.\r\n\r\nيتم إجراء كل هذا الروتين بنفس بنية الفاصل الزمني 20 تشغيل و 10 إيقاف لإبقائه سريعًا وبسيطًا. لقد قمت بتضمين إحماء سريع مدته 3 دقائق يتم تشغيله مباشرة في التمرين لتقليل أي توقف مؤقت غير ضروري ؛ تذكر أن هذا كله يتعلق بالكفاءة حتى نتمكن من الحصول على أفضل تدريب ممكن في أقصر وقت ممكن. لذلك ، بعد تمارين الإحماء الستة ، ننتقل مباشرة إلى التمارين الثمانية لقسم التمرين. هذا هو المكان الذي يمكنك فيه الاختيار من خلال هذه التدريبات الثمانية مرة واحدة أو مرتين. أعطي دعوة واضحة عندما ننتهي من أول تشغيل لهذه التمارين حتى تتمكن من اتخاذ قرار التخطي إلى فترة التهدئة السريعة التي تبلغ 3 دقائق والقيام بها في حوالي 10 دقائق أو إجراء التمارين مرة ثانية (كما أفعل في الفيديو) ويتم الانتهاء منه في حوالي 15 دقيقة. بهذه الطريقة يمكنك تحديد مقدار الوقت الذي يمكنك تخصيصه لهذا التمرين.\r\n\r\nهذا تمرين شامل للجسم ، لذا إذا كنت تستخدمه بعد يوم مكثف من الجزء العلوي أو السفلي من الجسم ، ففي كلتا الحالتين من المرجح أنك تستخدم بعض مجموعات العضلات نفسها. لا تقلق ، على الرغم من ذلك - ستفعل ذلك بوزن الجسم فقط حتى تتمكن من التكيف لجعل التمارين أسهل أو أصعب ، وستقوم فقط ببضع عمليات التكرار لكل منها ، لذلك لا داعي للقلق بشأن إرهاق العضلات المؤلمة.\r\n\r\nمع ذلك ، يمكن أيضًا استخدام هذا كتمرين إضافي إذا كنت تريد القيام بتمرين ثانٍ في يوم واحد. يمكن القيام بذلك إما مباشرة بعد التمرين الأول أو في وقت لاحق من اليوم للحصول على نوبة إضافية من حرق السعرات الحرارية.",
              Difficulty = 3, Duration = 15, Image = "Images/Exercise/39.jpg", Video = "https://www.youtube.com/watch?v=xafq0q5lIq4", Equipments = " بدون معدات "
          },
          new Exercise() {
            Id = "9", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "تقوية اعضاء الجسم السفلية - تمرين الفخذ لمدة 43 دقيقة", Price = 0, BodyFocus = "الجسم السفلي", Detail = "يمكن استخدام تمرين الجزء السفلي من الجسم هذا للتناغم أو القوة أو بناء الكتلة ، بحيث يمكنك استخدامه لما تحتاجه بالضبط. في هذا الروتين ، قمنا بتقسيم التمرين إلى ثلاث مجموعات (لا تشمل الإحماء والتهدئة). سيتم إجراء أول مجموعتين بأسلوب فاصل من 45 ثانية من النشاط مع 15 ثانية من الراحة للاستعداد للتمرين التالي. تحتوي كل مجموعة من هاتين المجموعتين الأوليين على 4 تمارين لكل منهما ، وسيتم إجراؤها بنمط A ، B A ، B بالتناوب ، بالتناوب ذهابًا وإيابًا بين اثنين من التمارين الأربعة في وقت واحد. سيتم إجراء كل تمرين لما مجموعه ثلاث مجموعات قبل الانتقال إلى التدريبات التالية ، مما يمنحنا إجمالي 12 فترة لكل مجموعة لأول مجموعتين. ستتم المجموعة الأخيرة قبل فترة التهدئة والتمدد بشكل مختلف. على الرغم من وجود أربعة تمارين مرة أخرى في هذه المجموعة ، فإننا سنقوم بدلاً من ذلك بإجراء كل تمرين لمجموعة واحدة فقط باستخدام فترات 60 ثانية على و 15 ثانية راحة. هذا المزيج من مجموعتين باستخدام ثلاث مجموعات تقليدية أكثر لكل تمرين متبوعًا بمجموعة تستخدم مجموعة نضوب واحدة سيسمح لنا بإرهاق العضلات بشكل فعال إلى الحد الذي يمكننا فيه الحصول على التمزقات الدقيقة في عضلاتنا التي تؤدي إلى زيادة القوة والكتلة.\r\nمع ما يقال ، تذكر أنه يمكنك التحكم بالضبط في النتائج التي تحصل عليها من هذا الروتين عن طريق ضبط الوزن الذي تختار رفعه ومدى سرعة القيام بكل تكرار. للحصول على تمرين أكثر تركيزًا على التنغيم ، استخدم وزن الجسم فقط أو الوزن الخفيف جدًا وتحرك بسرعة أكبر (طالما أنك لا تزال تتحرك مع التحكم ولا تستخدم الزخم للمساعدة في إكمال الحركة التي يتم إجراؤها). إذا كنت تريد التركيز أكثر على بناء الحجم الكلي للعضلات ، فحافظ على بطء حركاتك واختر أثقل وزن يمكنك التحكم فيه من خلال نطاق كامل من الحركة. مع بناء الكتلة ، يجب أن يكون هدفك هو الحصول على 90-100 ٪ من كل مجموعة من أول مجموعتين (من أي تمرين معين) قبل أن تبدأ عضلاتك في الاستسلام ويبدأ شكلك في المعاناة. يجب أن يكون الهدف من المجموعة الثالثة (الأخيرة) من كل تمرين هو إكمال 80-90٪ من الفاصل الزمني قبل أن تستسلم عضلاتك.",
              Difficulty = 4, Duration = 43, Image = "Images/Exercise/40.jpg", Video = "https://www.youtube.com/watch?v=ABDmiZD1TDU", Equipments = "دمبل"
          },
          new Exercise() {
            Id = "10", TraningType = "تدريب متقطع عالي الكثافة ، تأثير منخفض ، بيلاتيس ، تدريب القوة ، التمدد / المرونة ، القدرة على الحركة", BurnEstimate = "50-250", Title = "روتين القوة الأساسية الموزونة - روتين أوزان الدمبل في المنزل", Price = 0, BodyFocus = "جوهر", Detail = "\r\nإذا كنت تمارس هذا التمرين بهدف بناء القوة و / أو الكتلة ، فإليك بعض الأشياء التي يجب وضعها في الاعتبار.\r\n\r\nأولاً ، كما هو الحال مع أي تمرين قوي أو جماعي ، لا ترفع كثيرًا حتى يبدأ شكلك أو نطاق حركتك في المعاناة. إذا كنت قد قمت في أي وقت مضى بواحد من إجراءات قوتنا من أي نوع من قبل ، فمن المحتمل أنك سمعتنا بالفعل نقول هذا مرارًا وتكرارًا ؛ شكل ونطاق الحركة أكثر أهمية بكثير من مقدار الوزن الذي ترفعه عندما يتعلق الأمر بالقوة الوظيفية الخالية من الإصابات.\r\n\r\nثانيًا ، حدد الوزن الذي تستخدمه بناءً على معدل التعب لديك. يجب أن يكون هدفك هو استخدام وزن ثقيل بدرجة كافية بحيث يمكنك إجراء جميع عمليات التكرار تقريبًا بشكل مثالي ونطاق كامل من الحركة. يجب السماح للمعاناة في آخر 2 أو 3 مرات فقط لأن هذه العضلات تصبح مرهقة للغاية بحيث لا يمكن الحفاظ عليها نظيفة.\r\n\r\nثالثًا ، عندما تتخلى عضلاتك عن تلك التكرارات القليلة الأخيرة ، ابدأ في التركيز حقًا على الحركة \"السلبية\". يُعرف بشكل أكثر رسميًا باسم الانقباض غريب الأطوار ، والسالب هو النقطة التي يتغلب فيها الحمل على القوة التي يمكن للعضلة أو تقدمها والمبتدئين في إطالة العضلات. على سبيل المثال ، عند أداء تمرين الدمبل ، فإن المرحلة اللامتراكزة هي عندما يتراجع الدمبل إلى أسفل من الكتف ، مما يؤدي إلى إطالة عضلات البايسبس. من خلال التركيز على هذه الحركة ومحاولة التحكم في المرحلة اللامركزية ، يمكنك الحصول على مزيد من التمزقات الدقيقة في ألياف عضلاتك ، مما يؤدي إلى درجة أعلى من التقدم لزيادة القوة والحجم في العضلات التي تعمل. لذلك ، عندما تبدأ في الشعور بالتعب ، لا تدع هذا الوزن ينخفض فقط. إن بذل قصارى جهدك لمحاربة فقدان الوزن هو أهم جزء في روتين قوتك بالكامل.\r\n\r\nأخيرًا ، تأكد من ضبط الوزن الذي تستخدمه لكل مجموعة ، حسب الحاجة. لا تتعثر في عقلية أن ما تبدأ به يجب أن ينتهي به. بالنسبة لبعض التمارين ، قد تشعر أنه يمكنك زيادة وزنك والبعض الآخر قد تحتاج إلى إنقاصه ، وقد يكون ذلك لمجموعة واحدة فقط قبل التغيير مرة أخرى. جسمك هو آلة ديناميكية دائمة التغير ، لذلك عليك أن تكون قادرًا على التغيير والتكيف مع احتياجاته يوميًا ، إن لم يكن دقيقة بدقيقة.",
              Difficulty = 3, Duration = 37, Image = "Images/Exercise/41.jpg", Video = "https://www.youtube.com/watch?v=pnNCuecyZnQ", Equipments = " دمبل  ، بدون معدات "
          },

      };
        }
        public static List<Exercise> GetListOfExercise()
        {
            return new List<Exercise>() {
        new Exercise() {
            Id = "1",
              TraningType = "تدريب القوة",
              BurnEstimate = "50-250",
              Title = "اليوجا الصباحية للجسم بالكامل",
              Price = 0,
              BodyFocus = "الجسم بالكامل",
              Detail = "هذا التدفق هو واحد من المفضلة. عندما أستيقظ في الصباح ، أحب أن أبدأ يومي بتمديدات روتينية من شأنها أن تجعل دمي يتدفق ، وطاقي ، وتضبط نغمة اليوم. هذه الممارسة ستجعلك تتعرق وتساعد " + "جسمك على تخفيف الضغط في نفس الوقت. تخلق أنماط الحركة ذاكرة حسية يمكننا البناء عليها. بدءًا من نمط التنفس ، تهدف كل حركة إلى مطابقة كل شهيق أو زفير لتشجيع التنفس العميق الذي يعزز الشعور بالتوتر ، ويزيد من مستوى الطاقة والاسترخاء ، ويثبت ضغط الدم. إذا ركزت على أنفاسك ، فسوف يهدأ عقلك. فيما يلي بعض إشارات المحاذاة التي يجب وضعها في الاعتبار للسلامة في Low Lunge:\r\n\r\nابدأ في اندفاع العداء ، والساق اليمنى للأمام مع الركبة فوق الكاحل والركبة اليسرى على الأرض مع وضع الجزء العلوي من قدمك على السجادة" +
              ". ارفع الجذع ببطء وضع يديك برفق على الفخذ الأيمن. تميل الوركين إلى الأمام قليلاً ،" +
              " مع إبقاء الركبة اليمنى خلف أصابع القدم ، والشعور بالتمدد في ثني الورك الأيسر." +
              "" +
              " امسك هنا ، أو لتمتد أعمق ، ارفع الذراعين فوق الرأس ، والعضلة ذات الرأسين من الأذنين. " +
              "استمر لمدة 30 ثانية على الأقل ، ثم كرر على الجانب الآخر. تتضمن عضلات الجسم المنخفضة المستهدفة في هذا" +
              " التسلسل أوتار الركبة ، وثني الورك ، والرباعية ، والألوية. في كل مرة نتنقل فيها عبر نمط الحركة" +
              " ، سيكون هناك موقف أو وضعان مضافان إلى التسلسل. التكرار مع كل الجسم للانفتاح على كل شكل تدريجيًا.",
              Difficulty = 3, Duration = 27, Image = "/images/Exercise/1.png", Video = "https://www.youtube.com/watch?v=w5y3Zl1F5Vs", Equipments = "حصيرة ، معدات اليوجا", RatePercentage = 50, exerciseDate = new DateTime(year: 2017, month: 3, 3)
          },

          new Exercise() {
            Id = "2", TraningType = "الحركة", BurnEstimate = "50-250", Title = "تمارين تقوية الجسم بالكامل وتمارين القلب", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "إذا كنت تريد ممارسة تمرينات رياضية فعالة في أقل من 25 دقيقة ، فلا داعي لمزيد من البحث. هذا مزيج قصير ولطيف بين نمطي تدريب مهمين: تدريب القوة وتمارين القلب والأوعية الدموية. يتم تقديم تعديلات عالية ومنخفضة التأثير حتى تتمكن من مقابلة جسمك تمامًا في مكانه.                        عندما يتعلق الأمر بالحصول على أقصى درجات \"الضجة\" لوقتك ، يمكن أن تكون قوة الاقتران وتمارين القلب فعالة للغاية. يسمح لنا تدريب القوة ببناء العضلات الخالية من الدهون بينما تحافظ تمارين القلب والأوعية الدموية على ارتفاع معدل ضربات القلب. يعملان معًا على تعزيز عملية التمثيل الغذائي وإطلاق الطاقة لتغذية يومك!\r\n\r\nكنت مؤخرًا أحضر فصلًا لركوب الدراجات حيث قال المدرب ، \"ما هي أفضل طريقة للاحتفال بجسدك من الشعور بإطلاق الطاقة والقوة التي يحملها جسمك؟\" لا يمكن اقبل المزيد. هذا التمرين هو النوع الذي يبدو وكأنه احتفال بما يمكن أن يفعله جسمك. دون أن تكون شديدة أو معتدلة للغاية ، فإنها تهبط في المنتصف تمامًا \"للاحتفال\" التمكيني والحيوي ، إذا رغبت في ذلك.",
              Difficulty = 3, Duration = 23, Image = "/images/Exercise/2.png", Video = "https://www.youtube.com/watch?v=R58oVgVgRlc", Equipments = "دمبل", RatePercentage = 50, exerciseDate = new DateTime(year: 2023, month: 3, 3)
          },
          new Exercise() {
            Id = "3", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "مجموعات القوة المركبة للجزء العلوي من الجسم", Price = 0, BodyFocus = "الجزء العلوي من الجسم", Detail = "أولاً ، سنركز على الصدر ، بدءًا من مكابس الأرضية ثم الانتقال بسرعة إلى ذبابة الصدر والانتهاء بضغطة سحق. بعد مجموعتين من تمارين الصدر ، سننتقل إلى الخلف ، بدءًا من الصفوف المنحنية ، والانتقال إلى الذباب العكسي ، والانتهاء من صف yates. مجموعتنا التالية سوف تستهدف الذراعين ، في المقام الأول العضلة ثلاثية الرؤوس والعضلة ذات الرأسين. بالنسبة لمجموعات الترايسبس لدينا ، نحتاج فقط إلى دمبل واحد. سنبدأ المجموعات بضغطة دمبل مفردة بقبضة قريبة ، وننتقل إلى كسارة جمجمة دمبل واحدة ، ثم ننتقل إلى تمديدات ثلاثية الرؤوس العلوية. (سوف تحترق عضلاتك ثلاثية الرؤوس ، لول). مجموعتنا التالية هي إحدى الطرق المفضلة لتدريب العضلة ذات الرأسين. سنستخدم المقاييس المتساوية لدفع العضلة ذات الرأسين هنا. تمريننا الأول هو ما أحب أن أسميه تجعيد الشعر أحادي الذراع ؛ سنقوم بعمل كل ذراع على حدة مع تلك قبل الانتهاء من تمارين العضلة ذات الرأسين القياسية. هذا المزيج يعمل دائمًا مع العضلة ذات الرأسين! في مجموعتنا النهائية ، سنركز على أكتافنا. سنبدأ العمل بضغط الكتف القياسي ، والانتقال إلى صفوفنا المستقيمة ، وإنهاء المجموعة مع صف دلتا الخلفي الذي يستهدف عضلات الدالية الصغيرة - مما يجعل هذه الطريقة المثالية لإنهاء تمرين الجزء العلوي من الجسم.",
              Difficulty = 4, Duration = 37, Image = "/images/Exercise/3.png", Video = "https://www.youtube.com/watch?v=fPlN4amOMY8", Equipments = "دمبل", RatePercentage = 50, exerciseDate = new DateTime(year: 2022, month: 4, 3)
          },
          new Exercise() {
            Id = "4", TraningType = "اليوجا", BurnEstimate = "50-250", Title = "مجموعة القلب والقوة", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "أولاً ، سنركز على الصدر ، بدءًا من مكابس الأرضية ثم الانتقال بسرعة إلى ذبابة الصدر والانتهاء بضغطة سحق. بعد مجموعتين من تمارين الصدر ، سننتقل إلى الخلف ، بدءًا من الصفوف المنحنية ، والانتقال إلى الذباب العكسي ، والانتهاء من صف yates. مجموعتنا التالية سوف تستهدف الذراعين ، في المقام الأول العضلة ثلاثية الرؤوس والعضلة ذات الرأسين. بالنسبة لمجموعات الترايسبس لدينا ، نحتاج فقط إلى دمبل واحد. سنبدأ المجموعات بضغطة دمبل مفردة بقبضة قريبة ، وننتقل إلى كسارة جمجمة دمبل واحدة ، ثم ننتقل إلى تمديدات ثلاثية الرؤوس العلوية. (سوف تحترق عضلاتك ثلاثية الرؤوس ، لول). مجموعتنا التالية هي إحدى الطرق المفضلة لتدريب العضلة ذات الرأسين. سنستخدم المقاييس المتساوية لدفع العضلة ذات الرأسين هنا. تمريننا الأول هو ما أحب أن أسميه تجعيد الشعر أحادي الذراع ؛ سنقوم بعمل كل ذراع على حدة مع تلك قبل الانتهاء من تمارين العضلة ذات الرأسين القياسية. هذا المزيج يعمل دائمًا مع العضلة ذات الرأسين! في مجموعتنا النهائية ، سنركز على أكتافنا. سنبدأ العمل بضغط الكتف القياسي ، والانتقال إلى صفوفنا المستقيمة ، وإنهاء المجموعة مع صف دلتا الخلفي الذي يستهدف عضلات الدالية الصغيرة - مما يجعل هذه الطريقة المثالية لإنهاء تمرين الجزء العلوي من الجسم. ",
              Difficulty = 4, Duration = 23, Image = "/images/Exercise/4.png", Video = "https://www.youtube.com/watch?v=d8QcqQA0zIQ", Equipments = "دمبل", RatePercentage = 50, exerciseDate = new DateTime(year: 2021, month: 3, 3)
          },
          new Exercise() {
            Id = "5", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "دوائر القوة الأساسية السريعة و الجوهر", Price = 0, BodyFocus = "جوهر", Detail = "يعد هذا التمرين القصير الذي يركز على النواة إضافة رائعة لروتين الجسم السفلي أو العلوي أو الكلي - ولكنه أيضًا خيار رائع كتمرين مستقل لحركتك الأساسية في اليوم. استخدم الإحماء أحادي الدورة لتهيئة عضلاتك الأساسية جسديًا للدوائر الصعبة ولكن القابلة للتكيف التي تليها ، ولكن ركز أيضًا على التدفق ببطء خلال كل تمرين لتنشيط اتصال العقل والعضلات لتوظيف العضلات بكفاءة.\r\n\r\n\r\n\r\n\r\nتحتوي كل دائرة على تمارين تجمع بين الإمساك المتساوي القياس وأنماط الحركة الديناميكية ولكن المتحكم فيها والتركيز على الاستقرار الأساسي. هذه التمارين لن تقوي فقط عضلات البطن (التي تشمل عضلات البطن ، الألوية ، عضلات الفخذ ، وعضلات الظهر السفلية) مع حركات الانثناء / الطحن التقليدية ، بل ستعمل أيضًا على تحسين مشاركة عضلات الجسم الكلية وتكامل الحركة (التدفق).\r\n\r\nلاحظ أنه لا يوجد سوى عدد قليل من التمارين المتعلقة بلوح في هذا التمرين ؛ لذلك ، إذا كانت لديك مخاوف من ألم الرسغ أثناء تمارين اللوح / وضعية الانبطاح ، فقد يكون هذا الروتين خيارًا رائعًا للاحتفاظ به في مجموعتك من أجل إجراءات الانتقال الأساسية المستقبلية. من الاعتبارات المهمة للجميع الحفاظ على ثنية طفيفة في الحوض أثناء تمارين وضعية الاستلقاء (الوجه لأعلى) والمنبطحة (الوجه لأسفل / اللوح الخشبي). على سبيل المثال ، أثناء الجزء الميت من تسلسل التنشيط بالإضافة إلى تمرين لوح الساعد في الدائرة رقم 1 ، تخيل أنك تقوم بإدخال عظام الفخذ إلى ضلوعك - قم بإمالة الجزء العلوي من عظام الحوض قليلاً إلى الأعلى والعودة باتجاه الجزء السفلي من القفص الصدري الخاص بك.\r\n\r\nفيما يلي بعض النصائح الإضافية لجعل هذا الروتين تجربة مُرضية لك:\r\n\r\nتشمل التعديلات لجميع التمارين تقليل نطاق الحركة و / أو ثني ركبتيك (تقصير الرافعة) لأي حركات تتضمن اختلافات في تمديد الساق.\r\nلاحظ التمارين الأكثر صعوبة بالنسبة لك وحدد الاختلافات في نطاقات الحركة والقوة وعدد التكرارات للتمارين ذات التركيز الأحادي (مثل v-ups المائلة). سيساعدك الانتباه إلى أكثر الاختلافات دقة في توجيه تركيزك أثناء المحاولات المستقبلية في هذا التمرين.\r\nلا تتردد في تكرار دائرة التبريد القصيرة لتمديد ممتد أو إضافة الامتدادات الخاصة بك لمساعدتك على العودة إلى حالة الاسترخاء والحيوية. يجب أن تشعر كما لو أن عضلاتك \"تعمل\" خلال هذا الروتين ولكن لا تزال تنتهي بعقلية \"جاهزة للتعامل مع أي شيء قادم\".\r\nيتمتع!",
              Difficulty = 3, Duration = 19, Image = "/images/Exercise/5.png", Video = "https://www.youtube.com/watch?v=B5ZZqBslKU0", Equipments = "حصيرة", RatePercentage = 50, exerciseDate = new DateTime(year: 2021, month: 1, 3)
          },
          new Exercise() {
            Id = "6", TraningType = "القلب والأوعية الدموية", BurnEstimate = "50-250", Title = "دارات تقوية الجسم الكلي مع عمل التوازن", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "\r\nتساعد التدريبات أحادية الجانب على تعزيز المشاركة الأساسية ، وبالتالي تحسين الأساس الذي تبدأ منه كل الحركات.\r\nتعمل عضلاتك معًا بشكل تآزري لتقوية السلسلة الحركية بأكملها ، مما يقلل من فرص السقوط أو العثرات الضارة المحتملة أثناء الأنشطة المعتادة للحياة اليومية.\r\nيمكن أن يساعدك العمل المتوازن في تحديد مناطق الضعف والكتل المحتملة نحو تحسين الأداء الرياضي وكذلك تحسين التنسيق لأنماط الحركة المتقدمة والتمارين التي تحركها القوة.\r\nالتدريبات مع تحديات التوازن تعمل على تحسين الاتصال بين العقل والجسم. يؤدي هذا الاتصال المعزز إلى زيادة القدرة على التحمل الذهني والفعالية الذاتية اللازمة لإكمال التدريبات الصعبة.\r\nتوفر مثل هذه التدريبات استراحة من البلى من التدريب على التأثير وتتحدى الدماغ لطرق بديلة لمعالجة وعي العقل والجسم من أجل نهج شامل للياقة البدنية.\r\nكل حركة في هذا التمرين لها درجات متفاوتة من التوازن في العمل. أثناء دورات القوة ، ستكمل كل تمرين لمدة 45 ثانية ، وهي فترة زمنية كافية لتتعرف تمامًا على كل حركة. تؤدي إضافة درجة صغيرة من التوازن أثناء هذه الحركات التي تركز على القوة إلى زيادة وقت العضلات تحت التوتر للمساعدة في بناء القوة. بمجرد الانتقال إلى موازنة قطاعات العمل ، استفد من تنشيط العضلات الذي حدث أثناء دوائر القوة لتحقيق أقصى استفادة من الفواصل الزمنية التي تبلغ دقيقة واحدة والتركيز على الاستقرار.\r\n\r\nسأعترف ، لقد استمتعت تمامًا بالحركة بسرعة أبطأ من التدريبات المعتادة مع هذه الجلسة التي تركز على التوازن. لبضعة أيام بعد ذلك ، لاحظت أن العديد من العضلات شعرت بـ \"الاستيقاظ\" مع نوع صحي جيد من القرحة التي سمحت لي بمعرفة أنني كنت أهمل مجموعات عضلية معينة وطرق التدريب. خذ وقتك مع كل حركة واستمع إلى الملاحظات التي يقدمها لك جسمك. استمتع!",
              Difficulty = 3, Duration = 45, Image = "/images/Exercise/6.png", Video = "https://www.youtube.com/watch?v=UzAFN61CiVQ", Equipments = "حصيرة", RatePercentage = 50, exerciseDate = new DateTime(year: 2021, month: 2, 3)
          },
          new Exercise() {
            Id = "7", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "مجموعة سريعة من تمارين القلب والقوة و الجوهر  لكامل الجسم", Price = 0, BodyFocus = "الجسم بالكامل", Detail = "في منتصف عام 2022 ، قمت بتصوير تمرين بدا أن عددًا كبيرًا منكم يحبه حقًا. كان قسم التعليقات مليئًا بطلبات لتصوير المزيد مثله ، وعلى الرغم من أنني كنت أمتلك مجموعة من التدريبات الأخرى المطلوبة للحصول عليها أولاً ، إلا أنني لم أنس هذا التمرين (بفضل Kelli لتذكيري) وقمت ببناء علامة تجارية جديدة نسخة منه مع جميع التدريبات الجديدة. بالنسبة لأولئك منكم الذين لم يجربوا النسخة الأصلية ، يمكنك إلقاء نظرة هنا أو - بل أفضل - جرب كلاهما وأخبرني ما إذا كان هذا الإصدار الجديد يتوافق مع نفس المعيار.\r\n\r\n\r\n\r\n\r\nسواء كنت قد جربت الإصدار الأصلي أم لا ، لا يهم ، حيث إن كلاهما تمرين مستقل مصمم لروتين كامل للجسم متوازن. يحتوي هذا التمرين الذي يستغرق 26 دقيقة على كل شيء: الإحماء ، والتهدئة ، وفترات HIIT للقلب ، ومجموعات القوة ، والتمارين الأساسية ، كل ذلك في فاصل زمني سريع بأسلوب Tabata للحفاظ على هذا التمرين سريعًا.\r\n\r\nتم بناء كل مجموعة من المجموعات الأربع في هذا الروتين بنفس الطريقة تمامًا ولكن مع تمارين فريدة في كل مرة. تتكون المجموعات من تمرين HIIT من أجل انفجار القلب ، يليه تمرين قوة متعدد السلاسل لزيادة إجهاد العضلات ومكاسب القوة ، ثم ننهيها بتمرين أساسي للمتعة فقط. على الرغم من أن هذا التمرين قصير ، إلا أنه يحزم لك بالتأكيد ، خاصة إذا كنت تتحدى نفسك في مجموعات القوة.\r\n\r\nأيضًا ، إذا كنت تريد تحديًا إضافيًا لكامل الجسم ، فحاول القيام بكل من هذين التمرينين معًا أو كل منهما مرتين خلال تمرين كامل للجسم لمدة ساعة تقريبًا.",
              Difficulty = 4, Duration = 26, Image = "/images/Exercise/7.png", Video = "https://www.youtube.com/watch?v=3xR8ZKVALwo", Equipments = "حصيرة ، دمبل  ، بدون معدات ", RatePercentage = 50, exerciseDate = new DateTime(year: 2022, month: 5, 3)
          },
          new Exercise() {
            Id = "8", TraningType = "اليوجا", BurnEstimate = "50-250", Title = "تمرين الجسم الكلي السريع - 10 أو 15 دقيقة تختارها", Price = 0, BodyFocus = "الجسم بالكامل ", Detail = "في تمرين اليوم نركز على السرعة. تم تصميم هذا التمرين القصير ولكن الفعال ليوفر لك تمرينًا جيدًا في أقصر وقت ممكن لتلك الأيام التي ربما لم تكن قد مارستها فيها على الإطلاق. لقد صممت هذا التمرين بعد نوبة أخيرة من العمل المكثف ومتطلبات الحياة التي ضربت في نفس الوقت ، مما يجعل التمرين لمدة 20 دقيقة يبدو كثيرًا.\r\n\r\nلقد صممت هذا الروتين عن قصد لاستخدامه بسهولة في تخصيصين مختلفين للوقت: إصدار سريع يأخذك خلال مقطع فيديو التمرين الكامل هذا ويبلغ أقصى حد له 15 دقيقة ، وإصدار فائق السرعة يأخذك خلال جزء \"التمرين\" لـ نصف الوقت مع قطع الطول الإجمالي إلى حوالي 10 دقائق.\r\n\r\nيتم إجراء كل هذا الروتين بنفس بنية الفاصل الزمني 20 تشغيل و 10 إيقاف لإبقائه سريعًا وبسيطًا. لقد قمت بتضمين إحماء سريع مدته 3 دقائق يتم تشغيله مباشرة في التمرين لتقليل أي توقف مؤقت غير ضروري ؛ تذكر أن هذا كله يتعلق بالكفاءة حتى نتمكن من الحصول على أفضل تدريب ممكن في أقصر وقت ممكن. لذلك ، بعد تمارين الإحماء الستة ، ننتقل مباشرة إلى التمارين الثمانية لقسم التمرين. هذا هو المكان الذي يمكنك فيه الاختيار من خلال هذه التدريبات الثمانية مرة واحدة أو مرتين. أعطي دعوة واضحة عندما ننتهي من أول تشغيل لهذه التمارين حتى تتمكن من اتخاذ قرار التخطي إلى فترة التهدئة السريعة التي تبلغ 3 دقائق والقيام بها في حوالي 10 دقائق أو إجراء التمارين مرة ثانية (كما أفعل في الفيديو) ويتم الانتهاء منه في حوالي 15 دقيقة. بهذه الطريقة يمكنك تحديد مقدار الوقت الذي يمكنك تخصيصه لهذا التمرين.\r\n\r\nهذا تمرين شامل للجسم ، لذا إذا كنت تستخدمه بعد يوم مكثف من الجزء العلوي أو السفلي من الجسم ، ففي كلتا الحالتين من المرجح أنك تستخدم بعض مجموعات العضلات نفسها. لا تقلق ، على الرغم من ذلك - ستفعل ذلك بوزن الجسم فقط حتى تتمكن من التكيف لجعل التمارين أسهل أو أصعب ، وستقوم فقط ببضع عمليات التكرار لكل منها ، لذلك لا داعي للقلق بشأن إرهاق العضلات المؤلمة.\r\n\r\nمع ذلك ، يمكن أيضًا استخدام هذا كتمرين إضافي إذا كنت تريد القيام بتمرين ثانٍ في يوم واحد. يمكن القيام بذلك إما مباشرة بعد التمرين الأول أو في وقت لاحق من اليوم للحصول على نوبة إضافية من حرق السعرات الحرارية.",
              Difficulty = 4, Duration = 23, Image = "/images/Exercise/8.png", Video = "https://www.youtube.com/watch?v=xafq0q5lIq4", Equipments = "دمبل", RatePercentage = 50, exerciseDate = new DateTime(year: 2022, month: 6, 3)
          },
          new Exercise() {
            Id = "9", TraningType = "تدريب القوة", BurnEstimate = "50-250", Title = "تقوية اعضاء الجسم السفلية - تمرين الفخذ لمدة 43 دقيقة", Price = 0, BodyFocus = "الجسم السفلي", Detail = "يمكن استخدام تمرين الجزء السفلي من الجسم هذا للتناغم أو القوة أو بناء الكتلة ، بحيث يمكنك استخدامه لما تحتاجه بالضبط. في هذا الروتين ، قمنا بتقسيم التمرين إلى ثلاث مجموعات (لا تشمل الإحماء والتهدئة). سيتم إجراء أول مجموعتين بأسلوب فاصل من 45 ثانية من النشاط مع 15 ثانية من الراحة للاستعداد للتمرين التالي. تحتوي كل مجموعة من هاتين المجموعتين الأوليين على 4 تمارين لكل منهما ، وسيتم إجراؤها بنمط A ، B A ، B بالتناوب ، بالتناوب ذهابًا وإيابًا بين اثنين من التمارين الأربعة في وقت واحد. سيتم إجراء كل تمرين لما مجموعه ثلاث مجموعات قبل الانتقال إلى التدريبات التالية ، مما يمنحنا إجمالي 12 فترة لكل مجموعة لأول مجموعتين. ستتم المجموعة الأخيرة قبل فترة التهدئة والتمدد بشكل مختلف. على الرغم من وجود أربعة تمارين مرة أخرى في هذه المجموعة ، فإننا سنقوم بدلاً من ذلك بإجراء كل تمرين لمجموعة واحدة فقط باستخدام فترات 60 ثانية على و 15 ثانية راحة. هذا المزيج من مجموعتين باستخدام ثلاث مجموعات تقليدية أكثر لكل تمرين متبوعًا بمجموعة تستخدم مجموعة نضوب واحدة سيسمح لنا بإرهاق العضلات بشكل فعال إلى الحد الذي يمكننا فيه الحصول على التمزقات الدقيقة في عضلاتنا التي تؤدي إلى زيادة القوة والكتلة.\r\nمع ما يقال ، تذكر أنه يمكنك التحكم بالضبط في النتائج التي تحصل عليها من هذا الروتين عن طريق ضبط الوزن الذي تختار رفعه ومدى سرعة القيام بكل تكرار. للحصول على تمرين أكثر تركيزًا على التنغيم ، استخدم وزن الجسم فقط أو الوزن الخفيف جدًا وتحرك بسرعة أكبر (طالما أنك لا تزال تتحرك مع التحكم ولا تستخدم الزخم للمساعدة في إكمال الحركة التي يتم إجراؤها). إذا كنت تريد التركيز أكثر على بناء الحجم الكلي للعضلات ، فحافظ على بطء حركاتك واختر أثقل وزن يمكنك التحكم فيه من خلال نطاق كامل من الحركة. مع بناء الكتلة ، يجب أن يكون هدفك هو الحصول على 90-100 ٪ من كل مجموعة من أول مجموعتين (من أي تمرين معين) قبل أن تبدأ عضلاتك في الاستسلام ويبدأ شكلك في المعاناة. يجب أن يكون الهدف من المجموعة الثالثة (الأخيرة) من كل تمرين هو إكمال 80-90٪ من الفاصل الزمني قبل أن تستسلم عضلاتك.", Difficulty = 4, Duration = 43, Image = "/images/Exercise/9.png", Video = "https://www.youtube.com/watch?v=ABDmiZD1TDU", Equipments = "دمبل", RatePercentage = 50, exerciseDate = new DateTime(year: 2023, month: 5, 3)
          },
          new Exercise() {
            Id = "10", TraningType = "الحركة", BurnEstimate = "50-250", Title = "روتين القوة الأساسية الموزونة - روتين أوزان الدمبل في المنزل", Price = 0, BodyFocus = "جوهر", Detail = "\r\nإذا كنت تمارس هذا التمرين بهدف بناء القوة و / أو الكتلة ، فإليك بعض الأشياء التي يجب وضعها في الاعتبار.\r\n\r\nأولاً ، كما هو الحال مع أي تمرين قوي أو جماعي ، لا ترفع كثيرًا حتى يبدأ شكلك أو نطاق حركتك في المعاناة. إذا كنت قد قمت في أي وقت مضى بواحد من إجراءات قوتنا من أي نوع من قبل ، فمن المحتمل أنك سمعتنا بالفعل نقول هذا مرارًا وتكرارًا ؛ شكل ونطاق الحركة أكثر أهمية بكثير من مقدار الوزن الذي ترفعه عندما يتعلق الأمر بالقوة الوظيفية الخالية من الإصابات.\r\n\r\nثانيًا ، حدد الوزن الذي تستخدمه بناءً على معدل التعب لديك. يجب أن يكون هدفك هو استخدام وزن ثقيل بدرجة كافية بحيث يمكنك إجراء جميع عمليات التكرار تقريبًا بشكل مثالي ونطاق كامل من الحركة. يجب السماح للمعاناة في آخر 2 أو 3 مرات فقط لأن هذه العضلات تصبح مرهقة للغاية بحيث لا يمكن الحفاظ عليها نظيفة.\r\n\r\nثالثًا ، عندما تتخلى عضلاتك عن تلك التكرارات القليلة الأخيرة ، ابدأ في التركيز حقًا على الحركة \"السلبية\". يُعرف بشكل أكثر رسميًا باسم الانقباض غريب الأطوار ، والسالب هو النقطة التي يتغلب فيها الحمل على القوة التي يمكن للعضلة أو تقدمها والمبتدئين في إطالة العضلات. على سبيل المثال ، عند أداء تمرين الدمبل ، فإن المرحلة اللامتراكزة هي عندما يتراجع الدمبل إلى أسفل من الكتف ، مما يؤدي إلى إطالة عضلات البايسبس. من خلال التركيز على هذه الحركة ومحاولة التحكم في المرحلة اللامركزية ، يمكنك الحصول على مزيد من التمزقات الدقيقة في ألياف عضلاتك ، مما يؤدي إلى درجة أعلى من التقدم لزيادة القوة والحجم في العضلات التي تعمل. لذلك ، عندما تبدأ في الشعور بالتعب ، لا تدع هذا الوزن ينخفض فقط. إن بذل قصارى جهدك لمحاربة فقدان الوزن هو أهم جزء في روتين قوتك بالكامل.\r\n\r\nأخيرًا ، تأكد من ضبط الوزن الذي تستخدمه لكل مجموعة ، حسب الحاجة. لا تتعثر في عقلية أن ما تبدأ به يجب أن ينتهي به. بالنسبة لبعض التمارين ، قد تشعر أنه يمكنك زيادة وزنك والبعض الآخر قد تحتاج إلى إنقاصه ، وقد يكون ذلك لمجموعة واحدة فقط قبل التغيير مرة أخرى. جسمك هو آلة ديناميكية دائمة التغير ، لذلك عليك أن تكون قادرًا على التغيير والتكيف مع احتياجاته يوميًا ، إن لم يكن دقيقة بدقيقة.", Difficulty = 3, Duration = 37, Image = "/images/Exercise/9.png", Video = "https://www.youtube.com/watch?v=pnNCuecyZnQ", Equipments = " دمبل  ، بدون معدات ", RatePercentage = 50, exerciseDate = new DateTime(year: 2021, month: 9, 3)
          },

      };
        }
        public static List<Exercies_program> GetListOfExerciesprogram()
        {
            return new List<Exercies_program>()
            {
             new Exercies_program(){Id="1",SportsProgramId="102" , ExerciseId="1" ,Day=1,Week=1},
             new Exercies_program(){Id="2",SportsProgramId="102" , ExerciseId="2" ,Day=2,Week=1},
             new Exercies_program(){Id="3",SportsProgramId="102" , ExerciseId="3" ,Day=3,Week=1},
             new Exercies_program(){Id="4",SportsProgramId="102" , ExerciseId="4" ,Day=4,Week=1},
             new Exercies_program(){Id="5",SportsProgramId="102" , ExerciseId="5" ,Day=4,Week=1},
             new Exercies_program(){Id="6",SportsProgramId="102" , ExerciseId="6" ,Day=5,Week=1},
             new Exercies_program(){Id="7",SportsProgramId="102" , ExerciseId="7" ,Day=6,Week=1},
             new Exercies_program(){Id="8",SportsProgramId="102" , ExerciseId="8" ,Day=7,Week=1},
             new Exercies_program(){Id="9",SportsProgramId="102" , ExerciseId="9" ,Day=7,Week=1},
             new Exercies_program(){Id="10",SportsProgramId="102" , ExerciseId="10" ,Day=7,Week=1},


             new Exercies_program(){Id="11",SportsProgramId="102" , ExerciseId="10" ,Day=1,Week=2},
             new Exercies_program(){Id="12",SportsProgramId="102" , ExerciseId="8" ,Day=2,Week=2},
             new Exercies_program(){Id="13",SportsProgramId="102" , ExerciseId="6" ,Day=2,Week=2},
             new Exercies_program(){Id="14",SportsProgramId="102" , ExerciseId="5" ,Day=3,Week=2},
             new Exercies_program(){Id="15",SportsProgramId="102" , ExerciseId="4" ,Day=4,Week=2},
             new Exercies_program(){Id="16",SportsProgramId="102" , ExerciseId="3" ,Day=5,Week=2},
             new Exercies_program(){Id="17",SportsProgramId="102" , ExerciseId="2" ,Day=6,Week=2},
             new Exercies_program(){Id="18",SportsProgramId="102" , ExerciseId="1" ,Day=7,Week=2},
             new Exercies_program(){Id="19",SportsProgramId="102" , ExerciseId="9" ,Day=7,Week=2},
             //prog 2=> 4weeks

             new Exercies_program(){Id="20",SportsProgramId="100" , ExerciseId="10" ,Day=1,Week=1},
             new Exercies_program(){Id="21",SportsProgramId="100" , ExerciseId="8" ,Day=2,Week=1},
             new Exercies_program(){Id="22",SportsProgramId="100" , ExerciseId="6" ,Day=2,Week=1},
             new Exercies_program(){Id="23",SportsProgramId="100" , ExerciseId="5" ,Day=3,Week=1},
             new Exercies_program(){Id="24",SportsProgramId="100" , ExerciseId="4" ,Day=4,Week=1},
             new Exercies_program(){Id="25",SportsProgramId="100" , ExerciseId="3" ,Day=5,Week=1},
             new Exercies_program(){Id="26",SportsProgramId="100" , ExerciseId="2" ,Day=6,Week=1},
             new Exercies_program(){Id="27",SportsProgramId="100" , ExerciseId="1" ,Day=6,Week=1},
             new Exercies_program(){Id="28",SportsProgramId="100" , ExerciseId="9" ,Day=7,Week=1},


             new Exercies_program(){Id="29",SportsProgramId="100" , ExerciseId="7" ,Day=1,Week=2},
             new Exercies_program(){Id="30",SportsProgramId="100" , ExerciseId="8" ,Day=1,Week=2},
             new Exercies_program(){Id="31",SportsProgramId="100" , ExerciseId="6" ,Day=2,Week=2},
             new Exercies_program(){Id="32",SportsProgramId="100" , ExerciseId="3" ,Day=3,Week=2},
             new Exercies_program(){Id="33",SportsProgramId="100" , ExerciseId="2" ,Day=4,Week=2},
             new Exercies_program(){Id="34",SportsProgramId="100" , ExerciseId="9" ,Day=5,Week=2},
             new Exercies_program(){Id="35",SportsProgramId="100" , ExerciseId="6" ,Day=6,Week=2},
             new Exercies_program(){Id="36",SportsProgramId="100" , ExerciseId="3" ,Day=7,Week=2},
             new Exercies_program(){Id="37",SportsProgramId="100" , ExerciseId="1" ,Day=7,Week=2},

             new Exercies_program(){Id="38",SportsProgramId="100" , ExerciseId="10" ,Day=1,Week=3},
             new Exercies_program(){Id="39",SportsProgramId="100" , ExerciseId="8" ,Day=2,Week=3},
             new Exercies_program(){Id="40",SportsProgramId="100" , ExerciseId="6" ,Day=3,Week=3},
             new Exercies_program(){Id="41",SportsProgramId="100" , ExerciseId="4" ,Day=3,Week=3},
             new Exercies_program(){Id="42",SportsProgramId="100" , ExerciseId="5" ,Day=4,Week=3},
             new Exercies_program(){Id="43",SportsProgramId="100" , ExerciseId="9" ,Day=4,Week=3},
             new Exercies_program(){Id="44",SportsProgramId="100" , ExerciseId="6" ,Day=5,Week=3},
             new Exercies_program(){Id="45",SportsProgramId="100" , ExerciseId="3" ,Day=6,Week=3},
             new Exercies_program(){Id="46",SportsProgramId="100" , ExerciseId="1" ,Day=7,Week=3},

             new Exercies_program(){Id="47",SportsProgramId="100" , ExerciseId="2" ,Day=1,Week=4},
             new Exercies_program(){Id="48",SportsProgramId="100" , ExerciseId="6" ,Day=2,Week=4},
             new Exercies_program(){Id="49",SportsProgramId="100" , ExerciseId="5" ,Day=3,Week=4},
             new Exercies_program(){Id="50",SportsProgramId="100" , ExerciseId="4" ,Day=3,Week=4},
             new Exercies_program(){Id="51",SportsProgramId="100" , ExerciseId="9" ,Day=4,Week=4},
             new Exercies_program(){Id="52",SportsProgramId="100" , ExerciseId="8" ,Day=4,Week=4},
             new Exercies_program(){Id="53",SportsProgramId="100" , ExerciseId="3" ,Day=5,Week=4},
             new Exercies_program(){Id="54",SportsProgramId="100" , ExerciseId="7" ,Day=6,Week=4},
             new Exercies_program(){Id="55",SportsProgramId="100" , ExerciseId="10" ,Day=7,Week=4},


             //prog 3 => 1 week
             
             new Exercies_program(){Id="56",SportsProgramId="101" , ExerciseId="1" ,Day=1,Week=1},
             new Exercies_program(){Id="57",SportsProgramId="101" , ExerciseId="3" ,Day=2,Week=1},
             new Exercies_program(){Id="58",SportsProgramId="101" , ExerciseId="5" ,Day=3,Week=1},
             new Exercies_program(){Id="59",SportsProgramId="101" , ExerciseId="4" ,Day=4,Week=1},
             new Exercies_program(){Id="60",SportsProgramId="101" , ExerciseId="9" ,Day=4,Week=1},
             new Exercies_program(){Id="61",SportsProgramId="101" , ExerciseId="8" ,Day=5,Week=1},
             new Exercies_program(){Id="62",SportsProgramId="101" , ExerciseId="2" ,Day=5,Week=1},
             new Exercies_program(){Id="63",SportsProgramId="101" , ExerciseId="7" ,Day=6,Week=1},
             new Exercies_program(){Id="64",SportsProgramId="101" , ExerciseId="10" ,Day=7,Week=1},


             //prog 4 =>8 weeks

             new Exercies_program(){Id="65",SportsProgramId="103" , ExerciseId="1" ,Day=1,Week=1},
             new Exercies_program(){Id="66",SportsProgramId="103" , ExerciseId="3" ,Day=2,Week=1},
             new Exercies_program(){Id="67",SportsProgramId="103" , ExerciseId="5" ,Day=3,Week=1},
             new Exercies_program(){Id="68",SportsProgramId="103" , ExerciseId="4" ,Day=4,Week=1},
             new Exercies_program(){Id="69",SportsProgramId="103" , ExerciseId="9" ,Day=4,Week=1},
             new Exercies_program(){Id="70",SportsProgramId="103" , ExerciseId="8" ,Day=5,Week=1},
             new Exercies_program(){Id="71",SportsProgramId="103" , ExerciseId="2" ,Day=5,Week=1},
             new Exercies_program(){Id="72",SportsProgramId="103" , ExerciseId="7" ,Day=6,Week=1},
             new Exercies_program(){Id="73",SportsProgramId="103" , ExerciseId="10" ,Day=7,Week=1},


            };
        }

        public static List<HealthyRecipe> GetListHealthyRecipe()
        {
            return new List<HealthyRecipe>() {

        new HealthyRecipe {
          Id = "41", Image = "/images/HealthyRecipes/1.jpg", MealType = MealTypeTypeStatus.Dinner.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 50, Calories = 491, Total_Carbohydrate = 43, Protein = 35
        },
        //الثوم الطازج والليمون,سمك السلمون,طماطم كرزية,صلصة 
        new HealthyRecipe {
          Id = "42", Image = "/images/HealthyRecipes/2.jpg", MealType = MealTypeTypeStatus.Snack.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 5, Calories = 156, Total_Carbohydrate = 17, Protein = 4
        },
        //موزولوز
        new HealthyRecipe {
          Id = "43", Image = "/images/HealthyRecipes/3.jpg", MealType = MealTypeTypeStatus.Lunch.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 50, Calories = 379, Total_Carbohydrate = 47, Protein = 32
        },
        // الدجاج المشويةوصلصة الباربكيو و وتوابل الصوديوم المنخفضةوالسكروالطماطم و شريحتين من خبز القمح الكامل المحمص و خل التفاح
        new HealthyRecipe {
          Id = "44", Image = "/images/HealthyRecipes/4.jpg", MealType = MealTypeTypeStatus.Snack.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 60, Calories = 19, Total_Carbohydrate = 37, Protein = 5
        },
        //100 جرام زيت كانولا, 1كوب لبن, 2بيضة,1 ملعقة صغيرةبيكنج باودر,رشةفانيلا,6 باكتسكر دايت,نصف كوبكاكاو خام,1كوب دقيق كامل الحبة,1 ملعقة صغيرةبيكنج صودا, رشةملح
        new HealthyRecipe {
          Id = "45", Image = "/images/HealthyRecipes/5.png", MealType = MealTypeTypeStatus.Snack.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 60, Calories = 170, Total_Carbohydrate = 43, Protein = 5
        },
        //150جرام  مكرونة,1بصلة,رشةفلفل,كوب ونصفلبن, ملعقتين دقيق, 2جبنة مثلثات خفيفة,ربع لحمة مفروم احمر, رشةملح, ملعقتين زيت, كوب ماء, 50جرامجبنة حلوم, كوب ونصف لبن,
        new HealthyRecipe {
          Id = "46", Image = "/images/HealthyRecipes/6.jpg", MealType = MealTypeTypeStatus.Lunch.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 30, Calories = 180, Total_Carbohydrate = 44, Protein = 4
        },
        //كوب ارز بسمتي,100 جرامجزر, 2 ملعقةشوفان مطحون,رشةفلفل,كوب شوربة, ربع ملعقةزبد, 1ثومة,100 جرامبسلة,100 جرامفلفل الوان, رشة ملح,رشةقرفة, 50 جرامجبن حلوم, كوب لبن
        new HealthyRecipe {
          Id = "47", Image = "/images/HealthyRecipes/7.jpg", MealType = MealTypeTypeStatus.Dinner.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 35, Calories = 538, Total_Carbohydrate = 79, Protein = 37
        },
        //صدور الدجاج والجلد,الأرز البني, زبادي يوناني قليل الدسم ,الثوم, فتات خبز القمح الكامل المقرمش,طبقة البارميزان,
        new HealthyRecipe {
          Id = "48", Image = "/images/HealthyRecipes/8.jpg", MealType = MealTypeTypeStatus.Breakfast.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 10, Calories = 30, Total_Carbohydrate = 10, Protein = 5
        },
        //50 جرام بقدونس,1الليمون,1الخيار, 1التفاح,20 جرام النعناع
        new HealthyRecipe {
          Id = "49", Image = "/images/HealthyRecipes/9.png", MealType = MealTypeTypeStatus.Breakfast.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 15, Calories = 110, Total_Carbohydrate = 10, Protein = 5,
        },
        //ربع ملعقةزيت زيتون,1فلفل, ربع كوبزيتون, رشةفلفل اسود, قطعةريكفورد
        new HealthyRecipe {
          Id = "50", Image = "/images/HealthyRecipes/10.png", MealType = MealTypeTypeStatus.SideDish.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 60, Calories = 40, Total_Carbohydrate = 20, Protein = 8
        },
        //1جزر, 1 خرشوف,100 جرامكوسة,100 جرامذرة حب,ربع ملعقة نشأ, 1 بطاطس,100 جرامبسلة,100 جرامفاصوليا, نصف كوب لبن, ملعقة دقيق
        new HealthyRecipe {
          Id = "51", Image = "/images/HealthyRecipes/11.png", MealType = MealTypeTypeStatus.Lunch.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 50, Calories = 125, Total_Carbohydrate = 30, Protein = 5,
        },
        // ملعقةخميرة,ملعقتان دقيق ابيض,50 جرامشوفان مطحون,ملعقةخل,رشة بيكنج بودر,50 جرامطماطم,50 جرامفلفل الوا,50 جرامبصل,50 جرامزيتون,50 جرامذرة مسلوق,100 جرامجبن حلوم,فصثوم مفروم,ملعقةسكر,ملعقتانزيت زيتون,
        new HealthyRecipe {
          Id = "52", Image = "/images/HealthyRecipes/12.png", MealType = MealTypeTypeStatus.Snack.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 30, Calories = 66, Total_Carbohydrate = 36, Protein = 5,
        },
        //كوب دقيق ذرة اصفر,نصف كوب دقيق ابيض,1 بيضه,كوب لبن,رشه ملح,3معالقزيت كانولا او زيت نباتي,3 معالق سكر بني او دايت,معلقةبيكنج بودر,نصف معلقةفانيليا سائلة
        new HealthyRecipe {
          Id = "53", Image = "/images/HealthyRecipes/13.jpg", MealType = MealTypeTypeStatus.Lunch.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 30, Calories = 110, Total_Carbohydrate = 45, Protein = 7,
        },
        //250 جرام دجاج,2فلفل الوان,1بصلة,ملعقتين صلصلة صحية,100 جراممكرونة
        new HealthyRecipe {
          Id = "54", Image = "/images/HealthyRecipes/14.jpg", MealType = MealTypeTypeStatus.Lunch.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 60, Calories = 145, Total_Carbohydrate = 30, Protein = 17,
        },
        // كوبارز بني,1بصلة,1دجاجة,رشة بهارات صحيحة,رشة ملح,رشة كمون,رشة فلفل اسود,رشة بهارات مشكلة,رشة بصل بودر,رشة قرفه مطحونه,رشةلومي مطحون,رشةكزبرة مطحونه,30 جرام مكسرات
        new HealthyRecipe {
          Id = "55", Image = "/images/HealthyRecipes/15.png", MealType = MealTypeTypeStatus.SideDish.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 15, Calories = 25, Total_Carbohydrate = 10, Protein = 8
        },
        //كوب فاصوليا حمراء,كوب فاصوليا بيضاء,كوب فاصوليا خضراء,1بصلة خضراء,2 ملعقةبقدونس,ملعقةزيت زيتون,ملعقةخل,1ثومة,ملعقةماستردة,ملعقةفلفل اسود,ملعقةملح
        new HealthyRecipe {
          Id = "56", Image = "/images/HealthyRecipes/16.jpg", MealType = MealTypeTypeStatus.Snack.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 30, Calories = 150, Total_Carbohydrate = 25, Protein = 5
        },
        // نصف لتر لبن,4 باكيتسكر دايت,2 ملعقةجوز الهند,2 ملعقة ماء ورد,ملعقةنشا,1فانيليا
        new HealthyRecipe {
          Id = "57", Image = "/images/HealthyRecipes/17.jpg", MealType = MealTypeTypeStatus.Dinner.ToString(), DietaryType = DietaryTypeStatus.Vegetarian.ToString(), PrepTime = 20, Calories = 50, Total_Carbohydrate = 15, Protein = 4
        },
        //1ملفوف,1جزر,3المايونيز الصحي,1زبادي كبير,ملعقة صغيرة عسل ابيض,3 ملعقاتخل,ربع ملعقةملح
        new HealthyRecipe {
          Id = "58", Image = "/images/HealthyRecipes/18.jpg", MealType = MealTypeTypeStatus.Breakfast.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 30, Calories = 65, Total_Carbohydrate = 40, Protein = 15
        },
        //1بصلة,300 جراملحمة المفرومة,1بيضة, رشة فلفل أسمر,ملعقتانزيت,ملعقةبصل بودر,حسب الرغبةبهارات,حسب الرغبةبقدونس
        new HealthyRecipe {
          Id = "59", Image = "/images/HealthyRecipes/19.jpg", MealType = MealTypeTypeStatus.Breakfast.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 15, Calories = 34, Total_Carbohydrate = 15, Protein = 0
        },
        // ملعقةسكر دايت,1تفاح,2القرنفل ,عودالقرفة
        new HealthyRecipe {
          Id = "60", Image = "/images/HealthyRecipes/20.jpg", MealType = MealTypeTypeStatus.Breakfast.ToString(), DietaryType = DietaryTypeStatus.Omnivore.ToString(), PrepTime = 240, Calories = 45, Total_Carbohydrate = 15, Protein = 7
        },
        //نصف كيلوكريز,3 معالقسكر ستيفيا,نصف ملعقة صغيرةفانيلا سائلة,رشة قرفة,ربع كوبعصير ليمونة,ملعقةعسل

        new HealthyRecipe {
          Id = "65",
            Image = "/Images/HealthyRecipes/1.jpg",
            MealType = "وجبة الإفطار",
            DietaryType = "حيواني",
            PrepTime = 12,
            Calories = 250,
            Total_Carbohydrate = 6,
            Protein = 24,
            Ingredients = "بيضات كاملة,100,غرام\n" + " الديك الرومي المطحون الخالي من الد,60,غرام\n" +
            "توابل التاكو ,2,غرام\n" + " الفلفل الأخضر الجرس,20,غرام\n" + " الفلفل الأحمر,20,غرام\n" +
            " البصل الأحمر,20,غرام\n" + "صلصة,15,غرام\n" + " زبادي يوناني قليل الدسم,15,غرام\n" + " البصل الأخضر,10,غرام\n",
            PreparationMethod = "دهن مقلاة غير لاصقة بقليل من بخاخ تحرير المقلاة وقم بالتسخين المسبق على حرارة متوسطة إلى عالية.\r\nبمجرد أن يسخن , افرم الديك الرومي المطحون في المقلاة ورشي توابل التاكو مع التقليب حتى تمتزج. يُطهى لمدة 3-4 دقائق مع التحريك من حين لآخر أو حتى ينضج تمامًا ويصبح لونه بنيًا جيدًا. بمجرد طهيه , باستخدام ملعقة مثقوبة , أخرج الديك الرومي من المقلاة وضعه جانبًا على طبق.\r\n, دهن المقلاة برفق مرة أخرى وعاد إلى درجة حرارة متوسطة إلى عالية. يُضاف الفلفل والبصل ويُطهى لمدة 3-4 دقائق أو حتى ينضج.\r\n, بمجرد أن تصبح الخضار طرية , أعد الديك الرومي المطحون إلى المقلاة وقلّب المزيج. باستخدام ملعقة مشقوقة , تُرفع الخضار والديك الرومي المفروم من المقلاة , ويُترك جانباً على الطبق , ويُتبل قليلاً بالملح والفلفل حسب الرغبة.\r\n, أعد المقلاة إلى درجة حرارة متوسطة إلى عالية. بمجرد أن يسخن , أضف البيض ولفه لتغطي قاع المقلاة.\r\n,يُغطّى ويُطهى لمدة 2-3 دقائق أو حتى يصبح البيض متماسكًا وينضج تمامًا. أخرج البيضة من المقلاة بحذر وانقلها إلى طبق التقديم.\r\nوزعي البيض بالديك الرومي والخضار والصلصة. دولوب مع الزبادي ورش البصل الأخضر قبل التقديم.",
            Description = "<p> <strong> الطبق </strong> </p>\r\n<p> فاهيتا على الفطور؟ تتحدى! مستوحاة من تلك الفاهيتا الأزيز على غرار المطاعم ، قمنا بإعادة إنشاء نسخة مبسطة مثالية لصباح أيام الأسبوع المزدحمة - كاملة مع خيارات الإعداد المسبق لتوفير المزيد من الوقت. بدلاً من التورتيلا ، ابتكرنا مفهوم الأومليت المفتوح الوجه. الأومليت مليء بالديك الرومي المحمر والمتبل بالإضافة إلى الفلفل والبصل المقلي. القليل من الصلصة والزبادي قليل الدسم والبصل الأخضر يكمل جمالية الفاهيتا. إذا كنت ترغب في جعل فاهيتا الإفطار نباتيًا ، فلا تتردد في استبدال الديك الرومي ببديل اللحم المفروم المفضل لديك (أو التوفو المفتت). </p>\r\n<p> <strong> نصائح للتحضير المسبق / لتوفير الوقت </strong> </p>\r\n<p> يمكن طهي الديك الرومي والخضار (الفلفل والبصل) وتبريدهما قبل يوم أو يومين. أثناء طهي البيض ، قم بإعادة تسخين مزيج الديك الرومي والخضروات في الميكروويف (أو في مقلاة أخرى) ، ثم قم بتجميعها حسب التعليمات. </p>",
            Price = 0,
            RatePercentage = 0,
            ShortDescription = "",
            Title = " فاهيتا أوميليت مفتوح الوجه مع تركيا المطحونة والفلفل والبصل",
        },

        new HealthyRecipe {
          Id = "66",
            Image = "/Images/HealthyRecipes/2.jpg",
            MealType = "طبق جانبي,وجبة غداء",
            DietaryType = "حيواني",
            PrepTime = 15,
            Calories = 269,
            Total_Carbohydrate = 30,
            Protein = 26,
            Ingredients = " الريحان الطازج,2,غرام\n" + " خيارة,60,غرام\n" +
            " جبن كوخ قليل الدسم ,2,غرام\n" + "  كعكة القمح الكامل الإنجليزية ,20,غرام\n" + " الخل البلسمي ,20,غرام\n" +
            "  البارود الأسود,20,غرام\n" + "التوابل الإيطالية,15,غرام\n" + " صدر دجاج,15,غرام\n" + "زيت الزيتون,10,غرام\n",
            PreparationMethod = ", قم بالتسخين المسبق لشواية الغاز إلى درجة حرارة متوسطة إلى عالية أو الفحم المسبق لشواية الفحم., صدر الدجاج يجفف بالمناشف الورقية ويوضع على طبق ويتبل قليلا بالتوابل الإيطالية والفلفل الأسود والخل البلسمي ورشة ملح., ضع الدجاج جانبًا لينقع لمدة 10 دقائق بينما تسخن الشواية مسبقًا., بمجرد أن تصبح الشواية ساخنة ، أضيفي الدجاج واطهيها لمدة 2-3 دقائق لكل جانب أو حتى تفحم قليلاً وتنضج بالكامل. تُرفع عن الشواية وتترك جانباً لترتاح قبل التقطيع., ملعقة وافرد الجبن القريش على الكعك الإنجليزي المحمص. يُغطى التوست المُجهز بشرائح الدجاج وشرائح الخيار والريحان الطازج. الموسم الى الذوق مع الملح والفلفل.",
            Description = "<p> <strong> الطبق </strong> </p>\r\n<p> مستوحاة من شطائر الشاي الإنجليزي التقليدية ، تستخدم هذه النسخة اللطيفة الخيار الكلاسيكي والجبن بينما يتم تعزيزها بالبروتين من خلال صدور الدجاج الخالية من الدهون والمشوية والمتبل. يكمن السر في بناء وجبة ديناميكية ولذيذة في إضافة طبقة من النكهة والقوام. يتناقض الجبن الدسم قليل الدسم بشكل جيد مع شرائح الخيار الطازجة. الدجاج - المتبل بالخل البلسمي والتوابل الإيطالية - هو إضافة لذيذة لهذه الخبز المحمص ، يضفي نكهة حلوة ومالحة ومدخنة رائعة. قم بإقران هذه الوصفة مع أي نوع من أنواع الحساء أو السلطات التي تركز على الخضار للحصول على وجبة متوازنة - مثالية للغداء أو العشاء! </ p>\r\n<p> <strong> الاستعداد للأمام ونصيحة لتوفير الوقت </strong> </p>\r\n<p> لتوفير الوقت أو كخيار مسبق ، لا تتردد في نقع الدجاج طوال الليل. يمكنك أيضًا تتبيل صدور الدجاج وشويها وتبريدها وتقطيعها إلى شرائح لتوفير المزيد من الوقت. </p>",
            Price = 0,
            RatePercentage = 0,
            ShortDescription = "",
            Title = "خيار وجبن كوخ وخبز محمص دجاج مشوي مع الخل البلسمي والأعشاب الإيطالية",
        },
        new HealthyRecipe {
          Id = "67",
            Image = "/user/images/pexels-toni-cuenca-616833.png",
            MealType = "مشروبات",
            PrepTime = 30,
            Calories = 273,
            Total_Carbohydrate = 43,
            Protein = 20,
            Ingredients = " الريحان الطازج,2,غرام\n" + " خيارة,60,غرام\n" +
            " جبن كوخ قليل الدسم ,2,غرام\n" + "  كعكة القمح الكامل الإنجليزية ,20,غرام\n" + " الخل البلسمي ,20,غرام\n" +
            "  البارود الأسود,20,غرام\n" + "التوابل الإيطالية,15,غرام\n" + " صدر دجاج,15,غرام\n" + "زيت الزيتون,10,غرام\n",
            PreparationMethod = "  <ol>\r\n                    <li>اغسلي جميع الخضار والفواكه وقطعيها لقطع متوسطة يسهل وضعها في الخلاط.</li>\r\n                    <li>ضعي الخضار والفواكه في العصارة أو الخلاط الكهربائي واحداً تلو الآخر واخلطيها لمدة أربع دقائق حتى تتجانس المكونات.</li>\r\n                    <li>قدمي العصير مبرداً واحفظيه في الثلاجة إذ يمكن تناوله خلال سبع أيام.</li>\r\n                  \r\n                </ol>",
            Description = " <p class=\"fs-6\">\r\n                            تساعد على تنظيف الجسم من السموم وتخليصه من الأمراض المختلفة، إذ يمكن عمله\r\n                            بطرق عدة باستخدام أنواع مختلفة من الخضار والفواكه، وهذه المشروبات تساعد في\r\n                            حميات إنقاص الوزن وتعزز الصحة العامة، هنا سنقدم طريقة عمل عصير ديتوكس\r\n                        </p>",
            DietaryType = "نباتي",

            Price = 0,
            RatePercentage = 5,
            ShortDescription = "",
            Title = "مشروب الديتوكس الأخضر",
        },

      };
        }
        public static List<HealthyRecipe> GetListHealthyRecipe2()
        {
            return new List<HealthyRecipe>() {

        new HealthyRecipe {
          Id = "61",
            Image = "/Images/HealthyRecipes/1.jpg",
            MealType = "وجبة الإفطار",
            DietaryType = "حيواني",
            PrepTime = 12,
            Calories = 250,
            Total_Carbohydrate = 6,
            Protein = 24,
            Ingredients = "بيضات كاملة,100,غرام\n" + " الديك الرومي المطحون الخالي من الد,60,غرام\n" +
            "توابل التاكو ,2,غرام\n" + " الفلفل الأخضر الجرس,20,غرام\n" + " الفلفل الأحمر,20,غرام\n" +
            " البصل الأحمر,20,غرام\n" + "صلصة,15,غرام\n" + " زبادي يوناني قليل الدسم,15,غرام\n" + " البصل الأخضر,10,غرام\n",
            PreparationMethod = "دهن مقلاة غير لاصقة بقليل من بخاخ تحرير المقلاة وقم بالتسخين المسبق على حرارة متوسطة إلى عالية.\r\nبمجرد أن يسخن , افرم الديك الرومي المطحون في المقلاة ورشي توابل التاكو مع التقليب حتى تمتزج. يُطهى لمدة 3-4 دقائق مع التحريك من حين لآخر أو حتى ينضج تمامًا ويصبح لونه بنيًا جيدًا. بمجرد طهيه , باستخدام ملعقة مثقوبة , أخرج الديك الرومي من المقلاة وضعه جانبًا على طبق.\r\n, دهن المقلاة برفق مرة أخرى وعاد إلى درجة حرارة متوسطة إلى عالية. يُضاف الفلفل والبصل ويُطهى لمدة 3-4 دقائق أو حتى ينضج.\r\n, بمجرد أن تصبح الخضار طرية , أعد الديك الرومي المطحون إلى المقلاة وقلّب المزيج. باستخدام ملعقة مشقوقة , تُرفع الخضار والديك الرومي المفروم من المقلاة , ويُترك جانباً على الطبق , ويُتبل قليلاً بالملح والفلفل حسب الرغبة.\r\n, أعد المقلاة إلى درجة حرارة متوسطة إلى عالية. بمجرد أن يسخن , أضف البيض ولفه لتغطي قاع المقلاة.\r\n,يُغطّى ويُطهى لمدة 2-3 دقائق أو حتى يصبح البيض متماسكًا وينضج تمامًا. أخرج البيضة من المقلاة بحذر وانقلها إلى طبق التقديم.\r\nوزعي البيض بالديك الرومي والخضار والصلصة. دولوب مع الزبادي ورش البصل الأخضر قبل التقديم.",
            Description = "<p> <strong> الطبق </strong> </p>\r\n<p> فاهيتا على الفطور؟ تتحدى! مستوحاة من تلك الفاهيتا الأزيز على غرار المطاعم ، قمنا بإعادة إنشاء نسخة مبسطة مثالية لصباح أيام الأسبوع المزدحمة - كاملة مع خيارات الإعداد المسبق لتوفير المزيد من الوقت. بدلاً من التورتيلا ، ابتكرنا مفهوم الأومليت المفتوح الوجه. الأومليت مليء بالديك الرومي المحمر والمتبل بالإضافة إلى الفلفل والبصل المقلي. القليل من الصلصة والزبادي قليل الدسم والبصل الأخضر يكمل جمالية الفاهيتا. إذا كنت ترغب في جعل فاهيتا الإفطار نباتيًا ، فلا تتردد في استبدال الديك الرومي ببديل اللحم المفروم المفضل لديك (أو التوفو المفتت). </p>\r\n<p> <strong> نصائح للتحضير المسبق / لتوفير الوقت </strong> </p>\r\n<p> يمكن طهي الديك الرومي والخضار (الفلفل والبصل) وتبريدهما قبل يوم أو يومين. أثناء طهي البيض ، قم بإعادة تسخين مزيج الديك الرومي والخضروات في الميكروويف (أو في مقلاة أخرى) ، ثم قم بتجميعها حسب التعليمات. </p>",
            Price = 0,
            RatePercentage = 0,
            ShortDescription = "",
            Title = " فاهيتا أوميليت مفتوح الوجه مع تركيا المطحونة والفلفل والبصل",
        },

        new HealthyRecipe {
          Id = "62",
            Image = "/Images/HealthyRecipes/2.jpg",
            MealType = "طبق جانبي,وجبة غداء",
            DietaryType = "حيواني",
            PrepTime = 15,
            Calories = 269,
            Total_Carbohydrate = 30,
            Protein = 26,
            Ingredients = " الريحان الطازج,2,غرام\n" + " خيارة,60,غرام\n" +
            " جبن كوخ قليل الدسم ,2,غرام\n" + "  كعكة القمح الكامل الإنجليزية ,20,غرام\n" + " الخل البلسمي ,20,غرام\n" +
            "  البارود الأسود,20,غرام\n" + "التوابل الإيطالية,15,غرام\n" + " صدر دجاج,15,غرام\n" + "زيت الزيتون,10,غرام\n",
            PreparationMethod = ", قم بالتسخين المسبق لشواية الغاز إلى درجة حرارة متوسطة إلى عالية أو الفحم المسبق لشواية الفحم., صدر الدجاج يجفف بالمناشف الورقية ويوضع على طبق ويتبل قليلا بالتوابل الإيطالية والفلفل الأسود والخل البلسمي ورشة ملح., ضع الدجاج جانبًا لينقع لمدة 10 دقائق بينما تسخن الشواية مسبقًا., بمجرد أن تصبح الشواية ساخنة ، أضيفي الدجاج واطهيها لمدة 2-3 دقائق لكل جانب أو حتى تفحم قليلاً وتنضج بالكامل. تُرفع عن الشواية وتترك جانباً لترتاح قبل التقطيع., ملعقة وافرد الجبن القريش على الكعك الإنجليزي المحمص. يُغطى التوست المُجهز بشرائح الدجاج وشرائح الخيار والريحان الطازج. الموسم الى الذوق مع الملح والفلفل.",
            Description = "<p> <strong> الطبق </strong> </p>\r\n<p> مستوحاة من شطائر الشاي الإنجليزي التقليدية ، تستخدم هذه النسخة اللطيفة الخيار الكلاسيكي والجبن بينما يتم تعزيزها بالبروتين من خلال صدور الدجاج الخالية من الدهون والمشوية والمتبل. يكمن السر في بناء وجبة ديناميكية ولذيذة في إضافة طبقة من النكهة والقوام. يتناقض الجبن الدسم قليل الدسم بشكل جيد مع شرائح الخيار الطازجة. الدجاج - المتبل بالخل البلسمي والتوابل الإيطالية - هو إضافة لذيذة لهذه الخبز المحمص ، يضفي نكهة حلوة ومالحة ومدخنة رائعة. قم بإقران هذه الوصفة مع أي نوع من أنواع الحساء أو السلطات التي تركز على الخضار للحصول على وجبة متوازنة - مثالية للغداء أو العشاء! </ p>\r\n<p> <strong> الاستعداد للأمام ونصيحة لتوفير الوقت </strong> </p>\r\n<p> لتوفير الوقت أو كخيار مسبق ، لا تتردد في نقع الدجاج طوال الليل. يمكنك أيضًا تتبيل صدور الدجاج وشويها وتبريدها وتقطيعها إلى شرائح لتوفير المزيد من الوقت. </p>",
            Price = 0,
            RatePercentage = 0,
            ShortDescription = "",
            Title = "خيار وجبن كوخ وخبز محمص دجاج مشوي مع الخل البلسمي والأعشاب الإيطالية",
        },

      };
        }
        public static List<Tracking> GetListOfTracking()
        {
            return new List<Tracking>() {
        new Tracking() {
            Id = "1", Iscomplete = true, Exercies_programId = "1", Order_DetailsId = "1"
          },
          new Tracking() {
            Id = "2", Iscomplete = false, Exercies_programId = "12", Order_DetailsId = "1"
          },
          new Tracking() {
            Id = "3", Iscomplete = true, Exercies_programId = "13", Order_DetailsId = "1"
          },

      };
        }

        public static List<Files> GetListFiles()
        {
            return new List<Files>() {

        new Files() {
            Id = "1",
              Path = "/Images/HealthyRecipes/1.jpg",
              HealthyId = "61",
          },
          new Files() {
            Id = "2",
              Path = "/Images/HealthyRecipes/img61.jpg",
              HealthyId = "61",
          },
          new Files() {
            Id = "3",
              Path = "/Images/HealthyRecipes/im61.jpg",
              HealthyId = "61",
          },
          new Files() {
            Id = "4",
              Path = "/Images/HealthyRecipes/2.jpg",
              HealthyId = "62",
          },
          new Files() {
            Id = "5",
              Path = "/Images/HealthyRecipes/img62.jpg",
              HealthyId = "62",
          },
          new Files() {
            Id = "6",
              Path = "/Images/HealthyRecipes/im62.jpg",
              HealthyId = "62",
          }, new Files() {
            Id = "7",
              Path = "/user/images/pexels-toni-cuenca-616833.png",
              HealthyId = "66",
          }, new Files() {
            Id = "8",
              Path = "~/user/images/224347.png",
              HealthyId = "66",
          }, new Files() {
            Id = "9",
              Path = "/user/images/224664.png",
              HealthyId = "66",
          },
          new Files() {
            Id = "10",
              Path = "/user/images/224664.png",
              ServiceId = "23",

          },
          new Files() {
            Id = "11",
              Path = "/user/images/224664.png",
              ServiceId = "23",

          },
          new Files() {
            Id = "12",
              Path = "/Images/Product/Dumbbell3.jfif",
              ServiceId = "22",

          },
          new Files() {
            Id = "13",
              Path = "/user/images/224664.png",
              ServiceId = "22",

          }, new Files() {
            Id = "14",
              Path = "/user/images/224664.png",
              ServiceId = "21",

          },
          new Files() {
            Id = "15",
              Path = "/user/images/224664.png",
              ServiceId = "21",

          },
          new Files() {
            Id = "20", Path = "/Images/Product/LiveupOlympic.jpg", ServiceId = "21"
          },
          new Files() {
            Id = "21", Path = "/Images/Product/Curved.jpg", ServiceId = "23"
          },
          new Files() {
            Id = "24", Path = "/Images/Product/Dumbbell.jfif", ServiceId = "21"
          },
          new Files() {
            Id = "25", Path = "/Images/Product/Dumbbell1.jfif", ServiceId = "21"
          },
          new Files() {
            Id = "26", Path = "/Images/Product/Dumbbell3.jfif", ServiceId = "21"
          },
      };
        }
        public static List<MealPlans> GetListOfMealPlan()
        {
            return new List<MealPlans>() {
        new MealPlans() {
            Id = "1",
              Numsubscribers = 105,
              Length = 1,
              DietaryType = "اكلة اللحوم",
              MealType = "الإفطار والغداء والعشاء والوجبات الخفيفة\r\n",
              AvgRecipeTime = 13,
              Image = "Images/MealPlan/1.jpg",
              BurnEstimate = "50-250",

          },
          new MealPlans() {
            Id = "2",
              Numsubscribers = 105,
              Length = 1,
              DietaryType = "اكلة اللحوم",
              MealType = "الإفطار والغداء والعشاء والوجبات الخفيفة\r\n",
              AvgRecipeTime = 13,
              Image = "Images/MealPlan/2.jpg",

              BurnEstimate = "50-250",

          },
          new MealPlans() {
            Id = "3",
              Numsubscribers = 105,
              Length = 1,
              DietaryType = "اكلة اللحوم",
              MealType = "الإفطار والغداء والعشاء والوجبات الخفيفة\r\n",
              AvgRecipeTime = 20,
              Image = "Images/MealPlan/3.jpg",
              BurnEstimate = "50-250",

          },
          new MealPlans() {
            Id = "4",
              Numsubscribers = 105,
              Length = 1,
              DietaryType = "اكلة اللحوم",
              MealType = "الإفطار والغداء والعشاء والوجبات الخفيفة\r\n",
              AvgRecipeTime = 20,
              Image = "Images/MealPlan/4.jpg",

          },

      };
        }

        public static List<Article> GetListOfArticle()
        {
            return new List<Article>() {
        new Article() {
            Id = "140", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_202.jpg", Title = "فوائد الكركم للجسم",
              Description = "<div class=\"artIntro\">\r\n<h2 class=\"artBrief\"><span style=\"color: rgb(190, 138, 220);\">يُعتبر الكركم من أشهر التوابل التي نستخدمها في حياتنا اليومية، وللكركم العديد من الفوائد المهمة التي تُحسن من صحة العقل، والجسم.</span></h2>\r\n</div>\r\n<div class=\"detailsText\">يُعتبر الكركم من أشهر التوابل التي نستخدمها في حياتنا اليومية، وللكركم العديد من الفوائد المهمة التي تُحسن من صحة العقل، والجسم.<br><br>فوائد الكركم للجسم:<br>إليك أهم<strong>&nbsp;<u><a href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">ا<span style=\"color: rgb(144, 112, 162);\">لفوائد</span></a><span style=\"color: rgb(144, 112, 162);\">&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">التي</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">يحصل</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">عليها</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">جسم</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">الإنسان</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">عند</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">تناول</a>&nbsp;<a style=\"color: rgb(144, 112, 162);\" href=\"https://altmedicine.mawdoo3.com/n/%D8%A7%D9%84%D9%83%D8%B1%D9%83%D9%85-%D9%84%D9%84%D8%AA%D8%AE%D8%B3%D9%8A%D8%B3-%D9%85%D8%B9%D9%84%D9%88%D9%85%D8%A7%D8%AA-%D8%AA%D9%87%D9%85%D9%83\">الكركم</a></span></u></strong><span dir=\"LTR\">:</span><br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مضاد للالتهابات: يعمل الكركم كبديل فعال للأدوية المضادة للالتهاب، حيث يُساعد الكركم على تخفيف الالتهاب، وعلاجه بشكل سريع، كما يخفف الكركم من آثار هذا الالتهاب على الجسم.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; تحسين الذاكرة: يُساعد الكركم على تحسين الذاكرة بشكل كبير، حيث يحتوي الكركم على مواد مضادة للأكسدة، وتُساعد هذه المواد على تنشيط خلايا الدماغ، ومنعها من التلف.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; علاج التهاب المفاصل: يُستخدم الكركم كعلاج فعال لمشكلات المفاصل، والعضلات مثل هشاشة العظام، فهو يقلل من الآثار الجانبية لهشاشة العظام، ويُساعد على منع تقدم هذه المشكلة على مر الزمن.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; الوقاية من مرض السكري: أثبتت الدراسات أن تناول الكركم بشكل مستمر يُساعد على الوقاية من الإصابة بمرض السكري، حيث يعمل الكركم على المُحافظة على مستوى السكر في الدم، كما أنه قادر على علاج مرض السكري في حال الالتزام بتناوله.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; تخفيف أعراض الحيض: يُساعد الكركم على التخفيف من آلام الحيض بشكل فعّال جدًا، حيث يُمكن تناول الكركم مع كوب من الشاي الساخن للتخلص من آلام البطن، والظهر، والمفاصل الناتجة عن الحيض.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مُعالجة الاكتئاب: يُساعد الكركم على التخلص من الحالة المزاجية السيئة التي تنتج عن الاكتئاب، حيث يحتوي الكركم على العديد من العناصر التي تُساعد الجسم على التخلص من الطاقة السلبية.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مُعالجة أمراض السرطان: يُساعد الكركم على إيقاف نمو الخلايا السرطانية عند مرضى السرطان، كما أنه مادة فعّالة جدًا للوقاية من أمراض السرطان التي من الممكن أن تغزو الجسم بأي وقت.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مُعالجة القولون العصبي: أثبتت الدراسات أن الكركم مادة ممتازة للتخفيف من الأعراض المصاحبة للقولون العصبي، وأبرزها آلام البطن المزعجة.<br><br>استخدامات الكركم للبشرة:<br>يُعتبر الكركم فعالًا جدًا لعلاج مشكلات البشرة، وفي ما يلي أبرز فوائد الكركم المتعلقة بالبشرة:<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; يمنح البشرة لمعانًا طبيعيًا: يُساعد الكركم على تصفية البشرة؛ بسبب احتوائه على مواد مضادة للأكسدة، ويمكن صنع أقنعة للوجه عن طريق خلط الكركم مع الزبادي، والعسل، حيث ستظهر النتائج على البشرة بشكل فوري.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مُعالجة الجروح: يُساعد الكركم على تخفيف التهاب الجروح في البشرة، كما يُساعد أيضًا على التئام الجروح بشكل أسرع من استخدام الأدوية.<br>●&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; مُعالجة حب الشباب: يُمكن استخدام الكركم كبديل للأدوية المُتخصصة لعلاج حب الشباب، حيث يُساعد الكركم على التقليل من ظهورها على الوجه، وعلاجها، وعلاج آثارها أيضًا.<br><br>الأعراض الجانبية للكركم:<br>يُعتبر الكركم مفيدًا جدًا، ولكن يجب على الأشخاص الذين يعانون من حساسية اتجاه هذا النوع من التوابل تجنب تناوله، فقد يؤدي تناوله إلى التعرض لحساسية، وطفح جلدي، كما يجب تجنب تناول الكركم بكميات كبيرة جدًا، حيث سيؤدي ذلك إلى إصابة الفرد بالتحسس.</div>"
          },
          new Article() {
            Id = "141", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/3005227.jpg", Title = "أنواع النحافة",
              Description = "<div class=\"artIntro\">\r\n<div class=\"artIntro\">\r\n<h2 class=\"artBrief\" style=\"text-align: center;\"><span style=\"color: rgb(190, 138, 220);\">يأكلون ما يريدون دون أن يزيد وزنهم</span></h2>\r\n</div>\r\n<div class=\"detailsText\">هناك الكثير من النكات عن الأشخاص الذين يأكلن ما يردن دون أن يصبن بالسمنة. لكن تنصح طبيبة الغدد الصماء والتغذية أن مثل هذه النحافة، يجب أن تؤخذ على محمل الجد.<br><br>وفقًا للخبيرة، عادةً ما يتم تفسير النحافة المفرطة بسببين. الأول هو علم وظائف الأعضاء، والثاني هو علم الأمراض.<br><br>في الحالة الأولى،&nbsp;ترجع النحافة&nbsp;مع الشهية الجيدة إلى الحالة الجيدة للميكروبات المعوية أو صغر السن أو نمط الحياة النشط. في الوقت نفسه، بعد 20 عامًا، يمكن للفتيات النحيفات الإصابة بالسمنة إذا لم يتبعن نظاما غذائيا جيدا.<br><br>في الحالة الثانية، تعتبر النحافة من أعراض العديد من الأمراض. يرتبط نقص الوزن بالتسمم الدرقي، والسرطان، ومرض السكري من النوع الأول، وأمراض الجهاز الهضمي، وداء الديدان الطفيلية. يمكن أن يكون سبب النحافة هو العادات السيئة أو فقدان الشهية أو الشره المرضي العصبي<br><br>تنصح الخبيرة&nbsp;بعدم تأجيل زيارة الطبيب&nbsp;في حالة حدوث فقدان سريع للوزن دون سبب واضح. يمكن لطبيب وحده فقط وصف العلاج اللازم.</div>\r\n<h2 class=\"artBrief\">&nbsp;</h2>\r\n</div>"
          },
          new Article() {
            Id = "142", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_20220907211306096.jpg", Title = "5 أخطاء تمنعك من خسارة الوزن",
              Description = "<h2><span style=\"color:#be8adc\">تحمل كمية الزيت التي نستخدمها تأثير خفي على أهدافك المتعلقة بفقدان الوزن بسبب غناه بالسعرات الحرارية.</span></h2>\r\n\r\n<p>قد تكون محاولة إنقاص الوزن بطريقة صحية وطويلة الأمد عملية محبطة في بعض الأحيان لكثير من الأشخاص، وذلك لأن كل فرد لديه احتياجاته الخاصة.</p>\r\n\r\n<p>ولحل هذه المشكلة يجب علينا التعرف على أنفسنا وما تحتاجه أجسامنا، مع إجراء تغييرات صغيرة ولكنها مؤثرة في روتيننا اليومي، لفقدان الوزن بنجاح.</p>\r\n\r\n<p>في هذا الشأن، كشف أخصائيي التغذية عن 5 أنماط من الأكل الشائعة التي قد تمنعك من فقدان الوزن.</p>\r\n\r\n<h3><span style=\"color:#a566c8\">1- الإفراط في تناول الأكل الصحي</span></h3>\r\n\r\n<p>يوصي أخصائيو التغذية بقياس الحصص الغذائية من أجل عدم الإفراط في تناول السعرات الحرارية.</p>\r\n\r\n<p>فتناول الأطعمة الصحية مثل المكسرات والحمص والأفوكادو أمر جيد جدا لصحتك، لكنها تحتوي جميعها على دهون صحية وتحتوي على سعرات حرارية أكثر من الكربوهيدرات أو البروتينات الأخرى.</p>\r\n\r\n<p>كذلك، يعتقد الكثير من الأشخاص الذين يتطلعون إلى إنقاص الوزن، أن هذه الأطعمة مفيدة دون الاكتراث إلى الكمية، لكن هذا ليس صحيحاً فحجم الحصة هو المفتاح عند محاولة إنقاص الوزن.</p>\r\n\r\n<h3><span style=\"color:#a566c8\">2- عدم تناول كمية كافية من البروتين</span></h3>\r\n\r\n<p>لفقدان الوزن عليك بتناول مصادر البروتين مثل صدور الدجاج، أو برغر الديك الرومي، أو السمك، فذلك سيجعلك أقل عرضة لتناول الوجبات الخفيفة غير الصحية أو الأطباق الجانبية المليئة بالسعرات الحرارية العالية والسكر والحبوب المصنعة وما إلى ذلك.</p>\r\n\r\n<h3><span style=\"color:#a566c8\">3- أنت تطبخ بالكثير من الزيت</span></h3>\r\n\r\n<p>تحمل كمية الزيت التي نستخدمها تأثير خفي على أهدافك المتعلقة بفقدان الوزن بسبب غناه بالسعرات الحرارية.</p>\r\n\r\n<p>ويمكنك تقليل تناول الزيت عن طريق قياس المقدار الذي تريد استخدامه، من خلال شراء علبة رذاذ زيت لاستخدامها بدلا من سكب الزيت من زجاجة.</p>\r\n\r\n<p>كما يعد الطهي بدون أي زيت خيارا صحياً رائعاً.</p>\r\n\r\n<h3><span style=\"color:#a566c8\">4 - التباهي بتناول الطعام الغني السعرات الحرارية</span></h3>\r\n\r\n<p>بينما يحتاج الجميع إلى قطعة من الكيك أو بعض من الشيبس من وقت لآخر، فإن الكثير من الناس يبالغون في التباهي بذلك وينتهي بهم الأمر بتناول ما يكفي من السعرات الحرارية لتعويض النقص في السعرات الحرارية التي صنعوها في الأسبوع.</p>\r\n\r\n<p>لذلك يجب عليك الاعتدال وتناول الحبوب الكاملة والبروتينات الخالية من الدهون ومنتجات الألبان والدهون الصحية والفواكه والكثير من الخضروات وعدم الإسراف في تناول الأطعمة الغنية بالسعرات الحرارية.</p>\r\n\r\n<h3><span style=\"color:#a566c8\">5 - اضافة بهارات غير صحية</span></h3>\r\n\r\n<p>اضافة التوابل المفضلة لك إلى الطعام لتعزيز النكهة، يمكن أن يكون خطأ فادحًا يمنعك من فقدان الوزن.</p>\r\n\r\n<p>كما أن إضافة صلصة الشواء أو الكاتشب إلى وجبة غداء أو عشاء يعتبر أمرا غير صحياً، وبدلاً من ذلك استخدم بعض الصلصة &quot;قليلة الدسم&quot; في سلطتك، أو إلى الساندويتش المفضل لك.</p>\r\n"
          },
          new Article() {
            Id = "143", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_205015.jpg", Title = "الأفوكادو للرجيم",
              Description = "<h4>&nbsp;الأفوكادو أو ما يعرف بـكمثرى التمساح؛ فاكهة ذات غلاف املس متعرج وثمرة كريمية الملمس، موطنها أميركا الوسطى، متعددة الاستخدامات وغالبًا ما يتم إعداد عدد من الأطباق المتنوعة بواسطتها، كما وتستخدم شاي أوراق الأفوكادو في نيجيريا علاجًا عشبيًا لارتفاع ضغط الدم.<br />\r\n&nbsp;<br />\r\n<span style=\"color:#a566c8\"><strong>فوائد الأفوكادو:</strong></span><br />\r\n<br />\r\n&nbsp;توصي الإرشادات الغذائية بشكل عام إلى زيادة نسبة استهلاك الخضراوات والفواكه؛ وذلك لتعزيز الصحة والحد من خطر الإصابة بالأمراض، وبشكل خاص فإن الأفوكادو يعمل على تحسين جودة النظام الغذائي، حيث يحتوي على العديد من المصادر الغذائية؛ فهو مصدر غني بالدهون الأحادية غير المشبعة، وبالألياف، وحمض الفوليك، والبوتاسيوم والمغنيسيوم، وعدد متنوع من الفيتامينات:</h4>\r\n\r\n<ul>\r\n\t<li>\r\n\t<h2>تساعد الدهون الصحية على تعزيز قدرة الجسد على امتصاص العناصر الغذائية الرئيسية (العناصر القابلة للذوبان في داخل الدهون)، الأمر الذي يحافظ ويعزز من صحة القلب والبشرة، كما ويساعد على التقليل من خطر الإصابة بمرض السكري النوع الثاني.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>&nbsp;تدعم العناصر الغذائية الأداء العقلي وجهاز المناعة، وتدعم أيضًا المزاج الجيد والشعور بالنشاط.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>يعزز وجود فيتامين&nbsp;B5 وحمض الفوليك والبوتاسيوم والنياسين أداء الجهاز العصبي والأداء العقلي.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>يعمل فيتوسترولس على خفض مستوى الكوليسترول الكلي ومستوى الكوليسترول الضار في الجسم، وذلك عن طريق خفض امتصاصه.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>يعزز البوتاسيوم صحة القلب ويعمل على تنظيم ضغط الدم.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>تعزز المادة الكيميائية المسمى الكاروتينات صحة العين؛ حيث تعمل كل من اللوتين والزياكسانثين كمضادات أكسدة تساهم في حماية العين من أضرار الأشعة فوق البنفسجية.</h2>\r\n\t</li>\r\n\t<li>\r\n\t<h2>أخيرًا يعد الأفوكادو أحد الأغذية الملائمة والداعمة للحوامل لاحتوائه على حمض الفوليك، كما أنه مناسب للأطفال إذ يعمل على تعزيز النمو والتطور الجسدي والعقلي.</h2>\r\n\t</li>\r\n</ul>\r\n\r\n<h2>&nbsp;<br />\r\n&nbsp;<br />\r\n<strong><span style=\"color:#a566c8\">&nbsp;الأفوكادو للرجيم</span></strong><br />\r\n&nbsp;تظهر الدراسات على وجود توافق إيجابي بين&nbsp;<u><a href=\"https://nutrition.mawdoo3.com/m/%D8%A7%D9%84%D8%A3%D9%81%D9%88%D9%83%D8%A7%D8%AF%D9%88-%D9%81%D9%8A-%D8%AD%D8%B1%D9%82-%D8%A7%D9%84%D8%AF%D9%87%D9%88%D9%86-%D9%87%D9%84-%D9%87%D9%88-%D9%85%D9%81%D9%8A%D8%AF-%D9%81%D9%8A-%D8%B0%D9%84%D9%83\">استهلاك</a>&nbsp;<a href=\"https://nutrition.mawdoo3.com/m/%D8%A7%D9%84%D8%A3%D9%81%D9%88%D9%83%D8%A7%D8%AF%D9%88-%D9%81%D9%8A-%D8%AD%D8%B1%D9%82-%D8%A7%D9%84%D8%AF%D9%87%D9%88%D9%86-%D9%87%D9%84-%D9%87%D9%88-%D9%85%D9%81%D9%8A%D8%AF-%D9%81%D9%8A-%D8%B0%D9%84%D9%83\">الأفوكادو</a>&nbsp;<a href=\"https://nutrition.mawdoo3.com/m/%D8%A7%D9%84%D8%A3%D9%81%D9%88%D9%83%D8%A7%D8%AF%D9%88-%D9%81%D9%8A-%D8%AD%D8%B1%D9%82-%D8%A7%D9%84%D8%AF%D9%87%D9%88%D9%86-%D9%87%D9%84-%D9%87%D9%88-%D9%85%D9%81%D9%8A%D8%AF-%D9%81%D9%8A-%D8%B0%D9%84%D9%83\">والرجيم</a></u>&nbsp;وجودة النظام الغذائي؛ حيث أظهرت النتائج انخفاض في مؤشر كتلة الجسد ووزن الجسد وقياسات محيط الخصر، كما ساعد دمج الأفوكادو في النظام الغذائي على الحد من خطر الإصابة بمتلازمة التمثيل الغذائي (ارتفاع ضغط الدم، وارتفاع نسبة السكر والدهون الثلاثية في الدم، والسمنة).<br />\r\n<br />\r\n&nbsp;يعد الأفوكادو أحد المكونات الأساسية في عدد من الأنظمة الغذائية الشائعة؛ مثل النظام الغذائي الخاصة بالنباتيين (لاحتوائها على نسب عالية من الدهون)؛ حيث يستخدم كبديل عن اللحوم، والأنظمة الغذائية منخفضة الكوليسترول، والأنظمة الغذائية منخفضة الكربوهيدرات الملائمة لمرضى السكري، كما ويستخدم في الأنظمة الغذائية الخالية من المشتقات الحليبية.<br />\r\n<br />\r\n&nbsp;&nbsp;تحتوي ثمرة الأفوكادو المتوسطة في الحجم على ما يقارب 240 سعرة حرارية؛ 22 جرام من الدهون، و13 جرام من الكربوهيدرات، و10 جرام ألياف، و3 جرامات من البروتين، بالإضافة إلى 11 مليجرام من الصوديوم، حيث من الممكن دمج الأفوكادو بالنظام الغذائي بعدد واسع من الأشكال؛ في الصلصات؛ مثل صلصة الأفوكادو مع السمك، في السلطات؛ مثل سلطة الكينوا والمانجو، ومع المخبوزات، أيضًا مع السندويتشات والعصائر.<br />\r\n&nbsp;&nbsp;<br />\r\n<span style=\"font-size:22px\"><span style=\"color:#a566c8\"><strong>المراجع</strong></span></span><br />\r\n1.<u><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3545982/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3545982/</a></u><br />\r\n2.&nbsp;<u><a href=\"https://australianavocados.com.au/health-nutrition/\">https://australianavocados.com.au/health-nutrition/</a></u><br />\r\n3.<u><a href=\"https://www.hsph.harvard.edu/nutritionsource/avocados/\">https://www.hsph.harvard.edu/nutritionsource/avocados/</a></u><br />\r\n4.<u><a href=\"https://utswmed.org/medblog/avocado-a-day/\">https://utswmed.org/medblog/avocado-a-day/</a></u></h2>\r\n"
          },
          new Article() {
            Id = "144", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/0f6d33c30a.png", Title = "دراسة تحذّر من خطر صحي يرتبط بالجلوس لفترة طويلة!",
              Description = "<p>حذرت دراسة جديدة من الآثار السلبية على الصحة العقلية جراء الجلوس فترة طويلة ، حتى أنه يفوق فوائد ممارسة الرياضة بانتظام، وفقا للباحثين الذين درسوا تأثير &quot;كوفيد-19&quot; على الناس.</p>\r\n\r\n<p>وكان السماح بساعة من التمارين في الهواء الطلق يوميا جزءا أساسيا من استراتيجية حكومة المملكة المتحدة عندما بدأ الإغلاق الوطني الأول في مارس 2020.</p>\r\n\r\n<p>ومع ذلك، وجدت الدراسة أن العديد من الأشخاص يقضون أكثر من ثماني ساعات في اليوم جالسين، إما بسبب العمل من المنزل أو في نهاية المطاف أثناء الإجازة.</p>\r\n\r\n<p>وقال الباحثون إن هذا بدوره تسبب في آثار ضارة بصحتهم العقلية.</p>\r\n\r\n<p>وحتى الأشخاص الذين يمارسون نشاطا بدنيا معتدلا أو قويا لمدة 150 دقيقة أسبوعيا، تعرضوا لتأثير سلبي على صحتهم العقلية، ما يشير إلى أن المزيد من التمارين كانت مطلوبة لموازنة نمط حياتهم المستقرة المتزايدة.</p>\r\n\r\n<p>إحدى&nbsp;معدي الدراسة: &quot;على الرغم من أن عيّنتنا المكونة من حوالي 300 شخص كانت نشطة للغاية، إلا أنهم كانوا يجلسون لفترات أطول مع جلوس أكثر من 50% لأكثر من ثماني ساعات في اليوم. وأظهرت دراسات أخرى أنه إذا جلست لمدة تزيد عن ثماني ساعات، فمن أجل تعويض التأثير السلبي للسلوك المستقر على نتائج الصحة البدنية، فأنت بحاجة إلى ممارسة الرياضة لفترة أطول&quot;.</p>\r\n\r\n<p>وأضافت: &quot;إن تقليل وقت الجلوس له تأثير إيجابي على الصحة العقلية. نوصي أنه بالإضافة إلى زيادة النشاط البدني، يجب أن تشجع الصحة العامة على تقليل وقت الجلوس لفوائد الصحة العقلية&quot;.</p>\r\n\r\n<p>وأوضحت أن أوقات الفراغ والبستنة هي أنشطة تساعد جسديا وعقليا.</p>\r\n"
          },
          new Article() {
            Id = "145", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/ima5801.png", Title = "هل النوم مهم لإنقاص الوزن",
              Description = "<p>تتمثل الخطوة الأولى لفقدان الوزن أثناء النوم في الحصول على قسط كاف منه. ويقول الدكتور &quot;ريتشارد ك. بوجان&quot; الأستاذ في كلية الطب بجامعة ساوث كارولينا وباحث النوم، &quot;النوم في حد ذاته يمكن أن يساعد في إنقاص الوزن. النوم ضروري لهرمون الجسم الطبيعي ووظيفة الجهاز المناعي&quot;.</p>\r\n\r\n<p>يحتاج البشر إلى 6-8 ساعات من النوم المتواصل يومياً ، إذا لم تتمكن من النوم لمدة 8 ساعات ، يفشل الجسم على حرق الدهون وأنه بدون الحصول على قسط كاف من النوم ، يؤدي لزيادة مستوى هرمون الجريلين وهو هرمون الجوع.</p>\r\n\r\n<p>لذا &hellip;</p>\r\n\r\n<p>تم إضافة نصائح النوم إلى برامج الوقاية من السمنة وفقدان الوزن.</p>\r\n\r\n<p>أيضاً الحرمان من النوم يؤدي إلى إختلالات هرمونية كبيرة ، التي تؤدي لزيادة الوزن غير المرغوب فيه</p>\r\n\r\n<p>يمكن أن يؤدي الحرمان من النوم إلى زيادة شهيتك نتيجة لزيادة نسب الجريلين واللبتين ما يزيد من شهيتك وتناول السعرات الحرارية، عندما تكون محرومًا من النوم، فإنك تقوم بإختيارات غذائية غير صحية.</p>\r\n\r\n<p>إذا كنت تحاول إنقاص وزنك ، فعليك أولاً محاولة تعديل عادات نومك اتبع جدولًا مناسبًا للنوم كل ليلة أذهب إلى الفراش في الوقت المحدد، وإستيقظ في الوقت المحدد حتى في عطلات نهاية الأسبوع.</p>\r\n\r\n<p>الذين ينامون لمدة أطول بساعة واحدة، يوميا&nbsp; يستهلكون 300 سعراً حرارياً&nbsp;</p>\r\n\r\n<p>وإن الإبتعاد عن شاشات التلفزيونات والهواتف كان عاملاً مشتركاً بين أولئك الذين ينامون لمدة طويلة.</p>\r\n\r\n<p>إذا تم الحفاظ على عادات النوم الصحية لفترة أطول، فسيؤدي ذلك إلى فقدان الوزن مع مرور الوقت.</p>\r\n\r\n<p>وأن عدم الحصول على قسط كافٍ من النوم يؤثر على تنظيم الشهية ويزيد من خطر زيادة الوزن.</p>\r\n\r\n<p>تؤثر دورة نومنا على فقدان الوزن بأكثر من طريقة، يمكن أن يؤدي النوم المريح في الليل إلى تسريع عملية الأيض ويمكن أن يساعدك على إنقاص الوزن.</p>\r\n\r\n<p>يمكن أن تؤدي قلة النوم إلى تقليل معدل الأيض أثناء الراحة، والذي يشار إليه على أنه عدد السعرات الحرارية التي يحرقها جسمك عندما تكون في حالة راحة.</p>\r\n\r\n<p>فالأشخاص الذين لا يحصلون على قسط كافٍ من النوم في الليل يأكلون كثيرًا في اليوم التالي أكثر من المعتاد، ذلك لأن النوم السيئ ليلاً يمكن أن يزيد من الرغبة في تناول الأطعمة السريعة، أيضاً الأشخاص الذين لم يحصلوا على نوم جيد في الليل يتحركون أيضًا بشكل أقل ويحرقون سعرات حرارية أقل على مدار اليوم.</p>\r\n\r\n<p>أيضاً الحرمان من النوم يؤدي إلى الإكتئاب ، الذي بدوره يؤدي إلى الشراهة عند تناول الطعام ، حتى لو كنت لا تأكل كثيراً.</p>\r\n\r\n<p>أخيراً فإن أفضل وسيلة لإنقاص الوزن هو التمسك بالدخول إلى نظام غذائي صحي ، وبطبيعة الحال ليلة نوم جيدة</p>\r\n"
          }, new Article() {
            Id = "146", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_202502838.jpg", Title = "75 دقيقة مشي تقلل خطر الإصابة بالاكتئاب بنسبة 25%",
              Description = "<h2><span style=\"color:#a566c8\">تساعد التمارين الرياضية في علاج الاكتئاب لأنها تحفز إفراز مادة الإندورفين</span></h2>\r\n\r\n<p>توصلت دراسة بريطانية جديدة شارك فيها 190 ألف شخص، إلى أن المشي بوتيرة سريعة لمدة 75 دقيقة فقط كل أسبوع يقلل من خطر الإصابة بالاكتئاب بنسبة 25%.<br />\r\n<br />\r\nو أن منظمة الصحة العالمية توصي الجميع بضرورة ممارسة الرياضة لمدة ساعتين ونصف الساعة على الأقل كل سبعة أيام.<br />\r\n<br />\r\nلكن باحثين&nbsp; وجدوا أن البالغين الذين مارسوا رياضة المشي بنصف الجرعة الموصى بها كانوا أقل عرضة للإصابة بالاكتئاب بمقدار 20%، في حين أن أولئك الذين مارسوا الرياضة لمدة ساعتين ونصف الساعة على الأقل أسبوعياً تقل لديهم مخاطر الإصابة بنسبة 25%.<br />\r\n<br />\r\nفائدة كبيرة<br />\r\n<br />\r\nوأكد العلماء أن نتائج البحث تشير إلى أنه حتى قدر ضئيل من التمارين يمكن أن تكون له &laquo;فائدة كبيرة&raquo; للصحة العقلية للشخص.<br />\r\n<br />\r\nوتساعد التمارين الرياضية في علاج الاكتئاب لأنها تحفز إفراز مادة الإندورفين -وهي مواد كيميائية تساعد على الشعور بالرضا- وتحسن إدراك صورة الجسم، على حد قول الباحثين.<br />\r\n<br />\r\nوتشير التقديرات إلى أن واحداً من كل خمسة أمريكيين بالغين -أو 40 مليون شخص- يعانون من الاكتئاب الذي يصيبهم بالتعاسة واليأس.<br />\r\n<br />\r\nواقترحت بعض الدراسات أن النشاط البدني يمكن أن يساعد في منع الاكتئاب، وقد يكون فعالًا مثل الأدوية المضادة للاكتئاب.<br />\r\n<br />\r\nوحلل الباحثون بيانات 190 ألف بالغ، بما في ذلك 28000 مصابين بالاكتئاب، في 15 دراسة سابقة في كل من الولايات المتحدة وأستراليا واليابان والهند والمكسيك وروسيا ودول أوروبية.<br />\r\n<br />\r\nوأظهرت النتائج انخفاضاً سريعاً في معدلات الاكتئاب حتى في مستويات النشاط المنخفض.<br />\r\n<br />\r\nوقال الباحثون إنه من المرجح أن &laquo;أكثر من آلية&raquo; أثارتها التمارين أدت إلى انخفاض معدلات الاكتئاب.<br />\r\n<br />\r\nواقترحوا أن التمارين الرياضية قد تخفف الأعراض لأنها تحفز إفراز الإندورفين في الدماغ، مما يعزز الشعور بالراحة.<br />\r\n<br />\r\nويمكن أن تحسن أيضاً إدراك الشخص لذاته وثقته بنفسه، وصورة جسده وتشجع على المزيد من التواصل الاجتماعي.<br />\r\n<br />\r\n<span style=\"font-size:16px\"><span style=\"color:#a566c8\"><strong>كيف تقلل التمارين من خطر الاكتئاب؟</strong></span></span><br />\r\n<br />\r\nالعمليات البيولوجية: التمارين الرياضية تحفز إفراز الإندورفين، أو المواد الكيميائية التي تساعد على تحسين الحالة المزاجية في الدماغ.<br />\r\n<br />\r\n&nbsp;البدينات أكثر عرضة لإصابات العظام<br />\r\n<br />\r\nالمظهر: يمكن أن يعزز التمرين كثيراً الشعور بإيجابية وثقة أكبر تجاه الجسد.<br />\r\n<br />\r\nالتفاعلات الاجتماعية: تساعد بعض التمارين في وجود وخلق مزيد من التفاعل والتواصل الإيجابي مع الآخرين.<br />\r\n<br />\r\nالدماغ: يمكن أن تؤدي أيضاً إلى نمو منطقة الدماغ التي تنظم الحالة المزاجية بشكل أكبر، مما يحسن الروابط العصبية، ويرفع الروح المعنوية ويساعد في تخفيف الاكتئاب.</p>\r\n"
          },
          new Article() {
            Id = "147", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/im03674.jpg", Title = "4 أطعمة يجب الابتعاد عنها في رمضان\r\n",
              Description = "<h2><span style=\"color:#a566c8\"><strong>احتمال تسببها في جفاف الجسم من خلال قدرتها على امتصاص السوائل التي تدخل إليه بكميات محدودة طوال فترة الصيام.</strong></span></h2>\r\n\r\n<p><strong>ينصح الأطباء الصائم في رمضان بالاعتناء بنظامه الغذائي أكثر من الأيام العادية، إذ إن اختلال النظام الغذائي خلال شهر رمضان المبارك واقتصاره على وجبتي الإفطار والسحور قد يشعر الجسم بشيء من الانزعاج، تزيد حدته إذا ما تناول الصائم أنواعاً محددة من الأطباق والحلويات.</strong></p>\r\n\r\n<p><strong>لذا، ينصح بتجنب بعض الأطعمة والابتعاد عنها خلال الشهر الفضيل، ومنها على سبيل المثال لا الحصر:</strong></p>\r\n\r\n<ul>\r\n\t<li><strong>- المقالي والأطعمة المدهنة على غرار البطاطس المقلية والسمبوسك، لاحتوائها على نسبة عالية جداً من السعرات الحرارية وخلوها من المواد الغذائية، فتناولها بكثرة قد يتسبب في اختلال توازن النظام الغذائي، ويزيد بالتالي من وطأة التعب والإرهاق الناتجين عن الصيام في رمضان.</strong></li>\r\n\t<li><strong>- الأطعمة التي تحوي كميات عالية من الملح مثال المخللات، ومرد ذلك احتمال تسببها في جفاف الجسم من خلال قدرتها على امتصاص السوائل التي تدخل إليه بكميات محدودة طوال فترة الصيام.</strong></li>\r\n\t<li><strong>- الأطعمة التي بها كميات كبيرة من السكر، بوصفها مصدراً غنياً بالسعرات الحرارية لكن فقيراً بالقيم الغذائية، فصحيح أن هذه الأطباق تمد الجسم بالطاقة الفورية، ولكن هذه الطاقة لا تدوم طويلاً وقد تذهب في أي لحظة.</strong></li>\r\n\t<li><strong>- الأطعمة التي تحتوي على الشوكولاتة أو أي مصدر آخر للكافيين المدر للبول، فكثرة هذه المادة في الجسم قد تفقده السوائل والأملاح والمعادن القيمة التي يحتاج إليها خلال النهار.</strong></li>\r\n</ul>\r\n"
          },
          new Article() {
            Id = "148", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_20230202235025276.jpg", Title = "كيف نحارب الجوع في الشتاء؟",
              Description = "<p style=\"text-align:right\"><span style=\"color:#a566c8\"><span style=\"font-size:18px\"><strong>كي تسيطر علي إحساسك بالجوع في فصل الشتاء، عليكِ أن تتعرف على أسباب زيادة الوزن في الشتاء، حتى تتجنبها وتتمكن من الحفاظ على أن يظل قوامكِ مثاليًّا في هذا الفصل من العام.</strong></span></span></p>\r\n\r\n<p style=\"text-align:right\">في دراسة حديثة أوضحت أن 53 بالمائة من الأمهات تعرضن لزيادة في الوزن خلال فصل الشتاء الماضي من أربع إلى عشر كيلوجرامات، نتيجة لعدد من الأسباب، أهمها:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#006400\">إنخفاض درجة الحرارة</span></li>\r\n\t<li style=\"text-align: right;\">عند إنخفاض درجة الحرارة في فصل الشتاء، والشعور بالبرودة الشديدة، يزيد من الشعور بالجوع، الأمر الذي يؤدي إلى تناول الطعام بكثرة، خصوصًا الوجبات التي تحتوي على الدهون والسكريات. كذلك فإن برودة الجو تزيد من الشعور بالكسل، وعدم ممارسة التمارين الرياضية، ما يؤدي إلى زيادة الوزن.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">غياب الشمس</span>&nbsp;غياب ضوء الشمس لفترة طويلة خلال ساعات النهار في فصل الشتاء، يؤثر بشكل كبير على النظام الهرموني في الجسم، مما يؤدي إلى الرغبة في تناول الكثير من الأطعمة.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">إكتئاب الشتاء</span>&nbsp; مع قدوم فصل الشتاء، يشعر كثير من الناس بالإكتئاب الموسمي، ويتسبب ذلك في الرغبة في تناول المزيد من الأطعمة</li>\r\n\t<li style=\"text-align: right;\">&nbsp;</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">زيادة عدد ساعات النوم في فصل الشتاء</span>&nbsp; يميل الناس إلى النوم عدد ساعات أكثر، ما يؤثر على معدلات حرق السعرات الحرارية في الجسم، فيقل معدل الحرق ويزداد الوزن.</li>\r\n</ul>\r\n\r\n<p style=\"text-align:right\"><strong>ولأن جميعنا في الشتاء نشعر بالجوع في أيام الشتاء بشكل أكبر بسبب الجو البارد، فيدفعك جسمكِ لا شعوريًّا لطلب ما يمده بالدفء من طعام أو شراب، ولكن تكمن المشكلة في أن جميع الأطعمة الباعثة على الدفء تكون مليئة بالسعرات الحرارية، وهو ما قد يسبب لكِ القلق والخوف من إكتساب المزيد من الكيلوجرامات، في هذا المقال نخبركِ بطرق السيطرة على الجوع في فصل الشتاء، كل ما عليك هو إتباع هذه النصائح الآتية:</strong></p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\">احرص على تناول الأطعمة والمشروبات قليلة السعرات الحرارية، مثل: البطاطا الحلوة وشوربة العدس والقرفة والذرة والترمس، فهي تمدكِ بالدف وتشعركِ بالشبع.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الخضروات والفواكه مثل البروكلي والملفوف والخضروات الورقية كالسبانخ والجرجير اأيضا الرمان والتفاح والكمثري، على شكل طبق سلطة أو في صورتها الكاملة.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الأسماك الغنية بالأوميجا 3، مثل: السردين والماكريل والتونة، فهي قليلة السعرات الحرارية، ومليئة بالمواد المضادة للأكسدة.</li>\r\n\t<li style=\"text-align: right;\">تناول منتجات الألبان سواء كانت حليبًا أو لبن رائب أو زبادي أو جبن قريش، وتجنب تناول المنتجات الدسمة، مثل: الجبن الشيدر والرومي... وغيرهما.</li>\r\n\t<li style=\"text-align: right;\">أكثر من تناول الأطعمة المليئة بالألياف، مثل: الخس والبقوليات، والحبوب مثل: القمح والشعير والشوفان.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول المخبوزات المصنوعة من الدقيق الأسمر.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المشروبات الدافئة كالقهوة والكمون والكركم والشاي الأخضر وحاول أن تقلل من السكريات الأولية البسيطة كالعصائر والحلويات.</li>\r\n\t<li style=\"text-align: right;\">تناول المكسرات غير المحمصة، فهي مفيدة جدًّا وقليلة السعرات، ولكن احرص على أن تكون غير مملحة أيضًا.</li>\r\n\t<li style=\"text-align: right;\">مارس التمارين الرياضية بشكل يومي.</li>\r\n\t<li style=\"text-align: right;\">تناول الأطعمة والمشروبات الساخنة، وخاصة أنواع الحساء المختلفة، واختار الأنواع قليلة السعرات، مثل: شوربة الشوفان والخضار والعدس والكرنب.</li>\r\n\t<li style=\"text-align: right;\">احصل على وجبة متوسطة كل ثلاث إلى أربع ساعات، فالشعور بالجوع يجعلك نهمة جدًّا، ما يسبب لكِ زيادة كبيرة في الوزن</li>\r\n\t<li style=\"text-align: right;\">احرص على تناول وجبتين رئيسيتين في اليوم، هما الإفطار والغداء، مع ثلاث وجبات بينية خفيفة.</li>\r\n\t<li style=\"text-align: right;\">ارتد ملابس مناسبة لحرارة الجو، حتى لا تشعر بشدة البرد، فيدفعك هذا لتناول الكثير من الطعام.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المياه، واحتمل التردد كثيرًا على دورة المياه، فهذا أفضل من زيادة الوزن، كما أنه يساعد كليتيكِ على إخراج السموم والأملاح الزائدة من جسمك في فصل الشتاء.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">أخيرا&nbsp; تجنب زيادة الوزن في الشتاء و، ابتعد عن كل مسببات زيادة الوزن، واتبع طرق السيطرة على الجوع في فصل الشتاء، حتى تحافظ على قوامكِ ولا يزداد وزنكِ.</li>\r\n\t<li style=\"text-align: right;\">حافظ على صحتك ولا تجعل برد الشتاء يكون هو محرك الجوع لديك، في الشتاء يفقد جسمك العديد من السعرات في الحفاظ على التدفئة ولكن ذلك ليس السبب في شعورك بالجوع الدائم.</li>\r\n</ul>\r\n"
          },
          new Article() {
            Id = "149", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/2NM.jpg", Title = "5 أطعمة سوداء يجب أن تدمجها في نظامك الغذائي",
              Description = "Online HTML Editor\r\npowered by CKEditor\r\n\r\nOnline HTML editor user guideReal-time collaboration editor user guide\r\nOnline HTML Editor\r\nReal-time collaboration editor\r\n\r\nSwitch to WYSIWYG editor\r\n<p style=\"text-align:right\"><span style=\"color:#a566c8\"><span style=\"font-size:18px\"><strong>كي تسيطر علي إحساسك بالجوع في فصل الشتاء، عليكِ أن تتعرف على أسباب زيادة الوزن في الشتاء، حتى تتجنبها وتتمكن من الحفاظ على أن يظل قوامكِ مثاليًّا في هذا الفصل من العام.</strong></span></span></p>\r\n\r\n<p style=\"text-align:right\">في دراسة حديثة أوضحت أن 53 بالمائة من الأمهات تعرضن لزيادة في الوزن خلال فصل الشتاء الماضي من أربع إلى عشر كيلوجرامات، نتيجة لعدد من الأسباب، أهمها:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#006400\">إنخفاض درجة الحرارة</span></li>\r\n\t<li style=\"text-align: right;\">عند إنخفاض درجة الحرارة في فصل الشتاء، والشعور بالبرودة الشديدة، يزيد من الشعور بالجوع، الأمر الذي يؤدي إلى تناول الطعام بكثرة، خصوصًا الوجبات التي تحتوي على الدهون والسكريات. كذلك فإن برودة الجو تزيد من الشعور بالكسل، وعدم ممارسة التمارين الرياضية، ما يؤدي إلى زيادة الوزن.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">غياب الشمس</span>&nbsp;غياب ضوء الشمس لفترة طويلة خلال ساعات النهار في فصل الشتاء، يؤثر بشكل كبير على النظام الهرموني في الجسم، مما يؤدي إلى الرغبة في تناول الكثير من الأطعمة.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">إكتئاب الشتاء</span>&nbsp; مع قدوم فصل الشتاء، يشعر كثير من الناس بالإكتئاب الموسمي، ويتسبب ذلك في الرغبة في تناول المزيد من الأطعمة</li>\r\n\t<li style=\"text-align: right;\">&nbsp;</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">زيادة عدد ساعات النوم في فصل الشتاء</span>&nbsp; يميل الناس إلى النوم عدد ساعات أكثر، ما يؤثر على معدلات حرق السعرات الحرارية في الجسم، فيقل معدل الحرق ويزداد الوزن.</li>\r\n</ul>\r\n\r\n<p style=\"text-align:right\"><strong>ولأن جميعنا في الشتاء نشعر بالجوع في أيام الشتاء بشكل أكبر بسبب الجو البارد، فيدفعك جسمكِ لا شعوريًّا لطلب ما يمده بالدفء من طعام أو شراب، ولكن تكمن المشكلة في أن جميع الأطعمة الباعثة على الدفء تكون مليئة بالسعرات الحرارية، وهو ما قد يسبب لكِ القلق والخوف من إكتساب المزيد من الكيلوجرامات، في هذا المقال نخبركِ بطرق السيطرة على الجوع في فصل الشتاء، كل ما عليك هو إتباع هذه النصائح الآتية:</strong></p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\">احرص على تناول الأطعمة والمشروبات قليلة السعرات الحرارية، مثل: البطاطا الحلوة وشوربة العدس والقرفة والذرة والترمس، فهي تمدكِ بالدف وتشعركِ بالشبع.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الخضروات والفواكه مثل البروكلي والملفوف والخضروات الورقية كالسبانخ والجرجير اأيضا الرمان والتفاح والكمثري، على شكل طبق سلطة أو في صورتها الكاملة.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الأسماك الغنية بالأوميجا 3، مثل: السردين والماكريل والتونة، فهي قليلة السعرات الحرارية، ومليئة بالمواد المضادة للأكسدة.</li>\r\n\t<li style=\"text-align: right;\">تناول منتجات الألبان سواء كانت حليبًا أو لبن رائب أو زبادي أو جبن قريش، وتجنب تناول المنتجات الدسمة، مثل: الجبن الشيدر والرومي... وغيرهما.</li>\r\n\t<li style=\"text-align: right;\">أكثر من تناول الأطعمة المليئة بالألياف، مثل: الخس والبقوليات، والحبوب مثل: القمح والشعير والشوفان.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول المخبوزات المصنوعة من الدقيق الأسمر.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المشروبات الدافئة كالقهوة والكمون والكركم والشاي الأخضر وحاول أن تقلل من السكريات الأولية البسيطة كالعصائر والحلويات.</li>\r\n\t<li style=\"text-align: right;\">تناول المكسرات غير المحمصة، فهي مفيدة جدًّا وقليلة السعرات، ولكن احرص على أن تكون غير مملحة أيضًا.</li>\r\n\t<li style=\"text-align: right;\">مارس التمارين الرياضية بشكل يومي.</li>\r\n\t<li style=\"text-align: right;\">تناول الأطعمة والمشروبات الساخنة، وخاصة أنواع الحساء المختلفة، واختار الأنواع قليلة السعرات، مثل: شوربة الشوفان والخضار والعدس والكرنب.</li>\r\n\t<li style=\"text-align: right;\">احصل على وجبة متوسطة كل ثلاث إلى أربع ساعات، فالشعور بالجوع يجعلك نهمة جدًّا، ما يسبب لكِ زيادة كبيرة في الوزن</li>\r\n\t<li style=\"text-align: right;\">احرص على تناول وجبتين رئيسيتين في اليوم، هما الإفطار والغداء، مع ثلاث وجبات بينية خفيفة.</li>\r\n\t<li style=\"text-align: right;\">ارتد ملابس مناسبة لحرارة الجو، حتى لا تشعر بشدة البرد، فيدفعك هذا لتناول الكثير من الطعام.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المياه، واحتمل التردد كثيرًا على دورة المياه، فهذا أفضل من زيادة الوزن، كما أنه يساعد كليتيكِ على إخراج السموم والأملاح الزائدة من جسمك في فصل الشتاء.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">أخيرا&nbsp; تجنب زيادة الوزن في الشتاء و، ابتعد عن كل مسببات زيادة الوزن، واتبع طرق السيطرة على الجوع في فصل الشتاء، حتى تحافظ على قوامكِ ولا يزداد وزنكِ.</li>\r\n\t<li style=\"text-align: right;\">حافظ على صحتك ولا تجعل برد الشتاء يكون هو محرك الجوع لديك، في الشتاء يفقد جسمك العديد من السعرات في الحفاظ على التدفئة ولكن ذلك ليس السبب في شعورك بالجوع الدائم.</li>\r\n</ul>\r\n\r\n1\r\n<p style=\"text-align:right\"><span style=\"font-size:19.2px\"><span style=\"color:#0f1944\"><span style=\"font-family:bodyFont\"><span style=\"background-color:#fbfbfb\">تنتشر الأطعمة ذات اللون الأسود على الإنترنت بسبب لونها المثير للاهتمام وأيضًا لأنها مليئة بالعناصر الغذائية التي يمكن أن تساعدنا في مكافحة أمراض مثل السكري والسرطان والنوبات القلبية.</span></span></span></span><br />\r\n2\r\n<br />\r\n3\r\n<span style=\"font-size:19.2px\"><span style=\"color:#0f1944\"><span style=\"font-family:bodyFont\"><span style=\"background-color:#fbfbfb\">إليك بعض الأطعمة السوداء التي يجب عليك تناولها ومحاولة دمجها في نظامك الغذائي :</span></span></span></span><br />\r\n4\r\n<br />\r\n5\r\n<span style=\"font-size:18px\"><span style=\"color:#a566c8\"><span style=\"font-family:bodyFont\"><span style=\"background-color:#fbfbfb\">التين الأسود</span></span></span></span><br />\r\n6\r\nالتين الأسود هو فاكهة حلوة ولذيذة وطازج، وهو مصدر غني للبوتاسيوم ويحتوي على نسبة عالية جدًا من الألياف التي تمكن من الهضم الجيد. ومن المعروف أيضًا أن هذا التين يساعدنا في إنقاص الوزن. كما يتكون التين الأسود من مكونات قد تساعد أجسامنا على محاربة الخلايا السرطانية. يمكن أن يقلل هذا التين أيضًا من ضغط الدم لدينا ويساعدنا في معالجة ارتفاع ضغط الدم.<br />\r\n7\r\n<br />\r\n8\r\n<span style=\"font-size:18px\"><span style=\"color:#a566c8\">التوت الأسود</span></span><br />\r\n9\r\nيمكن أن يكون هذا التوت منافساً كبيراً لأنواع التوت الأخرى مثل الفراولة والعنب البري عندما يتعلق الأمر بالفوائد الصحية. من المعروف أنه يعزز صحة القلب لأنه يقلل الالتهاب ويعزز مناعتنا. يجب تناول هذه الفاكهة من قبل النساء اللواتي لديهن مشاكل في تدفق الدورة الشهرية أو حدوثها بشكل غير منتظم. يعتبر التوت الأسود أيضًا أحد الأطعمة الغنية بمضادات الأكسدة ويمكنك استخدامه في العصائر أو الحلويات أو السلطات أو الفطائر.<br />\r\n10\r\n<br />\r\n11\r\n<span style=\"font-size:18px\"><span style=\"color:#a566c8\">بذور السمسم الأسود</span></span><br />\r\n12\r\nتزرع بذور السمسم الأسود في الغالب في آسيا وهي غنية جدًا بالمعادن الكبيرة مثل الكالسيوم والمغنيسيوم التي تساعد في تحسين صحة القلب والأوعية الدموية وارتفاع ضغط الدم. ينظم الحديد والنحاس والمنغنيز في هذه البذور دوران الأكسجين ويبقي معدلات التمثيل الغذائي لدينا تحت السيطرة.<br />\r\n13\r\n<br />\r\n14\r\n<span style=\"font-size:18px\"><span style=\"color:#a566c8\">الثوم الأسود</span></span><br />\r\n15\r\nيُصنع الثوم الأسود عن طريق تخمير الثوم العادي على درجة حرارة عالية لأسابيع. يساعد الثوم الأسود في منع الالتهاب وتقوية الذاكرة. يمكن أن يكون هذا الثوم مفيدًا لمرضى الزهايمر لأنه يحسن الذاكرة قصيرة المدى. أظهر الثوم الأسود من خلال الدراسات أنه أفضل من الثوم النيء بسبب مضادات الأكسدة وخصائصه المضادة للسرطان.<br />\r\n16\r\n<br />\r\n17\r\n<span style=\"font-size:18px\"><span style=\"color:#a566c8\">الأرز الأسود</span></span><br />\r\n18\r\nهذا الأرز الذي يحصل على لونه الفريد من الأنثوسيانين، يستهلكه الصينيون منذ وقت طويل جدًا. يتكون الأرز الأسود من بعض مضادات الأكسدة التي يمكن أن تساعد في تعزيز الرؤية. يتكون من مركبات اللوتين والزياكسانثين التي تحمي شبكية العين من الضوء القاسي. الأرز الأسود هو الخيار الأمثل للأشخاص الذين يعانون من حساسية الغلوتين أو الذين يتبعون نظامًا غذائيًا خالٍ من الغلوتين.</p>\r\n19\r\n​\r\nClean HTML output on the go\r\nHere are the 2 different WYSIWYG HTML editors available on this website:\r\n\r\n• CKEditor 4 with direct access to edit HTML markup\r\n\r\n• CKEditor 5 with real-time collaboration and Markdown support.\r\n\r\nWith both editors, you can create clean HTML output with the easiest WYSIWYG editing possible. If you've already started writing rich-text content, all you have to do is paste it in onlinehtmleditor.dev, make your adjustments, extract HTML output from view-source mode and reuse it anywhere on the web!\r\n\r\nMore on CKEditor 5\r\n\r\nMore on CKEditor 4\r\n\r\nEasy HTML editing\r\nCKEditor 4's HTML source code editing feature allows it to be used as an online HTML editor. It includes syntax highlighting to make it easier for you to follow code. It can be forced to accept any type of code includingtags by simply turning off the HTML filtering. You can also switch to WYSIWYG mode anytime to check how your code output looks!\r\n\r\nClean your HTML code\r\nFor situations where you would like to clean and fix up invalid HTML, you can use CKEditor 4's source code editing feature as well. After switching to source code mode, all you have to do is to paste in your HTML and CKEditor 4 will automatically fix it. You can again switch back and forth to WYSIWYG mode anytime to edit content more easily.\r\n\r\nConvert Word document and Google Docs to HTML\r\nCKEditor 4 and CKEditor 5 have excellent copy-paste with constant improvements. Whether you are copy-pasting from Google Docs, Word, Excel or LibreOffice, CKEditor will get you your exact content. This makes it better than any ordinary tool to turn your existing Word and Google Docs and LibreOffice documents to HTML. Simple as, paste your content, and click source code mode to see the HTML output.\r\n\r\n\r\n\r\nCollaborative writing\r\nIf you're looking for an alternative to Google Docs real-time collaboration, but you also need HTML output, CKEditor 5 is a go! You can use it to comment on selected parts of the content, text, images, tables or suggest edits with its track changes feature.\r\n\r\nTo collaborate with your colleagues or friends all you have to do is to share the link. Each time you load the page, a special document ID gets attached to the URL. Each document ID and its content stays active for an hour after the last user disconnects from it so you do not immediately lose your content. Also, there isn't a limit for the number of collaborators!\r\n\r\nCollaboration makes it easier to create your content quickly and efficiently. With CKEditor 5, where you write, comment, discuss and proofread the content are unified so you don't lose time switching between applications to edit and discuss. If some of your collaborators prefer Markdown, CKEditor 5 has you covered there too!\r\n\r\nLearn about CKEditor 5 collaboration features\r\n\r\nWhy CKEditor?\r\nWYSIWYG editors in your software often misbehave. This is usually because they are out-of-date or simply are not reliable. Unfortunately, many developers opt for simple, lightweight, do-it-yourself-editors based on assumptions without doing proper research or testing for their individual use case. This leaves the end users frustrated.\r\n\r\nHowever, both CKEditors are built with 16 years of experience in WYSIWYG rich-text editing by a team of 40+ developers. We consistently listen to user concerns, trends, new feature requests to help us build our editors. Architectures that can handle complex structures and the constant improvements makes the editors stronger than any other examples.\r\n\r\nThe best WYSIWYG Online HTML editor around\r\nWhat sets CKEditor apart from other online HTML tools is its originality! There are many websites and articles that include lists of best online HTML editors. What these listicles won't tell you is that although they have different names, many of the mentioned tools are simple implementations of CKEditor!\r\n\r\nNow you've found the original online HTML editor! Whether you are looking for a quick online solution or to implement the editor in your own software, CKEditor will always provide you the latest and greatest WYSIWYG features. But if you are looking for some guidance on deciding which editor is the best for you, we can also help with that!\r\n\r\nHow to choose the perfect editor\r\n\r\nOnline HTML editor features\r\nThis section presents a whole variety of features that CKEditor has to offer\r\nStyling and Formatting\r\nThe Basic Styles plugin provides the ability to add some basic text formatting to your document. It adds the Bold, Italic, Underline, Strikethrough, Subscript and Superscript toolbar buttons that apply these styles. If you want to quickly remove basic styles from your document, use the Remove Format button provided by the Remove Format plugin.\r\n\r\nCopy Formatting\r\nThe optional Copy Formatting plugin provides the ability to easily copy text formatting from one place in the document and apply it to another. To copy styles, place your cursor inside the text (or select a styled document fragment) and press the button or use the Ctrl+Shift+C keyboard shortcut.\r\n\r\nRemoving Text Formatting\r\nThe Remove Format plugin provides the ability to quickly remove any text formatting that is applied through inline HTML elements and CSS styles, like basic text styles (bold, italic, etc.), font family and size, text and background colors or styles applied through the Styles drop-down. Note that it does not change text formats applied at block level..\r\n\r\nAutoformatting\r\nThe Autoformat feature in CKEditor 5 allows you to quickly apply formatting to the content you are writing. While it can be customized, by default it can be used as an Markdown alternative. For example you bold by typing **text** or __text__ , create bulleted lists with * or -, create headings with #, ## or ###.\r\n\r\nBlock-Level Text Formats\r\nThe Format plugin provides the ability to add block-level text formatting to your document. It introduces the Paragraph Format toolbar button that applies these text formats. The formats work on block level which means that you do not need to select any text in order to apply them and entire blocks will be affected by your choice.\r\n\r\nTables\r\nThis plugin adds the Table Properties dialog window with support for creating tables and setting basic table properties, such as: number of rows and columns, table width and height, cell padding and spacing, table headers setting, table border size, table alignment on the page and table caption and summary.\r\n\r\nInserting Images\r\nThe default Image plugin supports inserting images into the editor content. This plugin supports left and right alignment. It also allows setting image border as well as pixel-perfect alignment (by setting the horizontal and vertical whitespace). Links can be added to an image easily from the Image Properties dialog. A File manager such as CKFinder can be integrated for image upload and storage support.\r\n\r\nPasting Content from LibreOffice\r\nThe Paste from LibreOffice plugin allows you to paste content from LibreOffice Writer and maintain original content structure and formatting.\r\n\r\nPasting Content from Google Docs\r\nThe Paste from Google Docs plugin allows you to paste content from Google Docs and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Excel\r\nThe Paste from Word plugin allows you to also paste content from Microsoft Excel and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Word\r\nThe Paste from Word plugin allows you to paste content from Microsoft Word and maintain original content structure and formatting. It automatically detects Word content and transforms its structure and formatting to clean HTML.\r\n\r\nSource Code Editing\r\nCKEditor 4 is a WYSIWYG editor, so it makes it easy for end users to work on HTML content without any knowledge of HTML whatsoever. More advanced users, however, sometimes want to access raw HTML source code for their content and CKEditor makes it possible by providing the Source Editing feature.\r\n\r\nCode Snippets\r\nThis plugin allows you to insert rich code fragments and see a live preview with highlighted syntax. Its original implementation uses the highlight.js library, but the plugin exposes a convenient interface for hooking any other library, even a server-side one.\r\n\r\nEmbedding Media Resources\r\nThe Media Embed plugin allow to embed resources (videos, images, tweets, etc.) hosted by other services (like e.g. YouTube, Vimeo, Twitter) in the editor.\r\n\r\nSpellcheck on the go\r\nThe SpellCheckAsYouType (SCAYT) plugin provides inline spelling and grammar checking, much like the native browser spell checker, well-integrated with the CKEditor 4 context menu. It uses the WebSpellChecker web services.\r\n\r\nOnline HTML WYSIWYG Editor © 2023 - all rights reserved.Terms of usePrivacy PolicyCookies policy\r\n\r\n\r\n"
          },
          new Article() {
            Id = "150", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_20230404210740716.jpg", Title = "الأكل العاطفي .. ما هو وكيف يمكن التغلب عليه؟\r\n",
              Description = "Online HTML Editor\r\npowered by CKEditor\r\n\r\nOnline HTML editor user guideReal-time collaboration editor user guide\r\nOnline HTML Editor\r\nReal-time collaboration editor\r\n\r\nSwitch to WYSIWYG editor\r\n<p style=\"text-align:right\"><span style=\"color:#a566c8\"><span style=\"font-size:18px\"><strong>كي تسيطر علي إحساسك بالجوع في فصل الشتاء، عليكِ أن تتعرف على أسباب زيادة الوزن في الشتاء، حتى تتجنبها وتتمكن من الحفاظ على أن يظل قوامكِ مثاليًّا في هذا الفصل من العام.</strong></span></span></p>\r\n\r\n<p style=\"text-align:right\">في دراسة حديثة أوضحت أن 53 بالمائة من الأمهات تعرضن لزيادة في الوزن خلال فصل الشتاء الماضي من أربع إلى عشر كيلوجرامات، نتيجة لعدد من الأسباب، أهمها:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#006400\">إنخفاض درجة الحرارة</span></li>\r\n\t<li style=\"text-align: right;\">عند إنخفاض درجة الحرارة في فصل الشتاء، والشعور بالبرودة الشديدة، يزيد من الشعور بالجوع، الأمر الذي يؤدي إلى تناول الطعام بكثرة، خصوصًا الوجبات التي تحتوي على الدهون والسكريات. كذلك فإن برودة الجو تزيد من الشعور بالكسل، وعدم ممارسة التمارين الرياضية، ما يؤدي إلى زيادة الوزن.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">غياب الشمس</span>&nbsp;غياب ضوء الشمس لفترة طويلة خلال ساعات النهار في فصل الشتاء، يؤثر بشكل كبير على النظام الهرموني في الجسم، مما يؤدي إلى الرغبة في تناول الكثير من الأطعمة.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">إكتئاب الشتاء</span>&nbsp; مع قدوم فصل الشتاء، يشعر كثير من الناس بالإكتئاب الموسمي، ويتسبب ذلك في الرغبة في تناول المزيد من الأطعمة</li>\r\n\t<li style=\"text-align: right;\">&nbsp;</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">زيادة عدد ساعات النوم في فصل الشتاء</span>&nbsp; يميل الناس إلى النوم عدد ساعات أكثر، ما يؤثر على معدلات حرق السعرات الحرارية في الجسم، فيقل معدل الحرق ويزداد الوزن.</li>\r\n</ul>\r\n\r\n<p style=\"text-align:right\"><strong>ولأن جميعنا في الشتاء نشعر بالجوع في أيام الشتاء بشكل أكبر بسبب الجو البارد، فيدفعك جسمكِ لا شعوريًّا لطلب ما يمده بالدفء من طعام أو شراب، ولكن تكمن المشكلة في أن جميع الأطعمة الباعثة على الدفء تكون مليئة بالسعرات الحرارية، وهو ما قد يسبب لكِ القلق والخوف من إكتساب المزيد من الكيلوجرامات، في هذا المقال نخبركِ بطرق السيطرة على الجوع في فصل الشتاء، كل ما عليك هو إتباع هذه النصائح الآتية:</strong></p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\">احرص على تناول الأطعمة والمشروبات قليلة السعرات الحرارية، مثل: البطاطا الحلوة وشوربة العدس والقرفة والذرة والترمس، فهي تمدكِ بالدف وتشعركِ بالشبع.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الخضروات والفواكه مثل البروكلي والملفوف والخضروات الورقية كالسبانخ والجرجير اأيضا الرمان والتفاح والكمثري، على شكل طبق سلطة أو في صورتها الكاملة.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الأسماك الغنية بالأوميجا 3، مثل: السردين والماكريل والتونة، فهي قليلة السعرات الحرارية، ومليئة بالمواد المضادة للأكسدة.</li>\r\n\t<li style=\"text-align: right;\">تناول منتجات الألبان سواء كانت حليبًا أو لبن رائب أو زبادي أو جبن قريش، وتجنب تناول المنتجات الدسمة، مثل: الجبن الشيدر والرومي... وغيرهما.</li>\r\n\t<li style=\"text-align: right;\">أكثر من تناول الأطعمة المليئة بالألياف، مثل: الخس والبقوليات، والحبوب مثل: القمح والشعير والشوفان.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول المخبوزات المصنوعة من الدقيق الأسمر.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المشروبات الدافئة كالقهوة والكمون والكركم والشاي الأخضر وحاول أن تقلل من السكريات الأولية البسيطة كالعصائر والحلويات.</li>\r\n\t<li style=\"text-align: right;\">تناول المكسرات غير المحمصة، فهي مفيدة جدًّا وقليلة السعرات، ولكن احرص على أن تكون غير مملحة أيضًا.</li>\r\n\t<li style=\"text-align: right;\">مارس التمارين الرياضية بشكل يومي.</li>\r\n\t<li style=\"text-align: right;\">تناول الأطعمة والمشروبات الساخنة، وخاصة أنواع الحساء المختلفة، واختار الأنواع قليلة السعرات، مثل: شوربة الشوفان والخضار والعدس والكرنب.</li>\r\n\t<li style=\"text-align: right;\">احصل على وجبة متوسطة كل ثلاث إلى أربع ساعات، فالشعور بالجوع يجعلك نهمة جدًّا، ما يسبب لكِ زيادة كبيرة في الوزن</li>\r\n\t<li style=\"text-align: right;\">احرص على تناول وجبتين رئيسيتين في اليوم، هما الإفطار والغداء، مع ثلاث وجبات بينية خفيفة.</li>\r\n\t<li style=\"text-align: right;\">ارتد ملابس مناسبة لحرارة الجو، حتى لا تشعر بشدة البرد، فيدفعك هذا لتناول الكثير من الطعام.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المياه، واحتمل التردد كثيرًا على دورة المياه، فهذا أفضل من زيادة الوزن، كما أنه يساعد كليتيكِ على إخراج السموم والأملاح الزائدة من جسمك في فصل الشتاء.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">أخيرا&nbsp; تجنب زيادة الوزن في الشتاء و، ابتعد عن كل مسببات زيادة الوزن، واتبع طرق السيطرة على الجوع في فصل الشتاء، حتى تحافظ على قوامكِ ولا يزداد وزنكِ.</li>\r\n\t<li style=\"text-align: right;\">حافظ على صحتك ولا تجعل برد الشتاء يكون هو محرك الجوع لديك، في الشتاء يفقد جسمك العديد من السعرات في الحفاظ على التدفئة ولكن ذلك ليس السبب في شعورك بالجوع الدائم.</li>\r\n</ul>\r\n\r\n1\r\n<p style=\"text-align:right\"><strong>يعرف الأكل العاطفي بأنه الإفراط في تناول الطعام لقمع أو تهدئة المشاعر السلبية، مثل التوتر والغضب والخوف، والملل والحزن والوحدة</strong><strong>.</strong><br />\r\n2\r\n<strong>ويمكن أن يكون الطعام أيضا مصدر إلهاء، وإذا كنت قلقا بشأن حدث قادم أو بسبب صراع ما، على سبيل المثال، يمكن التركيز على تناول طعام مريح بدلا من التعامل مع الموقف المؤلم</strong><strong>.</strong><br />\r\n3\r\n<strong>وغالبا ما يؤدي الأكل العاطفي إلى الإفراط في تناول الطعام، وخاصة الإفراط في تناول الأطعمة الحلوة والدهنية وعالية السعرات الحرارية. وهذا يمكن أن يبدد الجهود المبذولة في إنقاص الوزن</strong><strong>.</strong><br />\r\n4\r\n<strong>وعندما تهدد المشاعر السلبية بتحفيز الأكل العاطفي<span style=\"color:#a566c8\">،&nbsp;<span style=\"font-size:18px\">جرب هذه النصائح التسع للبقاء على المسار الصحيح:</span></span></strong></p>\r\n5\r\n​\r\n6\r\n<ul>\r\n7\r\n    <li><strong>احتفظ بمفكرة طعام</strong><strong>:</strong>&nbsp;<strong>اكتب ما تأكله، وكم تأكل، ومتى تأكل، وكيف تشعر عندما تأكل، ومدى جوعك. وبمرور الوقت، قد ترى أنماطا تكشف العلاقة بين الحالة المزاجية والطعام</strong><strong>.</strong></li>\r\n8\r\n    <li><strong>خفف من توترك</strong>:&nbsp;<strong>إذا كان التوتر يساهم في الأكل العاطفي، فجرب أسلوب إدارة الإجهاد، مثل اليوغا أو التأمل أو التنفس العميق</strong><strong>.</strong></li>\r\n9\r\n    <li><strong>قم بفحص حقيقة الجوع</strong><strong>:&nbsp;</strong><strong>هل جوعك جسدي أم عاطفي؟ إذا كنت أكلت قبل ساعات قليلة فقط ولم تكن تسمع أصواتا قادمة من المعدة، فمن المحتمل أنك لست جائعا</strong><strong>.</strong></li>\r\n10\r\n    <li><strong>احصل على الدعم</strong><strong>:</strong>&nbsp;<strong>من المرجح أن تستسلم للأكل العاطفي إذا كنت تفتقر إلى شبكة دعم جيدة. اعتمد على العائلة والأصدقاء، أو فكر في الانضمام إلى مجموعة دعم</strong><strong>.</strong></li>\r\n11\r\n    <li><strong>حارب الملل</strong>:&nbsp;<strong>بدلا من تناول الوجبات الخفيفة عندما لا تكون جائعا، شتت نفسك واستبدل ذلك بسلوك أكثر صحة. ويمكنك المشي أو مشاهدة فيلم أو اللعب مع حيوانك الأليف أو الاستماع إلى الموسيقى أو القراءة أو تصفح الإنترنت أو الاتصال بصديق</strong><strong>.</strong></li>\r\n12\r\n    <li><strong>تخلص من المغريات</strong><strong>:</strong>&nbsp;<strong>لا تحتفظ بأطعمة مغرية يصعب مقاومتها في منزلك. وإذا شعرت بالغضب أو الحزن، فقم بتأجيل رحلتك إلى متجر البقالة حتى تتخلص من عواطفك</strong><strong>.</strong></li>\r\n13\r\n    <li><strong>لا تحرم نفسك</strong><strong>:</strong>&nbsp;<strong>عند محاولة إنقاص الوزن، قد تحد من السعرات الحرارية أكثر من اللازم، وتتناول نفس الأطعمة بشكل متكرر وتتجنب المكافآت. وقد يؤدي هذا فقط إلى زيادة الرغبة الشديدة في تناول الطعام، خاصةً عند الاستجابة للعواطف. ويمكنك تناول كميات مُرضية من الأطعمة الصحية، واستمتع بتناول الطعام من حين لآخر، واحصل على الكثير من التنوع للحد من الرغبة الشديدة في تناول الطعام</strong><strong>.</strong></li>\r\n14\r\n    <li><strong>وجبة خفيفة صحية</strong><strong>:&nbsp;</strong><strong>إذا شعرت بالحاجة إلى تناول الطعام بين الوجبات، فاختر وجبة خفيفة صحية، مثل الفاكهة الطازجة، أو الخضار، أو المكسرات، أو الفشار. أو جرب نسخا منخفضة السعرات الحرارية من أطعمتك المفضلة لترى ما إذا كانت ترضي رغباتك</strong><strong>.</strong></li>\r\n15\r\n    <li><strong>تعلم من النكسات</strong><strong>:&nbsp;</strong><strong>إذا كانت لديك نوبة من الأكل العاطفي، فاغفر لنفسك وابدأ من جديد في اليوم التالي. وحاول أن تتعلم من التجربة وخطط لكيفية منعها في المستقبل. ركز على التغييرات الإيجابية التي تجريها في عاداتك الغذائية وامنح نفسك الإرادة لإجراء تغييرات تؤدي إلى صحة أفضل</strong><strong>.</strong></li>\r\n16\r\n</ul>\r\n17\r\n​\r\nClean HTML output on the go\r\nHere are the 2 different WYSIWYG HTML editors available on this website:\r\n\r\n• CKEditor 4 with direct access to edit HTML markup\r\n\r\n• CKEditor 5 with real-time collaboration and Markdown support.\r\n\r\nWith both editors, you can create clean HTML output with the easiest WYSIWYG editing possible. If you've already started writing rich-text content, all you have to do is paste it in onlinehtmleditor.dev, make your adjustments, extract HTML output from view-source mode and reuse it anywhere on the web!\r\n\r\nMore on CKEditor 5\r\n\r\nMore on CKEditor 4\r\n\r\nEasy HTML editing\r\nCKEditor 4's HTML source code editing feature allows it to be used as an online HTML editor. It includes syntax highlighting to make it easier for you to follow code. It can be forced to accept any type of code includingtags by simply turning off the HTML filtering. You can also switch to WYSIWYG mode anytime to check how your code output looks!\r\n\r\nClean your HTML code\r\nFor situations where you would like to clean and fix up invalid HTML, you can use CKEditor 4's source code editing feature as well. After switching to source code mode, all you have to do is to paste in your HTML and CKEditor 4 will automatically fix it. You can again switch back and forth to WYSIWYG mode anytime to edit content more easily.\r\n\r\nConvert Word document and Google Docs to HTML\r\nCKEditor 4 and CKEditor 5 have excellent copy-paste with constant improvements. Whether you are copy-pasting from Google Docs, Word, Excel or LibreOffice, CKEditor will get you your exact content. This makes it better than any ordinary tool to turn your existing Word and Google Docs and LibreOffice documents to HTML. Simple as, paste your content, and click source code mode to see the HTML output.\r\n\r\n\r\n\r\nCollaborative writing\r\nIf you're looking for an alternative to Google Docs real-time collaboration, but you also need HTML output, CKEditor 5 is a go! You can use it to comment on selected parts of the content, text, images, tables or suggest edits with its track changes feature.\r\n\r\nTo collaborate with your colleagues or friends all you have to do is to share the link. Each time you load the page, a special document ID gets attached to the URL. Each document ID and its content stays active for an hour after the last user disconnects from it so you do not immediately lose your content. Also, there isn't a limit for the number of collaborators!\r\n\r\nCollaboration makes it easier to create your content quickly and efficiently. With CKEditor 5, where you write, comment, discuss and proofread the content are unified so you don't lose time switching between applications to edit and discuss. If some of your collaborators prefer Markdown, CKEditor 5 has you covered there too!\r\n\r\nLearn about CKEditor 5 collaboration features\r\n\r\nWhy CKEditor?\r\nWYSIWYG editors in your software often misbehave. This is usually because they are out-of-date or simply are not reliable. Unfortunately, many developers opt for simple, lightweight, do-it-yourself-editors based on assumptions without doing proper research or testing for their individual use case. This leaves the end users frustrated.\r\n\r\nHowever, both CKEditors are built with 16 years of experience in WYSIWYG rich-text editing by a team of 40+ developers. We consistently listen to user concerns, trends, new feature requests to help us build our editors. Architectures that can handle complex structures and the constant improvements makes the editors stronger than any other examples.\r\n\r\nThe best WYSIWYG Online HTML editor around\r\nWhat sets CKEditor apart from other online HTML tools is its originality! There are many websites and articles that include lists of best online HTML editors. What these listicles won't tell you is that although they have different names, many of the mentioned tools are simple implementations of CKEditor!\r\n\r\nNow you've found the original online HTML editor! Whether you are looking for a quick online solution or to implement the editor in your own software, CKEditor will always provide you the latest and greatest WYSIWYG features. But if you are looking for some guidance on deciding which editor is the best for you, we can also help with that!\r\n\r\nHow to choose the perfect editor\r\n\r\nOnline HTML editor features\r\nThis section presents a whole variety of features that CKEditor has to offer\r\nStyling and Formatting\r\nThe Basic Styles plugin provides the ability to add some basic text formatting to your document. It adds the Bold, Italic, Underline, Strikethrough, Subscript and Superscript toolbar buttons that apply these styles. If you want to quickly remove basic styles from your document, use the Remove Format button provided by the Remove Format plugin.\r\n\r\nCopy Formatting\r\nThe optional Copy Formatting plugin provides the ability to easily copy text formatting from one place in the document and apply it to another. To copy styles, place your cursor inside the text (or select a styled document fragment) and press the button or use the Ctrl+Shift+C keyboard shortcut.\r\n\r\nRemoving Text Formatting\r\nThe Remove Format plugin provides the ability to quickly remove any text formatting that is applied through inline HTML elements and CSS styles, like basic text styles (bold, italic, etc.), font family and size, text and background colors or styles applied through the Styles drop-down. Note that it does not change text formats applied at block level..\r\n\r\nAutoformatting\r\nThe Autoformat feature in CKEditor 5 allows you to quickly apply formatting to the content you are writing. While it can be customized, by default it can be used as an Markdown alternative. For example you bold by typing **text** or __text__ , create bulleted lists with * or -, create headings with #, ## or ###.\r\n\r\nBlock-Level Text Formats\r\nThe Format plugin provides the ability to add block-level text formatting to your document. It introduces the Paragraph Format toolbar button that applies these text formats. The formats work on block level which means that you do not need to select any text in order to apply them and entire blocks will be affected by your choice.\r\n\r\nTables\r\nThis plugin adds the Table Properties dialog window with support for creating tables and setting basic table properties, such as: number of rows and columns, table width and height, cell padding and spacing, table headers setting, table border size, table alignment on the page and table caption and summary.\r\n\r\nInserting Images\r\nThe default Image plugin supports inserting images into the editor content. This plugin supports left and right alignment. It also allows setting image border as well as pixel-perfect alignment (by setting the horizontal and vertical whitespace). Links can be added to an image easily from the Image Properties dialog. A File manager such as CKFinder can be integrated for image upload and storage support.\r\n\r\nPasting Content from LibreOffice\r\nThe Paste from LibreOffice plugin allows you to paste content from LibreOffice Writer and maintain original content structure and formatting.\r\n\r\nPasting Content from Google Docs\r\nThe Paste from Google Docs plugin allows you to paste content from Google Docs and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Excel\r\nThe Paste from Word plugin allows you to also paste content from Microsoft Excel and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Word\r\nThe Paste from Word plugin allows you to paste content from Microsoft Word and maintain original content structure and formatting. It automatically detects Word content and transforms its structure and formatting to clean HTML.\r\n\r\nSource Code Editing\r\nCKEditor 4 is a WYSIWYG editor, so it makes it easy for end users to work on HTML content without any knowledge of HTML whatsoever. More advanced users, however, sometimes want to access raw HTML source code for their content and CKEditor makes it possible by providing the Source Editing feature.\r\n\r\nCode Snippets\r\nThis plugin allows you to insert rich code fragments and see a live preview with highlighted syntax. Its original implementation uses the highlight.js library, but the plugin exposes a convenient interface for hooking any other library, even a server-side one.\r\n\r\nEmbedding Media Resources\r\nThe Media Embed plugin allow to embed resources (videos, images, tweets, etc.) hosted by other services (like e.g. YouTube, Vimeo, Twitter) in the editor.\r\n\r\nSpellcheck on the go\r\nThe SpellCheckAsYouType (SCAYT) plugin provides inline spelling and grammar checking, much like the native browser spell checker, well-integrated with the CKEditor 4 context menu. It uses the WebSpellChecker web services.\r\n\r\nOnline HTML WYSIWYG Editor © 2023 - all rights reserved.Terms of usePrivacy PolicyCookies policy\r\n\r\n\r\n"
          }, new Article() {
            Id = "151", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/image_20220918180342371.jpg", Title = "موعد تناول وجباتك غير مهم لإنقاص الوزن.. مجرد خرافة!\r\n",
              Description = "Online HTML Editor\r\npowered by CKEditor\r\n\r\nOnline HTML editor user guideReal-time collaboration editor user guide\r\nOnline HTML Editor\r\nReal-time collaboration editor\r\n\r\nSwitch to WYSIWYG editor\r\n<p style=\"text-align:right\"><span style=\"color:#a566c8\"><span style=\"font-size:18px\"><strong>كي تسيطر علي إحساسك بالجوع في فصل الشتاء، عليكِ أن تتعرف على أسباب زيادة الوزن في الشتاء، حتى تتجنبها وتتمكن من الحفاظ على أن يظل قوامكِ مثاليًّا في هذا الفصل من العام.</strong></span></span></p>\r\n\r\n<p style=\"text-align:right\">في دراسة حديثة أوضحت أن 53 بالمائة من الأمهات تعرضن لزيادة في الوزن خلال فصل الشتاء الماضي من أربع إلى عشر كيلوجرامات، نتيجة لعدد من الأسباب، أهمها:&nbsp;</p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#006400\">إنخفاض درجة الحرارة</span></li>\r\n\t<li style=\"text-align: right;\">عند إنخفاض درجة الحرارة في فصل الشتاء، والشعور بالبرودة الشديدة، يزيد من الشعور بالجوع، الأمر الذي يؤدي إلى تناول الطعام بكثرة، خصوصًا الوجبات التي تحتوي على الدهون والسكريات. كذلك فإن برودة الجو تزيد من الشعور بالكسل، وعدم ممارسة التمارين الرياضية، ما يؤدي إلى زيادة الوزن.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">غياب الشمس</span>&nbsp;غياب ضوء الشمس لفترة طويلة خلال ساعات النهار في فصل الشتاء، يؤثر بشكل كبير على النظام الهرموني في الجسم، مما يؤدي إلى الرغبة في تناول الكثير من الأطعمة.</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">إكتئاب الشتاء</span>&nbsp; مع قدوم فصل الشتاء، يشعر كثير من الناس بالإكتئاب الموسمي، ويتسبب ذلك في الرغبة في تناول المزيد من الأطعمة</li>\r\n\t<li style=\"text-align: right;\">&nbsp;</li>\r\n\t<li style=\"text-align: right;\"><span style=\"color:#008000\">زيادة عدد ساعات النوم في فصل الشتاء</span>&nbsp; يميل الناس إلى النوم عدد ساعات أكثر، ما يؤثر على معدلات حرق السعرات الحرارية في الجسم، فيقل معدل الحرق ويزداد الوزن.</li>\r\n</ul>\r\n\r\n<p style=\"text-align:right\"><strong>ولأن جميعنا في الشتاء نشعر بالجوع في أيام الشتاء بشكل أكبر بسبب الجو البارد، فيدفعك جسمكِ لا شعوريًّا لطلب ما يمده بالدفء من طعام أو شراب، ولكن تكمن المشكلة في أن جميع الأطعمة الباعثة على الدفء تكون مليئة بالسعرات الحرارية، وهو ما قد يسبب لكِ القلق والخوف من إكتساب المزيد من الكيلوجرامات، في هذا المقال نخبركِ بطرق السيطرة على الجوع في فصل الشتاء، كل ما عليك هو إتباع هذه النصائح الآتية:</strong></p>\r\n\r\n<ul>\r\n\t<li style=\"text-align: right;\">احرص على تناول الأطعمة والمشروبات قليلة السعرات الحرارية، مثل: البطاطا الحلوة وشوربة العدس والقرفة والذرة والترمس، فهي تمدكِ بالدف وتشعركِ بالشبع.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الخضروات والفواكه مثل البروكلي والملفوف والخضروات الورقية كالسبانخ والجرجير اأيضا الرمان والتفاح والكمثري، على شكل طبق سلطة أو في صورتها الكاملة.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من الأسماك الغنية بالأوميجا 3، مثل: السردين والماكريل والتونة، فهي قليلة السعرات الحرارية، ومليئة بالمواد المضادة للأكسدة.</li>\r\n\t<li style=\"text-align: right;\">تناول منتجات الألبان سواء كانت حليبًا أو لبن رائب أو زبادي أو جبن قريش، وتجنب تناول المنتجات الدسمة، مثل: الجبن الشيدر والرومي... وغيرهما.</li>\r\n\t<li style=\"text-align: right;\">أكثر من تناول الأطعمة المليئة بالألياف، مثل: الخس والبقوليات، والحبوب مثل: القمح والشعير والشوفان.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">تناول المخبوزات المصنوعة من الدقيق الأسمر.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المشروبات الدافئة كالقهوة والكمون والكركم والشاي الأخضر وحاول أن تقلل من السكريات الأولية البسيطة كالعصائر والحلويات.</li>\r\n\t<li style=\"text-align: right;\">تناول المكسرات غير المحمصة، فهي مفيدة جدًّا وقليلة السعرات، ولكن احرص على أن تكون غير مملحة أيضًا.</li>\r\n\t<li style=\"text-align: right;\">مارس التمارين الرياضية بشكل يومي.</li>\r\n\t<li style=\"text-align: right;\">تناول الأطعمة والمشروبات الساخنة، وخاصة أنواع الحساء المختلفة، واختار الأنواع قليلة السعرات، مثل: شوربة الشوفان والخضار والعدس والكرنب.</li>\r\n\t<li style=\"text-align: right;\">احصل على وجبة متوسطة كل ثلاث إلى أربع ساعات، فالشعور بالجوع يجعلك نهمة جدًّا، ما يسبب لكِ زيادة كبيرة في الوزن</li>\r\n\t<li style=\"text-align: right;\">احرص على تناول وجبتين رئيسيتين في اليوم، هما الإفطار والغداء، مع ثلاث وجبات بينية خفيفة.</li>\r\n\t<li style=\"text-align: right;\">ارتد ملابس مناسبة لحرارة الجو، حتى لا تشعر بشدة البرد، فيدفعك هذا لتناول الكثير من الطعام.</li>\r\n\t<li style=\"text-align: right;\">تناول الكثير من المياه، واحتمل التردد كثيرًا على دورة المياه، فهذا أفضل من زيادة الوزن، كما أنه يساعد كليتيكِ على إخراج السموم والأملاح الزائدة من جسمك في فصل الشتاء.&nbsp;</li>\r\n\t<li style=\"text-align: right;\">أخيرا&nbsp; تجنب زيادة الوزن في الشتاء و، ابتعد عن كل مسببات زيادة الوزن، واتبع طرق السيطرة على الجوع في فصل الشتاء، حتى تحافظ على قوامكِ ولا يزداد وزنكِ.</li>\r\n\t<li style=\"text-align: right;\">حافظ على صحتك ولا تجعل برد الشتاء يكون هو محرك الجوع لديك، في الشتاء يفقد جسمك العديد من السعرات في الحفاظ على التدفئة ولكن ذلك ليس السبب في شعورك بالجوع الدائم.</li>\r\n</ul>\r\n\r\n1\r\n<p>لا شك أن كل ساع إلى الرشاقة جرب&nbsp;<strong>النظام الغذائي</strong>&nbsp;القديم الذي يركز على تناول وجبة كبيرة في الإفطار وأقل بعض الشيء على الغداء، ووجبة خفيفة جداً على العشاء.</p>\r\n2\r\n​\r\n3\r\n<p>فقد ربطت بعض الدراسات والخبراء سابقا أكل الجزء الأكبر من الطعام في وقت مبكر من اليوم، بانخفاض معدلات السمنة والتخلص من الوزن الزائد، إلا أن دراسة جديدة كشفت عدم صحة ذلك.</p>\r\n4\r\n​\r\n5\r\n<p>إذ اكتشف باحثون أسكتلنديون أن موعد تناول الوجبات ليس له أي تأثير على فقدان الوزن، مشيرين إلى أن عملية التمثيل الغذائي تحرق الكثير من السعرات الحرارية في المساء كما تفعل في الصباح.</p>\r\n6\r\n​\r\n7\r\n<p>كما اعتبروا أن الفائدة الوحيدة من تناول المزيد من الطعام في الصباح هي عدم الجوع في وقت لاحق من اليوم، وفق ما نقلت صحيفة &quot;ذا صن&quot; البريطانية.</p>\r\n8\r\n​\r\n9\r\n<p>وأجريت الدراسة التي نُشرت على 16 رجلاً و14 امرأة على مدار أربعة أسابيع لمعرفة كيف تأثر وزنهم اعتماداً على أي وقت من اليوم يأكلون فيه معظم السعرات الحرارية.</p>\r\n10\r\n​\r\n11\r\n<p>فيما أعطي كل شخص نفس النظام الغذائي الصحي، لكن نصفهم أجبروا على تناول غالبية السعرات الحرارية في وقت الإفطار، والنصف الآخر على العشاء.</p>\r\n12\r\n​\r\n13\r\n<p>وبعد أسبوعين أجري العكس، حيث تناول الأشخاص الذين تناولوا معظم سعراتهم الحرارية في الصباح في وقت لاحق من اليوم، والعكس صحيح.</p>\r\n14\r\n​\r\n15\r\n<p>إلى ذلك، فقد كل شخص في الدراسة نفس القدر من الوزن خلال كل أسبوع من الأسابيع الأربعة، مما يشير إلى أن عملية الأيض لديهم تحرق نفس القدر من الطاقة في الصباح مثل المساء.</p>\r\n16\r\n​\r\n17\r\n<p>بدورها، أوضحت الكاتبة الرئيسية للدراسة،&nbsp;أن المشاركين شعروا أنهم تحكموا بشهيتهم بشكل أفضل في الأيام التي تناولوا فيها وجبة فطور أكبر وأنهم &quot;شعروا بالشبع طوال اليوم&quot;.</p>\r\n18\r\n​\r\n19\r\n<p>ومع ذلك، أشارت إلى أنه عندما يتعلق الأمر بالتوقيت واتباع نظام غذائي، فإنه &quot;من غير المحتمل أن يكون هناك نظام غذائي واحد يناسب الجميع&quot;. وأضافت أن &quot;اكتشاف هذا سيكون مستقبل دراسات النظام الغذائي، ولكن من الصعب جداً قياسه&quot;.</p>\r\n20\r\n​\r\n21\r\n<p>يشار إلى أن فقدان الوزن يختلف من شخص لآخر، ولكن الطريقة الوحيدة التي تعمل في جميع المجالات هي نقص السعرات الحرارية.</p>\r\n22\r\n​\r\n23\r\n<p>ويحدث النقص في السعرات الحرارية عندما تستهلك سعرات حرارية أقل مما تستهلكه في اليوم.</p>\r\n24\r\n​\r\nClean HTML output on the go\r\nHere are the 2 different WYSIWYG HTML editors available on this website:\r\n\r\n• CKEditor 4 with direct access to edit HTML markup\r\n\r\n• CKEditor 5 with real-time collaboration and Markdown support.\r\n\r\nWith both editors, you can create clean HTML output with the easiest WYSIWYG editing possible. If you've already started writing rich-text content, all you have to do is paste it in onlinehtmleditor.dev, make your adjustments, extract HTML output from view-source mode and reuse it anywhere on the web!\r\n\r\nMore on CKEditor 5\r\n\r\nMore on CKEditor 4\r\n\r\nEasy HTML editing\r\nCKEditor 4's HTML source code editing feature allows it to be used as an online HTML editor. It includes syntax highlighting to make it easier for you to follow code. It can be forced to accept any type of code includingtags by simply turning off the HTML filtering. You can also switch to WYSIWYG mode anytime to check how your code output looks!\r\n\r\nClean your HTML code\r\nFor situations where you would like to clean and fix up invalid HTML, you can use CKEditor 4's source code editing feature as well. After switching to source code mode, all you have to do is to paste in your HTML and CKEditor 4 will automatically fix it. You can again switch back and forth to WYSIWYG mode anytime to edit content more easily.\r\n\r\nConvert Word document and Google Docs to HTML\r\nCKEditor 4 and CKEditor 5 have excellent copy-paste with constant improvements. Whether you are copy-pasting from Google Docs, Word, Excel or LibreOffice, CKEditor will get you your exact content. This makes it better than any ordinary tool to turn your existing Word and Google Docs and LibreOffice documents to HTML. Simple as, paste your content, and click source code mode to see the HTML output.\r\n\r\n\r\n\r\nCollaborative writing\r\nIf you're looking for an alternative to Google Docs real-time collaboration, but you also need HTML output, CKEditor 5 is a go! You can use it to comment on selected parts of the content, text, images, tables or suggest edits with its track changes feature.\r\n\r\nTo collaborate with your colleagues or friends all you have to do is to share the link. Each time you load the page, a special document ID gets attached to the URL. Each document ID and its content stays active for an hour after the last user disconnects from it so you do not immediately lose your content. Also, there isn't a limit for the number of collaborators!\r\n\r\nCollaboration makes it easier to create your content quickly and efficiently. With CKEditor 5, where you write, comment, discuss and proofread the content are unified so you don't lose time switching between applications to edit and discuss. If some of your collaborators prefer Markdown, CKEditor 5 has you covered there too!\r\n\r\nLearn about CKEditor 5 collaboration features\r\n\r\nWhy CKEditor?\r\nWYSIWYG editors in your software often misbehave. This is usually because they are out-of-date or simply are not reliable. Unfortunately, many developers opt for simple, lightweight, do-it-yourself-editors based on assumptions without doing proper research or testing for their individual use case. This leaves the end users frustrated.\r\n\r\nHowever, both CKEditors are built with 16 years of experience in WYSIWYG rich-text editing by a team of 40+ developers. We consistently listen to user concerns, trends, new feature requests to help us build our editors. Architectures that can handle complex structures and the constant improvements makes the editors stronger than any other examples.\r\n\r\nThe best WYSIWYG Online HTML editor around\r\nWhat sets CKEditor apart from other online HTML tools is its originality! There are many websites and articles that include lists of best online HTML editors. What these listicles won't tell you is that although they have different names, many of the mentioned tools are simple implementations of CKEditor!\r\n\r\nNow you've found the original online HTML editor! Whether you are looking for a quick online solution or to implement the editor in your own software, CKEditor will always provide you the latest and greatest WYSIWYG features. But if you are looking for some guidance on deciding which editor is the best for you, we can also help with that!\r\n\r\nHow to choose the perfect editor\r\n\r\nOnline HTML editor features\r\nThis section presents a whole variety of features that CKEditor has to offer\r\nStyling and Formatting\r\nThe Basic Styles plugin provides the ability to add some basic text formatting to your document. It adds the Bold, Italic, Underline, Strikethrough, Subscript and Superscript toolbar buttons that apply these styles. If you want to quickly remove basic styles from your document, use the Remove Format button provided by the Remove Format plugin.\r\n\r\nCopy Formatting\r\nThe optional Copy Formatting plugin provides the ability to easily copy text formatting from one place in the document and apply it to another. To copy styles, place your cursor inside the text (or select a styled document fragment) and press the button or use the Ctrl+Shift+C keyboard shortcut.\r\n\r\nRemoving Text Formatting\r\nThe Remove Format plugin provides the ability to quickly remove any text formatting that is applied through inline HTML elements and CSS styles, like basic text styles (bold, italic, etc.), font family and size, text and background colors or styles applied through the Styles drop-down. Note that it does not change text formats applied at block level..\r\n\r\nAutoformatting\r\nThe Autoformat feature in CKEditor 5 allows you to quickly apply formatting to the content you are writing. While it can be customized, by default it can be used as an Markdown alternative. For example you bold by typing **text** or __text__ , create bulleted lists with * or -, create headings with #, ## or ###.\r\n\r\nBlock-Level Text Formats\r\nThe Format plugin provides the ability to add block-level text formatting to your document. It introduces the Paragraph Format toolbar button that applies these text formats. The formats work on block level which means that you do not need to select any text in order to apply them and entire blocks will be affected by your choice.\r\n\r\nTables\r\nThis plugin adds the Table Properties dialog window with support for creating tables and setting basic table properties, such as: number of rows and columns, table width and height, cell padding and spacing, table headers setting, table border size, table alignment on the page and table caption and summary.\r\n\r\nInserting Images\r\nThe default Image plugin supports inserting images into the editor content. This plugin supports left and right alignment. It also allows setting image border as well as pixel-perfect alignment (by setting the horizontal and vertical whitespace). Links can be added to an image easily from the Image Properties dialog. A File manager such as CKFinder can be integrated for image upload and storage support.\r\n\r\nPasting Content from LibreOffice\r\nThe Paste from LibreOffice plugin allows you to paste content from LibreOffice Writer and maintain original content structure and formatting.\r\n\r\nPasting Content from Google Docs\r\nThe Paste from Google Docs plugin allows you to paste content from Google Docs and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Excel\r\nThe Paste from Word plugin allows you to also paste content from Microsoft Excel and maintain original content structure and formatting.\r\n\r\nPasting Content from Microsoft Word\r\nThe Paste from Word plugin allows you to paste content from Microsoft Word and maintain original content structure and formatting. It automatically detects Word content and transforms its structure and formatting to clean HTML.\r\n\r\nSource Code Editing\r\nCKEditor 4 is a WYSIWYG editor, so it makes it easy for end users to work on HTML content without any knowledge of HTML whatsoever. More advanced users, however, sometimes want to access raw HTML source code for their content and CKEditor makes it possible by providing the Source Editing feature.\r\n\r\nCode Snippets\r\nThis plugin allows you to insert rich code fragments and see a live preview with highlighted syntax. Its original implementation uses the highlight.js library, but the plugin exposes a convenient interface for hooking any other library, even a server-side one.\r\n\r\nEmbedding Media Resources\r\nThe Media Embed plugin allow to embed resources (videos, images, tweets, etc.) hosted by other services (like e.g. YouTube, Vimeo, Twitter) in the editor.\r\n\r\nSpellcheck on the go\r\nThe SpellCheckAsYouType (SCAYT) plugin provides inline spelling and grammar checking, much like the native browser spell checker, well-integrated with the CKEditor 4 context menu. It uses the WebSpellChecker web services.\r\n\r\nOnline HTML WYSIWYG Editor © 2023 - all rights reserved.Terms of usePrivacy PolicyCookies policy\r\n\r\n\r\n"
          }, new Article() {
            Id = "152", LikesNumber = 0, ViewsNumber = 0, PostDate = new DateTime(), CategoryId = "9", avgReading = 20,
              Image = "/images/articles/6_2_17_10_955.jpg", Title = "7 أشياء تسبب زيادة في الوزن خلال النوم\r\n",
              Description = "<p>هل استيقظت صباحا وتفاجأت بزيادة في وزنك؟ إن كانت الإجابة بنعم، فربما تناولت واحدا من عدة أطعمة ومواد غذائية أثناء الليل.<br />\r\nويتصدر الملح والسكر قائمة الأطعمة الأكثر تسببا في زيادة الوزن خلال فترة وجيزة، ويطلق عليهما السموم البيضاء، ويتسببان كذلك في الإصابة بأمراض القلب والشرايين، والعديد من الأمراض الأمراض الأخرى.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">الكثير من الملح</span></span><br />\r\nتبدو الحبوب البيضاء والمالحة بريئة ظاهريا، وصحيح أن الملح لا يحتوي على سعرات حرارية، لكن تأثيره على الوزن مهم بشكل خاص.<br />\r\n&nbsp;يمتص الملح السوائل ويجعلنا نأكل أكثر ويساهم في زيادة الوزن. هل أفرطت في تناول الملح؟ لا تتفاجأ أنك تزن أكثر في اليوم التالي وتشعر أيضًا بالانتفاخ بعد الفشار المالح أو الأحمر المالح أو الوجبات الخفيفة المصنعة والمقرمشات أو حتى المخللات.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">تناول السكر</span></span><br />\r\nصديق الملح، لكنه على الجانب الآخر من الطعم، يحتوي في الواقع على عدد غير قليل من السعرات الحرارية. إذا لم تذهب إلى التدريب بعد تناول كعكة أو آيس كريم أو حلوى تحتوي على السكر، فمن المحتمل أن ينضم السكر إلى مخازن الدهون في الجسم، خاصة إذا تم تناوله في الليل، عندما يكون الجسم بالفعل أقل حركة وحرقا.<br />\r\nالسكر هو أكبر مرض في يومنا هذا، وقد لا يحتوي على دهون، ولكن بمجرد أن يمتصه الجسم إلى حد كبير، فإن الجسم يبقيه على الفور في مخازن الدهون لدينا.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">الأقراص والمكملات الغذائية</span></span><br />\r\nهناك عدد غير قليل من الأدوية والمكملات التي تجعل الجسم يخزن السوائل والسموم مما قد يؤدي إلى زيادة الوزن. قبل تناول أي أقراص ومكملات من أي نوع، يُنصح باستشارة الخبراء المعنيين بعد إجراء اختبارات الدم.<br />\r\n&nbsp;</p>\r\n\r\n<p><span style=\"font-size:20px\"><span style=\"color:#a566c8\">&nbsp;الإمساك</span></span><br />\r\nالإمساك خطير على الصحة ويسبب الشعور بالثقل والسمنة. إذا كنت تعاني من الإمساك، فقد يكون لديك نقص في الألياف والسوائل الغذائية، أو أنك تتناول الكثير من الوجبات السريعة أو تمارس تمارين رياضية أقل.<br />\r\n&nbsp;أضف الخضار والفواكه إلى قائمتك واستبدل الإفطار بعصائر الخضار والفواكه أو وجبة فواكه على معدة فارغة.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">منتجات الحمية</span></span><br />\r\nهل تشرب الكثير من عصائر الحمية أو تأكل الكثير من منتجات النظام الغذائي مثل الزبادي والحلويات القابلة للدهن التي تحتوي على سكريات صناعية؟ هذه المواد تترجم في الجسم إلى سكر، والإفراط في تناولها يمكن أن يؤدي أيضا إلى الانتفاخ والسمنة. وأكثر من ذلك وُجد أن بدائل السكر تشكل خطرا على الصحة ولا ينصح باستهلاكها.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">الكربوهيدرات في المساء</span></span><br />\r\nتعتبر وظائف الكربوهيدرات ضرورية للغاية بالنسبة لنا، ومن بين الأدوار المهمة إنتاج الطاقة من تكسير الجلوكوز.<br />\r\nفي الواقع، يتم تقسيم الكربوهيدرات في أجسامنا إلى سكريات، والتي نستخدمها لتوليد الطاقة. لذلك، يُنصح بتناول الكربوهيدرات في الساعات الأولى من اليوم، عندما لا نزال نشيطين، واستخدام هذه الطاقة في التمارين واحتياجات الجسم الأساسية أثناء ساعات الاستيقاظ.<br />\r\nالشخص الذي يأكل الكربوهيدرات في المساء مثل بعض المعكرونة ثم يستلقي على الأريكة، لم يعد يحرق سعرات وبالتالي يذهب السكر الذي يتحلل لمخازن الدهون في الجسم.<br />\r\n<br />\r\n<span style=\"color:#a566c8\"><span style=\"font-size:20px\">مصدر موني</span></span></p>\r\n\r\n<p>هذه الجزئية تخص النساء وحدهن: هل حدث أن اكتسبت وزنا في منتصف الشهر ولم تفهمي كيف أضفت كيلو أو اثنين إلى وزنك؟ أثناء فترة التبويض قد تحدث زيادة في الوزن تقل بعد تلك الفترة وأحيانا بعد الحيض فقط. هذه عادة سوائل، لا داعي للذعر. بالإضافة إلى ذلك، حتى في بداية الحمل ستلاحظين مثل هذه الزيادة التي لا تتعلق بعد بحجم الجنين.</p>\r\n"
          },

          // new Article(){ Id="140", LikesNumber=0, ViewsNumber=0,PostDate=new DateTime(),   CategoryId="9" ,avgReading=20,
          //  Image="/images/articles/" ,  Title="" ,
          //Description=""
          //},

      };
        }

    }

}